[
  {
    "question_id": "EOC-G-C11-1",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 11 - Modofication - 164-170.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C11",
    "question_number": 1,
    "question_type": "multiple_choice",
    "question_stem": "In addition to being a politician, Theodore Roosevelt was also an ardent naturalist. Following his defeat in the 1912 presidential election, ____ where he collected many new animal and insect specimens.",
    "option_a": "he undertook along the Amazon basin an expedition,",
    "option_b": "an expedition along the Amazon was taken by him,",
    "option_c": "he undertook an expedition along the Amazon basin,",
    "option_d": "he had undertaken an expedition along the Amazon basin and",
    "correct_answer": "he undertook an expedition along the Amazon basin,",
    "explanation_original": "Following his defeat in the 1912 presidential election, he undertook an expedition along the Amazon basin, where he collected many new animal and insect specimens.",
    "explanation_ai_enhanced": "This sentence contains a dangling modifier. The introductory phrase, 'Following his defeat in the 1912 presidential election,' describes a person (Theodore Roosevelt). Therefore, the subject of the main clause must be that person, 'he'. This eliminates option B, which incorrectly makes 'an expedition' the subject. Option C correctly places 'he' immediately after the introductory phrase and forms a complete, logical sentence.",
    "feedback_a": "This option is awkwardly phrased, separating the verb 'undertook' from its object 'an expedition'.",
    "feedback_b": "This option incorrectly makes 'an expedition' the subject of the introductory phrase, creating a dangling modifier.",
    "feedback_c": "This is the correct answer. The subject 'he' correctly follows the introductory phrase that describes him.",
    "feedback_d": "This option uses 'and' which creates a grammatical error when paired with the following 'where' clause."
  },
  {
    "question_id": "EOC-G-C11-2",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 11 - Modofication - 164-170.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C11",
    "question_number": 2,
    "question_type": "multiple_choice",
    "question_stem": "One of the greatest musicians of her time, ____ By the age of twelve, she was renowned throughout Europe as both a performer and a composer.",
    "option_a": "Clara Wieck's piano studies began when she was five.",
    "option_b": "Clara Wieck's piano studies began at five years old.",
    "option_c": "at five years old Clara Wieck began her study of the piano.",
    "option_d": "Clara Wieck began her piano studies when she was five years old.",
    "correct_answer": "Clara Wieck began her piano studies when she was five years old.",
    "explanation_original": "One of the greatest musicians of her time, Clara Wieck began her piano studies when she was five years old.",
    "explanation_ai_enhanced": "The introductory phrase, 'One of the greatest musicians of her time,' is a modifier describing a person. The subject of the main clause must be that person. Only option D correctly places the subject, 'Clara Wieck,' immediately after the comma. Options A and B incorrectly make 'Clara Wieck's piano studies' the subject, which creates a dangling modifier.",
    "feedback_a": "This option creates a dangling modifier; the 'piano studies' were not one of the greatest musicians.",
    "feedback_b": "This option also creates a dangling modifier for the same reason as option A.",
    "feedback_c": "While the subject is correct, the placement of 'at five years old' at the beginning makes the sentence awkward.",
    "feedback_d": "This is the correct answer. The subject, 'Clara Wieck', immediately follows the phrase that describes her."
  },
  {
    "question_id": "EOC-G-C11-3",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 11 - Modofication - 164-170.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C11",
    "question_number": 3,
    "question_type": "multiple_choice",
    "question_stem": "When President James Polk officially confirmed the discovery of gold at Sutter's Mill in Coloma, California, in 1848, hopeful prospectors immediately began planning for the trip. Beginning their journey in spring of 1849, ____ that was risky and mostly unknown. Some forty-niners traveled alone, but most formed companies that enabled them to share food and expenses during the long journey.",
    "option_a": "these prospectors took an overland route, known as \"forty-niners,\"",
    "option_b": "these prospectors, known as \"forty-niners,\" took an overland route",
    "option_c": "an overland route was taken by these prospectors, known as \"forty-niners\"",
    "option_d": "these prospectors, known as \"forty-niners,\" taking an overland route",
    "correct_answer": "these prospectors, known as \"forty-niners,\" took an overland route",
    "explanation_original": "Beginning their journey in spring of 1849, these prospectors, known as \"forty-niners,\" took an overland route that was risky and mostly unknown.",
    "explanation_ai_enhanced": "The introductory phrase 'Beginning their journey in spring of 1849' describes the action of the prospectors. Therefore, the subject of the main clause, 'these prospectors,' must come immediately after the comma. This eliminates option C. Option D uses the participle 'taking,' which creates a sentence fragment. Option B correctly places the subject after the comma and uses the proper verb 'took' to form a complete sentence.",
    "feedback_a": "The non-essential phrase 'known as \"forty-niners\"' should be enclosed in commas, and the comma after 'route' is misplaced.",
    "feedback_b": "This is the correct answer. It properly places the subject after the introductory modifier and forms a complete sentence.",
    "feedback_c": "This option creates a dangling modifier by making 'an overland route' the subject.",
    "feedback_d": "This option creates a sentence fragment because it uses 'taking' instead of a main verb."
  },
  {
    "question_id": "EOC-G-C11-4",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 11 - Modofication - 164-170.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C11",
    "question_number": 4,
    "question_type": "multiple_choice",
    "question_stem": "Environmentalists estimate that nearly a trillion plastic bags-in use since the 1970s- are produced worldwide each year. The problems that they cause are well known: unable to break down in landfills, ____ They also contain toxic dyes that contaminate water and soil. As a result, an increasing number of cities are banning their use.",
    "option_a": "animals are harmed when they consume the bags.",
    "option_b": "the bags harm the animals that consume them.",
    "option_c": "animals are harmed by consuming the bags.",
    "option_d": "harm is caused to animals that consume them.",
    "correct_answer": "the bags harm the animals that consume them.",
    "explanation_original": "...unable to break down in landfills, the bags harm the animals that consume them.",
    "explanation_ai_enhanced": "The introductory modifying phrase 'unable to break down in landfills' describes the plastic bags. To avoid a dangling modifier, the subject of the main clause must be 'the bags'. Only option B correctly places 'the bags' immediately after the comma.",
    "feedback_a": "This option creates a dangling modifier, incorrectly suggesting that 'animals' are unable to break down in landfills.",
    "feedback_b": "This is the correct answer. The subject 'the bags' logically follows the phrase that describes them.",
    "feedback_c": "This option creates a dangling modifier, incorrectly suggesting that 'animals' are unable to break down in landfills.",
    "feedback_d": "This option creates a dangling modifier, incorrectly suggesting that 'harm' is unable to break down in landfills."
  },
  {
    "question_id": "EOC-G-C11-5",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 11 - Modofication - 164-170.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C11",
    "question_number": 5,
    "question_type": "multiple_choice",
    "question_stem": "Bioluminescence is light created by a chemical reaction produced within an organism. Most bioluminescent organisms are found in the ocean, although a few, including fireflies and certain fungi, are found on land. ____, some form of bioluminescence is produced by approximately 90% of deep-sea creatures, including fish, bacteria, and jellies.",
    "option_a": "Dwelling almost exclusively in saltwater habitats,",
    "option_b": "They dwell almost exclusively within saltwater habitats,",
    "option_c": "Saltwater habitats being dwelled in almost exclusively by them,",
    "option_d": "Bioluminescent organisms dwell almost exclusively in saltwater habitats, and",
    "correct_answer": "Bioluminescent organisms dwell almost exclusively in saltwater habitats, and",
    "explanation_original": "Bioluminescent organisms dwell almost exclusively in saltwater habitats, and some form of bioluminescence is produced by approximately 90% of deep-sea creatures, including fish, bacteria, and jellies.",
    "explanation_ai_enhanced": "This question tests sentence structure and modifiers. Option A creates a dangling modifier because the phrase 'Dwelling almost exclusively in saltwater habitats' would incorrectly modify 'some form of bioluminescence'. Option B creates a comma splice. Option C is ungrammatical. Option D correctly forms two complete and related sentences joined by the conjunction 'and', creating a coherent compound sentence.",
    "feedback_a": "This option creates a dangling modifier; 'some form of bioluminescence' is not what is 'dwelling'.",
    "feedback_b": "This option creates a comma splice by joining two independent clauses with only a comma.",
    "feedback_c": "This phrasing is grammatically incorrect and awkward.",
    "feedback_d": "This is the correct answer. It forms a grammatically correct compound sentence by joining two independent clauses with ', and'."
  },
  {
    "question_id": "EOC-G-C11-6",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 11 - Modofication - 164-170.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C11",
    "question_number": 6,
    "question_type": "multiple_choice",
    "question_stem": "Guerilla films are typically made by independent producers who lack the budget to obtain permits, rent locations, and build expensive sets. In the past, these films were often poorly made; however, their quality has improved significantly. While it was once difficult for filmmakers to obtain the necessary equipment, ____.",
    "option_a": "professional quality digital cameras are now widely available to filmmakers that are inexpensive.",
    "option_b": "professional quality digital cameras are now widely available to filmmakers, and these are inexpensive.",
    "option_c": "inexpensive professional quality digital cameras are now widely available to filmmakers.",
    "option_d": "now, professional quality digital cameras are widely available to filmmakers that are inexpensive.",
    "correct_answer": "inexpensive professional quality digital cameras are now widely available to filmmakers.",
    "explanation_original": "While it was once difficult for filmmakers to obtain the necessary equipment, inexpensive professional quality digital cameras are now widely available to filmmakers.",
    "explanation_ai_enhanced": "This question tests misplaced modifiers. The adjective 'inexpensive' should describe the 'cameras'. In options A and D, the clause 'that are inexpensive' is placed next to 'filmmakers', incorrectly suggesting that the filmmakers are inexpensive. Option C avoids this error by placing the adjective 'inexpensive' directly before the noun it modifies, 'cameras'.",
    "feedback_a": "This option contains a misplaced modifier; 'that are inexpensive' incorrectly modifies 'filmmakers'.",
    "feedback_b": "This option is grammatically correct but wordy compared to the more concise option C.",
    "feedback_c": "This is the correct answer. The modifier 'inexpensive' is correctly placed next to the noun it describes, 'cameras'.",
    "feedback_d": "This option also contains a misplaced modifier, suggesting the filmmakers are inexpensive."
  }
]
