[
  {
    "question_id": "EOC-M-C27-1",
    "source_file_name": "Math - Chapter 27 - Statistics I - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C27",
    "question_number": 1,
    "difficulty": "Easy",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Statistics",
    "Sub_Classification": "Calculations",
    "Concept_Classification": "Data_Calculate_Mean",
    "question_type": "multiple_choice",
    "image_url": null,
    "option_a": "64.5",
    "option_b": "65",
    "option_c": "66",
    "option_d": "66.5",
    "option_e": null,
    "correct_answer": "66",
    "explanation_original": "The sum of the heights in the first class is $14 \\times 63 = 882$. The sum of the heights in the second class is $21 \\times 68 = 1,428$. The sum of the heights in the combined class is then $882 + 1428 = 2,310$. The average height is $\\frac{\\text{Sum of the heights}}{\\text{Total number of students}} = \\frac{2,310}{(14 + 21)} = 66$.",
    "explanation_ai_enhanced": "To find the combined average, we must calculate a weighted average, since the two classes have different numbers of students. First, find the total height of all students in the first class: $14 \\text{ students} \\times 63 \\text{ inches/student} = 882 \\text{ inches}$. Next, find the total height of all students in the second class: $21 \\text{ students} \\times 68 \\text{ inches/student} = 1,428 \\text{ inches}$. Now, find the sum of the heights of all students from both classes: $882 + 1,428 = 2,310 \\text{ inches}$. Finally, find the total number of students: $14 + 21 = 35$ students. The combined average height is the total height divided by the total number of students: $\\frac{2,310}{35} = 66$ inches.",
    "feedback_a": "This is incorrect. This value might be obtained by miscalculating the weighted average. Ensure you are weighting the averages by the number of students in each group.",
    "feedback_b": "This is incorrect. This value is the simple average of the two heights ($\\frac{63+68}{2} = 65.5$), which is incorrect because the groups have different sizes. The larger group's average has more 'weight'.",
    "feedback_c": "This is the correct answer. The average is a weighted average calculated as $\\frac{(14 \\times 63) + (21 \\times 68)}{14 + 21} = \\frac{882 + 1428}{35} = \\frac{2310}{35} = 66$.",
    "feedback_d": "This is incorrect. This might be a result of a calculation error during the division. Double-check your arithmetic.",
    "passage_content": null,
    "question_stem": "The average height of 14 students in one class is 63 inches. The average height of 21 students in another class is 68. If the two classes are combined, what is the average height, in inches, of the students in the combined class?"
  },
  {
    "question_id": "EOC-M-C27-2",
    "source_file_name": "Math - Chapter 27 - Statistics I - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C27",
    "question_number": 2,
    "difficulty": "Easy",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Statistics",
    "Sub_Classification": "Calculations",
    "Concept_Classification": "Data_Calculate_Mean",
    "question_type": "multiple_choice",
    "image_url": null,
    "option_a": "95",
    "option_b": "96",
    "option_c": "97",
    "option_d": "98",
    "option_e": null,
    "correct_answer": "97",
    "explanation_original": "The sum of all five of Kristie's test scores is $5 \\times 94 = 470$. The sum of her last three test scores is $3 \\times 92 = 276$. The difference between these two sums is the sum of her first two test scores: $470 - 276 = 194$. The average of her first two test scores is then $\\frac{194}{2} = 97$.",
    "explanation_ai_enhanced": "To solve this, we first find the total sum of scores for all tests, and then subtract the total sum for the last three tests. The remaining sum is for the first two tests. Step 1: Calculate the sum of all five scores: $5 \\text{ tests} \\times 94 \\text{ avg score} = 470 \\text{ total points}$. Step 2: Calculate the sum of the last three scores: $3 \\text{ tests} \\times 92 \\text{ avg score} = 276 \\text{ total points}$. Step 3: Find the sum of the first two scores by subtraction: $470 - 276 = 194 \\text{ points}$. Step 4: Calculate the average of the first two scores: $\\frac{194}{2} = 97$.",
    "feedback_a": "This answer is close, but incorrect. You may have made a small error in your subtraction or multiplication. Re-calculate the total scores for each group of tests.",
    "feedback_b": "This answer is incorrect. Review your steps to ensure you've correctly calculated the total points for the five tests and the three tests before finding the difference.",
    "feedback_c": "This is the correct answer. The total score for five tests is $5 \\times 94 = 470$. The total score for the last three is $3 \\times 92 = 276$. The sum of the first two is $470 - 276 = 194$. The average is $\\frac{194}{2} = 97$.",
    "feedback_d": "This answer is incorrect. It's the average of 94 and 92, which doesn't account for the number of tests. The total score must be calculated first.",
    "passage_content": null,
    "question_stem": "Kristie has taken five tests in science class. The average of all five of Kristie's test scores is 94. The average of her last three test scores is 92. What is the average of her first two test scores?"
  },
  {
    "question_id": "EOC-M-C27-3",
    "source_file_name": "Math - Chapter 27 - Statistics I - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C27",
    "question_number": 3,
    "difficulty": "Medium",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Statistics",
    "Sub_Classification": "Interpretation",
    "Concept_Classification": "Data_Interpret_Range",
    "question_type": "multiple_choice",
    "image_url": null,
    "option_a": "All the units expired within 3 days.",
    "option_b": "The unit with the longest shelf life took 3 days longer to expire than the unit with the shortest shelf life.",
    "option_c": "The mean shelf life of the units is 3 more than the median.",
    "option_d": "The median shelf life of the units is 3 more than the mean.",
    "option_e": null,
    "correct_answer": "The unit with the longest shelf life took 3 days longer to expire than the unit with the shortest shelf life.",
    "explanation_original": "A range of 3 days means the difference between the longest shelf life and the shortest shelf life among the units is 3. This could be 10 days vs. 13 days or 25 days vs. 28 days. The range says nothing about the mean or median.",
    "explanation_ai_enhanced": "The range of a dataset is defined as the difference between the maximum and minimum values. In this context, the shelf life range is 3 days. This means: (Longest shelf life) - (Shortest shelf life) = 3 days. This statement directly matches the definition of range.",
    "feedback_a": "This is not necessarily true. The range only tells us the spread of the data, not the actual values. For example, the shelf lives could range from 10 to 13 days.",
    "feedback_b": "This is the correct answer. This statement is the definition of the range: the difference between the maximum value (longest shelf life) and the minimum value (shortest shelf life).",
    "feedback_c": "This is incorrect. The range provides information about the spread (dispersion) of the data, but it gives no information about the central tendency (mean or median).",
    "feedback_d": "This is incorrect. The range is unrelated to the mean or median. It only measures the difference between the highest and lowest values.",
    "passage_content": null,
    "question_stem": "A food company hires an independent research agency to determine its product's shelf life, the length of time it may be stored before it expires. Using a random sample of 40 units of the product, the research agency finds that the product's shelf life has a range of 3 days. Which of the following must be true about the units in the sample?"
  },
  {
    "question_id": "EOC-M-C27-4",
    "source_file_name": "Math - Chapter 27 - Statistics I - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C27",
    "question_number": 4,
    "difficulty": "Medium",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Statistics",
    "Sub_Classification": "Calculations",
    "Concept_Classification": "Data_Calculate_Median",
    "question_type": "multiple_choice",
    "image_url": "EOC-M-C27-4_image.png",
    "option_a": "10",
    "option_b": "12",
    "option_c": "16",
    "option_d": "23",
    "option_e": null,
    "correct_answer": "12",
    "explanation_original": "Because there are 20 editors, the median is the average of the 10th and 11th editors' number of books read. From the graph, the 10th and 11th editors both read between 11 and 15 books last year, which means the average must also be between 11 and 15. The only answer choice between 11 and 15 is 12.",
    "explanation_ai_enhanced": "The median is the middle value in a dataset. With an even number of data points (20 editors), the median is the average of the two middle values: the 10th and 11th values. Let's find where these values fall by looking at the cumulative frequency from the histogram. 1-5 books: 3 editors. 6-10 books: 5 editors (cumulative: $3+5=8$). 11-15 books: 6 editors (cumulative: $8+6=14$). The 10th and 11th editors both fall into the '11-15 books' category. Therefore, the median must be a value between 11 and 15 (inclusive). Of the choices provided, only 12 fits this criterion.",
    "feedback_a": "This value falls in the '6-10' bin. However, the cumulative frequency up to 10 books is only 8 editors, so the median (10th/11th editor) must be in the next bin.",
    "feedback_b": "This is the correct answer. The 10th and 11th data points determine the median. The first bin has 3 editors, the second has 5 (total 8). So, the 10th and 11th editors must be in the third bin, which corresponds to 11-15 books. 12 is the only option in this range.",
    "feedback_c": "This value falls in the '16-20' bin. By the time we get to this bin, we have already passed the 10th and 11th editors, so this cannot be the median.",
    "feedback_d": "This value falls in the '21-25' bin. This is too high to be the median, as the 10th and 11th values are found much earlier in the distribution.",
    "passage_content": null,
    "question_stem": "The histogram above shows the number of books read last year by 20 editors at a publishing company. Which of the following could be the median number of books read by the 20 editors?"
  },
  {
    "question_id": "EOC-M-C27-5",
    "source_file_name": "Math - Chapter 27 - Statistics I - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C27",
    "question_number": 5,
    "difficulty": "Easy",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Graphical_Analysis",
    "Sub_Classification": "Interpretation",
    "Concept_Classification": "Data_Read_Bar_Chart",
    "question_type": "multiple_choice",
    "image_url": "EOC-M-C27-5_image.png",
    "option_a": "3",
    "option_b": "5",
    "option_c": "8",
    "option_d": "11",
    "option_e": null,
    "correct_answer": "11",
    "explanation_original": "The median score, designated by the line segment in the middle of the \"\"box\"\", is approximately 83. The lowest individual score, designated by the line segment at the left end of the plot, is approximately 72. The difference between them is $83 - 72 = 11$.",
    "explanation_ai_enhanced": "A box plot displays five key values: minimum, first quartile (Q1), median, third quartile (Q3), and maximum. The question asks for the difference between the median and the minimum (lowest score). From the plot: The median is the line inside the box, which is at approximately 83. The lowest score is the end of the left whisker, which is at approximately 72. The difference is $83 - 72 = 11$.",
    "feedback_a": "This is incorrect. This might be the difference between the first quartile (Q1 at ~80) and the median (83).",
    "feedback_b": "This value doesn't correspond to the difference between any two main points on the box plot. Re-identify the median and the minimum value.",
    "feedback_c": "This is incorrect. This might be an estimation error or the difference between the third quartile (Q3 at ~91) and the median (83).",
    "feedback_d": "This is the correct answer. The median is at approximately 83 and the lowest score (minimum) is at approximately 72. The difference is $83 - 72 = 11$.",
    "passage_content": null,
    "question_stem": "The box plot above summarizes the final exam scores of 26 students in a math class. Based on the box plot, which of the following best estimates the number of points by which the median score of the 26 students exceeds the lowest individual score?"
  },
  {
    "question_id": "EOC-M-C27-6",
    "source_file_name": "Math - Chapter 27 - Statistics I - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C27",
    "question_number": 6,
    "difficulty": "Easy",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Statistics",
    "Sub_Classification": "Calculations",
    "Concept_Classification": "Data_Calculate_Mean",
    "question_type": "multiple_choice",
    "image_url": "EOC-M-C27-6_image.png",
    "option_a": "19",
    "option_b": "20",
    "option_c": "21",
    "option_d": "22",
    "option_e": null,
    "correct_answer": "20",
    "explanation_original": "B $(18 \\times 6) + (19 \\times 3) + (20 \\times 5) + (21 \\times 4) + (22 \\times 2) + (23 \\times 3) + (24 \\times 1) / 24 \\approx 20.25$.",
    "explanation_ai_enhanced": "To find the mean, we sum all the ages and divide by the number of winners (24). We can get the sum from the dot plot by multiplying each age by its frequency: Sum = $(18 \\times 6) + (19 \\times 3) + (20 \\times 5) + (21 \\times 4) + (22 \\times 2) + (23 \\times 3) + (24 \\times 1) = 108 + 57 + 100 + 84 + 44 + 69 + 24 = 486$. Now, calculate the mean: Mean = $\\frac{486}{24} = 20.25$. The value closest to 20.25 is 20.",
    "feedback_a": "This is incorrect. 19 is the mode (most frequent value) along with 18, but it is not the mean. The mean is pulled higher by the ages above 20.",
    "feedback_b": "This is the correct answer. The calculated mean is $\\frac{486}{24} = 20.25$, which is closest to 20.",
    "feedback_c": "This is incorrect. This might be the median of the data, but not the mean. The mean requires calculating the total sum of ages.",
    "feedback_d": "This is incorrect. The ages are more heavily clustered around the lower end, so the mean will be lower than 22.",
    "passage_content": null,
    "question_stem": "The dotplot above shows the distribution of ages for 24 winners of the Miss World beauty pageant at the time they were crowned. Based on the data, which of the following is closest to the average (arithmetic mean) age of the winning Miss World pageant contestant?"
  },
  {
    "question_id": "EOC-M-C27-7",
    "source_file_name": "Math - Chapter 27 - Statistics I - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C27",
    "question_number": 7,
    "difficulty": "Easy",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Statistics",
    "Sub_Classification": "Calculations",
    "Concept_Classification": "Data_Calculate_Median",
    "question_type": "student_produced_response",
    "image_url": "EOC-M-C27-7_image.png",
    "option_a": "",
    "option_b": "",
    "option_c": "",
    "option_d": "",
    "option_e": null,
    "correct_answer": "67",
    "explanation_original": "The median is represented by the average of the 14th and 15th days, both of which are $67^{\\circ}F$.",
    "explanation_ai_enhanced": "There are 28 data points (days). Since this is an even number, the median is the average of the two middle values, the 14th and 15th values. We use the frequency table to find where these values lie. Day 1-3 (3 days): Temp is 60. Cumulative days: 3. Day 4-7 (4 days): Temp is 61. Cumulative days: $3+4=7$. Day 8-11 (4 days): Temp is 63. Cumulative days: $7+4=11$. Day 12-21 (10 days): Temp is 67. Cumulative days: $11+10=21$. Both the 14th and 15th day fall into this group, where the temperature is 67. The average of 67 and 67 is 67. So, the median temperature is 67.",
    "feedback_a": "",
    "feedback_b": "",
    "feedback_c": "",
    "feedback_d": "",
    "passage_content": null,
    "question_stem": "The table above gives the distribution of low temperatures for a city over 28 days. What is the median low temperature, in degrees Fahrenheit (°F), of the city for these 28 days?"
  },
  {
    "question_id": "EOC-M-C27-8",
    "source_file_name": "Math - Chapter 27 - Statistics I - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C27",
    "question_number": 8,
    "difficulty": "Medium",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Statistics",
    "Sub_Classification": "Interpretation",
    "Concept_Classification": "Data_Interpret_Std_Deviation",
    "question_type": "multiple_choice",
    "image_url": "EOC-M-C27-8_image.png",
    "option_a": "Aisne and Lalinde",
    "option_b": "Alsace and Garonne",
    "option_c": "Centre and Midi",
    "option_d": "Rhone and Vosges",
    "option_e": null,
    "correct_answer": "Rhone and Vosges",
    "explanation_original": "The standard deviation decreases the most when the outliers, the data points furthest away from the mean, are removed. The outliers here are the Rhone and the Vosges.",
    "explanation_ai_enhanced": "Standard deviation is a measure of the spread or dispersion of a dataset. To cause the greatest decrease in standard deviation, we should remove the most extreme values, or outliers, because they contribute the most to the spread. Looking at the table, most values are in the 20s and 30s. The values for Rhone (5) and Vosges (93) are the minimum and maximum values, respectively, and are furthest from the center of the data. Removing these two outliers will make the dataset much less spread out, thus causing the largest decrease in standard deviation.",
    "feedback_a": "These two values (27 and 27) are very close to the center of the data. Removing them would have a very small effect on the standard deviation.",
    "feedback_b": "These two values (25 and 23) are close together and near the center of the data. Removing them would not significantly decrease the spread.",
    "feedback_c": "These two values (30 and 32) are near the center of the data. Removing them would have a minimal impact on the standard deviation.",
    "feedback_d": "This is the correct answer. Rhone (5) and Vosges (93) are the most extreme outliers. Removing them will reduce the spread of the data more than removing any other pair, thus causing the greatest decrease in standard deviation.",
    "passage_content": null,
    "question_stem": "Locks are sections of canals in which the water level can be mechanically changed to raise and lower boats. The table below shows the number of locks for 10 canals in France. Removing which of the following two canals from the data would result in the greatest decrease in the standard deviation of the number of locks in each canal?"
  },
  {
    "question_id": "EOC-M-C27-9",
    "source_file_name": "Math - Chapter 27 - Statistics I - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C27",
    "question_number": 9,
    "difficulty": "Easy",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Statistics",
    "Sub_Classification": "Calculations",
    "Concept_Classification": "Data_Calculate_Median",
    "question_type": "multiple_choice",
    "image_url": null,
    "option_a": "The sum of all the shoe sizes in the sample is 500 inches.",
    "option_b": "The average of the smallest shoe size and the largest shoe size in the sample is 10 inches.",
    "option_c": "The difference between the smallest shoe size and the largest shoe size in the sample is 10 inches.",
    "option_d": "At least half of the customers in the sample have shoe sizes greater than or equal to 10 inches.",
    "option_e": null,
    "correct_answer": "At least half of the customers in the sample have shoe sizes greater than or equal to 10 inches.",
    "explanation_original": "By definition, at least half the values are greater than or equal to the median and at least half the values are less than or equal to the median.",
    "explanation_ai_enhanced": "The median is the value that separates the higher half of a data sample from the lower half. If the median is 10, it means that when the data is sorted, the middle value is 10. By definition, this ensures that at least half of the data points are greater than or equal to the median, and at least half are less than or equal to the median. Therefore, this statement must be true.",
    "feedback_a": "This would only be true if the mean (average) shoe size was 10. The median being 10 does not guarantee this. For example, a few very large shoe sizes could raise the mean above 10.",
    "feedback_b": "This describes the midrange, not the median. The median is the middle value of the entire dataset, not just an average of the smallest and largest values.",
    "feedback_c": "This describes the range. The median provides information about the center of the data, not its spread or range.",
    "feedback_d": "This is the correct answer. This statement is the definition of the median. It is the point at which half the data values are at or above it, and half are at or below it.",
    "passage_content": null,
    "question_stem": "A shoe store surveyed a random sample of 50 customers to better estimate which shoe sizes should be kept in stock. The store found that the median shoe size of the customers in the sample is 10 inches. Which of the following statements must be true?"
  },
  {
    "question_id": "EOC-M-C27-10",
    "source_file_name": "Math - Chapter 27 - Statistics I - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C27",
    "question_number": 10,
    "difficulty": "Medium",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Statistics",
    "Sub_Classification": "Interpretation",
    "Concept_Classification": "Data_Interpret_Std_Deviation",
    "question_type": "multiple_choice",
    "image_url": "EOC-M-C27-10_image.png",
    "option_a": "The standard deviation of travel times for Bus A is smaller.",
    "option_b": "The standard deviation of travel times for Bus B is smaller.",
    "option_c": "The standard deviation of travel times is the same for Bus A and Bus B.",
    "option_d": "The standard deviation of travel times for Bus A and Bus B cannot be compared with the data provided.",
    "option_e": null,
    "correct_answer": "The standard deviation of travel times for Bus A is smaller.",
    "explanation_original": "Even though the frequencies are the same, the travel times themselves are more spread out for Bus B. The travel times for Bus A are much closer together. Therefore, the standard deviation of travel times for Bus A is smaller.",
    "explanation_ai_enhanced": "Standard deviation measures how spread out the data points are from the mean. Let's compare the spread of the two datasets visually. Bus A times: 44, 45, 47, 48. These values are tightly clustered. The range is $48-44=4$. Bus B times: 25, 30, 35, 40. These values are much more spread out. The range is $40-25=15$. Since the travel times for Bus A are more tightly clustered and less spread out than those for Bus B, the standard deviation for Bus A must be smaller.",
    "feedback_a": "This is the correct answer. The data for Bus A is tightly clustered (range of 4), while the data for Bus B is much more spread out (range of 15). A smaller spread implies a smaller standard deviation.",
    "feedback_b": "This is incorrect. The data for Bus B is visibly more spread out, meaning it has a larger standard deviation.",
    "feedback_c": "This is incorrect. Since the spread of the data is clearly different, their standard deviations will be different.",
    "feedback_d": "This is incorrect. We can compare the standard deviations by observing the spread (dispersion) of the data in the tables.",
    "passage_content": null,
    "question_stem": "The tables below give the distribution of travel times between two towns for Bus A and Bus B over the same 40 days. Which of the following statements is true about the data shown for these 40 days?"
  },
  {
    "question_id": "EOC-M-C27-11",
    "source_file_name": "Math - Chapter 27 - Statistics I - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C27",
    "question_number": 11,
    "difficulty": "Easy",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Statistics",
    "Sub_Classification": "Calculations",
    "Concept_Classification": "Data_Calculate_Median",
    "question_type": "multiple_choice",
    "image_url": "EOC-M-C27-11_image.png",
    "option_a": "The median weight of the kayaks made by Company A is smaller.",
    "option_b": "The median weight of the kayaks made by Company B is smaller.",
    "option_c": "The median weight of the kayaks is the same for both companies.",
    "option_d": "The relationship cannot be determined from the information given.",
    "option_e": null,
    "correct_answer": "The median weight of the kayaks is the same for both companies.",
    "explanation_original": "The median weight is represented by the 10th kayak (47 pounds for both Company A and Company B). The median weight is the same for both companies.",
    "explanation_ai_enhanced": "For a dataset with 19 items, the median is the middle value, which is the $\\frac{19+1}{2} = 10$th value when the data is sorted. We need to find the 10th kayak for each company. Company A: 45 lbs (8 kayaks). 47 lbs (6 kayaks). The 10th kayak falls in the 47 lbs category. So, the median for A is 47. Company B: 45 lbs (2 kayaks). 46 lbs (4 kayaks, cumulative=6). 47 lbs (6 kayaks, cumulative=12). The 10th kayak for Company B also falls in the 47 lbs category. So, the median for B is 47. The medians are the same.",
    "feedback_a": "This is incorrect. Calculation shows the median for Company A is 47 lbs.",
    "feedback_b": "This is incorrect. Calculation shows the median for Company B is 47 lbs.",
    "feedback_c": "This is the correct answer. For 19 kayaks, the median is the 10th value. For Company A, the 10th kayak is 47 lbs. For Company B, the 10th kayak is also 47 lbs. Their medians are equal.",
    "feedback_d": "This is incorrect. The median can be determined by counting the frequencies in the bar chart.",
    "passage_content": null,
    "question_stem": "The bar chart above shows the distribution of weights (to the nearest pound) for 19 kayaks made by Company A and 19 kayaks made by Company B. Which of the following correctly compares the median weight of the kayaks made by each company?"
  },
  {
    "question_id": "EOC-M-C27-12",
    "source_file_name": "Math - Chapter 27 - Statistics I - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C27",
    "question_number": 12,
    "difficulty": "Medium",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Statistics",
    "Sub_Classification": "Calculations",
    "Concept_Classification": "Data_Calculate_Median",
    "question_type": "multiple_choice",
    "image_url": "EOC-M-C27-12_image.png",
    "option_a": "II only",
    "option_b": "III only",
    "option_c": "II and III",
    "option_d": "I, II, and III",
    "option_e": null,
    "correct_answer": "III only",
    "explanation_original": "Arranging the scores in order, 75, 83, 87, 87, 90, 91, 98. The average is $\\frac{75+83+87+87+90+91+98}{7} \\approx 87.3$. The mode is 87. The median is also 87. The range is $98 - 75 = 23$. From these numbers, I is false, II is false, and III is true.",
    "explanation_ai_enhanced": "First, let's calculate the required statistics. Sorted scores: 75, 83, 87, 87, 90, 91, 98. Mean: $\\frac{75+83+87+87+90+91+98}{7} = \\frac{611}{7} \\approx 87.3$. Median (the 4th value): 87. Mode (most frequent value): 87. Range (max - min): $98 - 75 = 23$. Now let's evaluate the statements. I. The mode (87) is greater than the median (87). False ($87=87$). II. The median (87) is greater than the mean (~87.3). False ($87 < 87.3$). III. The range (23) is greater than 20. True ($23 > 20$). Only statement III is true.",
    "feedback_a": "This is incorrect. Statement II is false because the median (87) is slightly less than the mean (~87.3).",
    "feedback_b": "This is the correct answer. Only statement III, 'The range is greater than 20', is true, as the range is 23.",
    "feedback_c": "This is incorrect. Statement II is false.",
    "feedback_d": "This is incorrect. Statements I and II are false.",
    "passage_content": null,
    "question_stem": "The table above shows the scores for Jay's first seven math quizzes. Which of the following are true about his scores? I. The mode is greater than the median. II. The median is greater than the mean. III. The range is greater than 20."
  },
  {
    "question_id": "EOC-M-C27-13",
    "source_file_name": "Math - Chapter 27 - Statistics I - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C27",
    "question_number": 13,
    "difficulty": "Medium",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Statistics",
    "Sub_Classification": "Calculations",
    "Concept_Classification": "Data_Calculate_Mean",
    "question_type": "multiple_choice",
    "image_url": "EOC-M-C27-13_image.png",
    "option_a": "Mean = 7.6, Range = 4",
    "option_b": "Mean = 7.6, Range = 5",
    "option_c": "Mean = 8.2, Range = 4",
    "option_d": "Mean = 8.2, Range = 5",
    "option_e": null,
    "correct_answer": "Mean = 7.6, Range = 5",
    "explanation_original": "Mean = $\\frac{((5 \\times 2) + (6 \\times 1) + (8 \\times 4) + (9 \\times 2) + (10 \\times 1))}{(2+1+4+2+1)} = \\frac{76}{10} = 7.6$. Range = $10 - 5 = 5$.",
    "explanation_ai_enhanced": "First, calculate the range. The range is the maximum value minus the minimum value shown on the graph. Range = $10 - 5 = 5$. This eliminates options A and C. Next, calculate the mean. We find the total sum by multiplying each integer by its frequency and then divide by the total number of integers. Total Sum = $(5 \\times 2) + (6 \\times 1) + (7 \\times 0) + (8 \\times 4) + (9 \\times 2) + (10 \\times 1) = 10 + 6 + 0 + 32 + 18 + 10 = 76$. Total Frequency = $2 + 1 + 4 + 2 + 1 = 10$. Mean = $\\frac{76}{10} = 7.6$. So the mean is 7.6 and the range is 5.",
    "feedback_a": "This option has the correct mean but an incorrect range. The range is the difference between the max and min values in the set, which are 10 and 5.",
    "feedback_b": "This is the correct answer. The mean is calculated as $\\frac{76}{10} = 7.6$ and the range is $10 - 5 = 5$.",
    "feedback_c": "This option has an incorrect mean and an incorrect range.",
    "feedback_d": "This option has an incorrect mean but the correct range. Recalculate the weighted average to find the correct mean.",
    "passage_content": null,
    "question_stem": "The graph above shows the frequency distribution of a list of randomly generated integers between 5 and 10. Which of the following correctly gives the mean and the range of the list of integers?"
  },
  {
    "question_id": "EOC-M-C27-14",
    "source_file_name": "Math - Chapter 27 - Statistics I - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C27",
    "question_number": 14,
    "difficulty": "Hard",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Statistics",
    "Sub_Classification": "Interpretation",
    "Concept_Classification": "Data_Interpret_Std_Deviation",
    "question_type": "multiple_choice",
    "image_url": "EOC-M-C27-14_image.png",
    "option_a": "I and II only",
    "option_b": "I and III only",
    "option_c": "II and III only",
    "option_d": "I, II, and III",
    "option_e": null,
    "correct_answer": "I, II, and III",
    "explanation_original": "Before the 900-calorie meal is added, the median is the average of the 5th and 6th meals (550), the mode is 550, and the range is $900 - 500 = 400$. After the 900-calorie meal is added, the median becomes the 6th meal (still 550), the mode is still 550, and the range is still 400. None of them change.",
    "explanation_ai_enhanced": "Let's analyze the dataset before and after the change. Original data (sorted): 500, 500, 520, 550, 550, 550, 550, 600, 600, 900. Before: There are 10 meals. Median is avg of 5th & 6th values: $\\frac{550+550}{2}=550$. Mode is 550 (appears 4 times). Range is $900 - 500 = 400$. After adding a 900-calorie meal: New data (sorted): 500, 500, 520, 550, 550, 550, 550, 600, 600, 900, 900. After: There are 11 meals. Median is the 6th value: 550. Mode is still 550 (4 times). Range is $900 - 500 = 400$. All three measures (Median, Mode, Range) did not change.",
    "feedback_a": "This is partially correct, but the Range also does not change. Check the calculation for the range before and after.",
    "feedback_b": "This is partially correct, but the Mode also does not change. Check the calculation for the mode before and after.",
    "feedback_c": "This is partially correct, but the Median also does not change. Check the calculation for the median before and after.",
    "feedback_d": "This is the correct answer. The median remains 550, the mode remains 550, and the range remains 400. None of the three statistical measures change.",
    "passage_content": null,
    "question_stem": "The table above lists the number of calories in each of Mary's last 10 meals. If a 900-calorie meal that she had today is added to the values listed, which of the following statistical measures of the data will not change? I. Median II. Mode III. Range"
  },
  {
    "question_id": "EOC-M-C27-15",
    "source_file_name": "Math - Chapter 27 - Statistics I - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C27",
    "question_number": 15,
    "difficulty": "Hard",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Statistics",
    "Sub_Classification": "Calculations",
    "Concept_Classification": "Data_Calculate_Median",
    "question_type": "multiple_choice",
    "image_url": "EOC-M-C27-15_image.png",
    "option_a": "The mean and median number of films shown in each class are both greater in School A.",
    "option_b": "The mean and median number of films shown in each class are both greater in School B.",
    "option_c": "The mean number of films shown in each class is greater in School A, but the median is the same in both schools.",
    "option_d": "The mean number of films shown in each class is greater in School B, but the median is the same in both schools.",
    "option_e": null,
    "correct_answer": "The mean number of films shown in each class is greater in School B, but the median is the same in both schools.",
    "explanation_original": "The median in School A is represented by the 10th class (4 films) and the median in School B is represented by the 8th class (also 4 films). The median is the same in both schools. Now we calculate the means: Mean in School A = $\\frac{(1 \\times 2+2 \\times 3+3 \\times 4+4 \\times 5+5 \\times 5)}{19} \\approx 3.42$. Mean in School B = $\\frac{(1 \\times 1+2 \\times 2+3 \\times 3+4 \\times 4+5 \\times 5)}{15} \\approx 3.67$. The mean is greater in School B. Intuitively, this makes sense because the distribution for School A has a higher proportion of the smaller numbers 1, 2, and 3 as shown by the chart. These smaller numbers pull down the mean.",
    "explanation_ai_enhanced": "First, let's find the medians. School A has 19 classes, so the median is the 10th class. Counting frequencies: 2 (at 1) + 3 (at 2) + 4 (at 3) = 9. The 10th class falls in the '4 films' bar. Median A = 4. School B has 15 classes, so the median is the 8th class. Counting frequencies: 1 (at 1) + 2 (at 2) + 3 (at 3) = 6. The 8th class falls in the '4 films' bar. Median B = 4. The medians are the same. Now, the means. Mean A = $\\frac{1(2)+2(3)+3(4)+4(5)+5(5)}{19} = \\frac{65}{19} \\approx 3.42$. Mean B = $\\frac{1(1)+2(2)+3(3)+4(4)+5(5)}{15} = \\frac{55}{15} \\approx 3.67$. So, the mean is greater in School B, but the medians are the same.",
    "feedback_a": "This is incorrect. The mean for School B is greater than for School A.",
    "feedback_b": "This is incorrect. The medians are the same for both schools.",
    "feedback_c": "This is incorrect. The mean for School A is smaller than for School B.",
    "feedback_d": "This is the correct answer. The median for both schools is 4. The mean for School A is ~3.42 and for School B is ~3.67. Thus, the mean is greater in School B, and the medians are the same.",
    "passage_content": null,
    "question_stem": "The bar chart above shows the number of films shown in class over the past year for 19 classes in School A and 15 classes in School B. Which of the following correctly compares the mean and median number of films shown in each class for the two schools?"
  },
  {
    "question_id": "EOC-M-C27-16",
    "source_file_name": "Math - Chapter 27 - Statistics I - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C27",
    "question_number": 16,
    "difficulty": "Medium",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Statistics",
    "Sub_Classification": "Interpretation",
    "Concept_Classification": "Data_Interpret_Std_Deviation",
    "question_type": "multiple_choice",
    "image_url": "EOC-M-C27-16_image.png",
    "option_a": "Only the mean will decrease.",
    "option_b": "Only the mean and standard deviation will decrease.",
    "option_c": "Only the mean and median will decrease.",
    "option_d": "The mean, median, and standard deviation will decrease.",
    "option_e": null,
    "correct_answer": "Only the mean and standard deviation will decrease.",
    "explanation_original": "Before the car is removed, the median is represented by the 8th car (23 mpg). After the car is removed, the median is represented by the average of the 7th and 8th cars (still 23 mpg). So the median stays the same. However, the mean and the standard deviation both decrease. We're removing a data point higher than all the others so the mean decreases. We're also reducing the spread in the data so the standard deviation decreases.",
    "explanation_ai_enhanced": "Let's analyze the effect of removing the outlier at 30 mpg. Mean: Removing a value that is significantly higher than the rest will cause the mean to decrease. Standard Deviation: This value is the maximum and increases the overall spread of the data. Removing it will make the data less spread out, causing the standard deviation to decrease. Median: Originally, there are 15 cars, so the median is the 8th car. Counting from the left, the 8th car is at 23 mpg. After removing the 30 mpg car, there are 14 cars. The new median is the average of the 7th and 8th cars. Both the 7th and 8th cars are still at 23 mpg. So, the median does not change. Therefore, only the mean and standard deviation decrease.",
    "feedback_a": "This is incorrect because the standard deviation will also decrease when an outlier that increases the spread is removed.",
    "feedback_b": "This is the correct answer. Removing the maximum value (an outlier) decreases the mean and the standard deviation, but in this specific case, the median remains at 23 mpg.",
    "feedback_c": "This is incorrect because the median does not change. Check the position of the median before and after removing the data point.",
    "feedback_d": "This is incorrect because the median remains the same.",
    "passage_content": null,
    "question_stem": "The dotplot above gives the gas mileage (in miles per gallon) of 15 different cars. If the dot representing the car with the greatest gas mileage is removed from the dotplot, what will happen to the mean, median, and standard deviation of the new data set?"
  },
  {
    "question_id": "EOC-M-C27-17",
    "source_file_name": "Math - Chapter 27 - Statistics I - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C27",
    "question_number": 17,
    "difficulty": "Hard",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Statistics",
    "Sub_Classification": "Interpretation",
    "Concept_Classification": "Data_Calculate_Mean",
    "question_type": "multiple_choice",
    "image_url": "EOC-M-C27-17_image.png",
    "option_a": "Mean",
    "option_b": "Median",
    "option_c": "Range",
    "option_d": "None of them will change.",
    "option_e": null,
    "correct_answer": "Mean",
    "explanation_original": "First, it's easy to see that the mean will decrease since we're replacing the maximum data point with a minimum. Now before the replacement, the range is $90 - 45 = 45$. After the replacement, the range is $65 - 20 = 45$, so the range remains the same. Before the replacement, the median is represented by the average of the 9th and 10th cars (57). After the replacement, the median is represented by 10th car (still 57, don't forget to count the replacement as the first value). The median also remains the same. Therefore, the mean changes the most.",
    "explanation_ai_enhanced": "Let's analyze the change for each measure. Mean: The sum will change by $20 - 90 = -70$. The mean will change by $\\frac{-70}{18} \\approx -3.89$. This is a significant change. Range: The original range is $90 (\\text{max}) - 45 (\\text{min}) = 45$. After replacing 90 with 20, the new maximum is 65 and the new minimum is 20. The new range is $65 - 20 = 45$. The range does not change. Median: Original data has 18 values, so the median is the average of the 9th and 10th values. Sorted, these are both 57. So the median is 57. After replacing 90 with 20, we re-sort. The median is still the average of the 9th and 10th values. The values from 45 to 65 are not affected in their order relative to each other, so the middle values remain 57. The median does not change. Since the mean changes while the median and range do not, the mean changes the most.",
    "feedback_a": "This is the correct answer. The mean is sensitive to extreme values (outliers), and changing 90 to 20 is a large change that will significantly lower the mean. The median and range, in this specific case, do not change at all.",
    "feedback_b": "This is incorrect. The median, which is based on the middle values of the sorted data, does not change in this case.",
    "feedback_c": "This is incorrect. The range, calculated as max-min, coincidentally remains the same ($90-45=45$ and $65-20=45$).",
    "feedback_d": "This is incorrect, as the mean clearly changes.",
    "passage_content": null,
    "question_stem": "The table above lists the amounts of snowfall, to the nearest inch, experienced by 18 different cities in the past year. The outlier measurement of 90 inches is an error. Of the mean, median, and range of the values listed, which will change the most if the 90-inch measurement is replaced by the correct measurement of 20 inches?"
  }
]
