[
  {
    "question_id": "EOC-R-C5-1",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 5 - Literal Comprehension - 92-102.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C5",
    "question_number": 1,
    "question_type": "multiple_choice",
    "passage_content": "\"My Day,\" the nationally syndicated newspaper column written by Eleanor Roosevelt, long outlasted her time as first lady. [cite: 62] The sheer frequency of the column, which ultimately ran six days a week in 90 newspapers across the United States for more than 20 years, extended Roosevelt's influence immeasurably: it made her a continual presence in the lives of her readers in a manner that anticipated the social-media age. [cite: 63]",
    "question_stem": "Based on the passage, what is true about \"My Day\"? [cite: 64]",
    "option_a": "It overshadowed Eleanor Roosevelt's accomplishments as first lady.",
    "option_b": "It exposed a large new audience to Eleanor Roosevelt's work.",
    "option_c": "It was among the most widely read newspaper columns in the United States.",
    "option_d": "It was published more frequently than any other column of its time.",
    "correct_answer": "It exposed a large new audience to Eleanor Roosevelt's work.",
    "explanation_original": "The key information appears before the colon (\"Interesting punctuation\") in the third-to-last line. [cite: 109] There we learn that Roosevelt's column extended [her] reach immeasurably, which is another way of saying that it \"exposed a large new audience to [her] work.\" [cite: 110] That makes (B) correct. [cite: 111] (A) is incorrect because the passage states that \"My Day\" outlasted Roosevelt's time as first lady, but not that it \"overshadowed\" her achievement in that role. [cite: 111] (C) does not fit because the passage emphasizes the wide reach of \"My Day\" (six days a week in 90 newspapers) but does not explicitly indicate that it was \"among the most widely-read columns.\" [cite: 112] (D) does not work either because the passage refers only to the sheer frequency of \"My Day's\" publication but does not make comparisons to any other column. [cite: 113]",
    "explanation_ai_enhanced": "The passage states that the column \"extended Roosevelt's influence immeasurably.\" [cite: 63] This is a direct paraphrase of the idea that it \"exposed a large new audience to Eleanor Roosevelt's work.\" The other options make claims that are not directly supported by the text; while the column was frequent and ran in many newspapers, the passage doesn't compare it to others to establish it as the 'most' widely read or 'most' frequent.",
    "feedback_a": "The passage states the column 'outlasted' her time as first lady, not that it 'overshadowed' her accomplishments. [cite: 62, 111]",
    "feedback_b": "This is the correct answer. The text's statement that the column 'extended Roosevelt's influence immeasurably' directly supports this conclusion. [cite: 63, 110]",
    "feedback_c": "While the column ran in 90 newspapers, the passage does not provide enough information to conclude it was 'among the most widely read' in the country. [cite: 63, 112]",
    "feedback_d": "The text mentions the column's 'sheer frequency' but does not compare it to other columns of its time. [cite: 63, 113]"
  },
  {
    "question_id": "EOC-R-C5-2",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 5 - Literal Comprehension - 92-102.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C5",
    "question_number": 2,
    "question_type": "multiple_choice",
    "passage_content": "Although the Cherokee had a different relationship with the environment than American settlers did, they still altered the landscape around them in distinct ways. [cite: 68] Throughout the Tennessee River, for example, Cherokee tribe members constructed stone weirs, rock obstructions designed to catch fish. [cite: 69] The weirs did not halt the flow of the river and create large, stagnant pools of water the way dams constructed by settlers did, however. [cite: 70] Rather, they depended on the water's continuous motion to sweep fish into traps a cooperation of sorts between the built and the natural worlds. [cite: 71]",
    "question_stem": "According to the text, how did weirs function differently from dams? [cite: 72]",
    "option_a": "They had no effect on their surrounding environments.",
    "option_b": "They prevented rivers from flowing.",
    "option_c": "They relied on the water's existing movement.",
    "option_d": "Their effects on their surrounding environments were unpredictable.",
    "correct_answer": "They relied on the water's existing movement.",
    "explanation_original": "In this case, the answer in located in a key location, namely the last sentence. [cite: 114] There we learn that that weirs relied on the water's continuous motion, or how the water naturally moves (\"its existing movements\"). [cite: 115] (C) is thus correct. [cite: 116] (A) and (B) are contradicted by the passage, which states that weirs altered the landscape around them in distinct ways and that they did not halt the flow of the river. [cite: 116] Be careful with (D): the passage states only that weirs' effects were distinct, not that they were unpredictable. [cite: 117]",
    "explanation_ai_enhanced": "The passage explicitly contrasts weirs with dams by stating that weirs \"depended on the water's continuous motion to sweep fish into traps.\" [cite: 71] This directly matches the idea that they \"relied on the water's existing movement.\" In contrast, the passage notes that dams constructed by settlers \"halt the flow of the river.\" [cite: 70]",
    "feedback_a": "This is incorrect. The passage states that the Cherokee 'altered the landscape around them in distinct ways.' [cite: 68, 116]",
    "feedback_b": "This is incorrect. The text explicitly says weirs 'did not halt the flow of the river' the way dams did. [cite: 70, 116]",
    "feedback_c": "This is the correct answer. The passage states that weirs 'depended on the water's continuous motion.' [cite: 71, 115]",
    "feedback_d": "The passage says the effects were 'distinct,' not 'unpredictable.' [cite: 68, 117]"
  },
  {
    "question_id": "EOC-R-C5-3",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 5 - Literal Comprehension - 92-102.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C5",
    "question_number": 3,
    "question_type": "multiple_choice",
    "passage_content": "To interrupt people's stereotypes of one another, researchers at Stanford Business School developed an intervention called the daily diary technique, in which randomly assigned people in two countries were given each other's diary to read for a week. [cite: 75] They found that over time, this strategy reduced cultural distance compared to when they read diaries written by their compatriots. [cite: 76] Participants in the first country began to perceive participants from the second as more ethical, whereas participants from the second country began to view participants from the first as warmer and less rigid. [cite: 77]",
    "question_stem": "According to the text, what effect did the intervention developed by Stanford researchers have on participants? [cite: 78]",
    "option_a": "It promoted perceptions of similarity between cultures.",
    "option_b": "It decreased feelings of antipathy among citizens of the same country.",
    "option_c": "It caused them to behave in a more ethical manner.",
    "option_d": "It improved their satisfaction with aspects of their own culture.",
    "correct_answer": "It promoted perceptions of similarity between cultures.",
    "explanation_original": "The key phrase is in the second sentence, which states that over time, this strategy (i.e., reading the diary of a person in another country) reduced cultural distance. [cite: 118] In other words, it \"promoted perceptions of similarity,\" which is what (A) says. [cite: 119] (B) incorrectly concerns citizens of the same country, whereas the findings involved citizens of different countries. [cite: 120] (C) is incorrect because reading the diaries only caused participants to perceive people in the other country as more ethical - the passage does not state whether it affected their own behavior. [cite: 122] Likewise, (D) is incorrect because the passage makes no mention of how participants' perceptions of their own cultures changed. [cite: 123]",
    "explanation_ai_enhanced": "The passage states that the diary-reading strategy \"reduced cultural distance.\" [cite: 76] This phrase means that the participants began to see fewer differences between themselves and people from the other culture, which is another way of saying it \"promoted perceptions of similarity.\"",
    "feedback_a": "This is the correct answer. 'Reduced cultural distance' is a direct paraphrase for promoting perceptions of similarity. [cite: 76, 119]",
    "feedback_b": "This is incorrect. The study involved people from two different countries, not citizens of the same country. [cite: 75, 120]",
    "feedback_c": "This is incorrect. The study found that some participants began to *perceive* others as more ethical, not that they themselves began to *behave* more ethically. [cite: 77, 122]",
    "feedback_d": "This is incorrect. The passage does not mention how participants felt about their own cultures. [cite: 123]"
  },
  {
    "question_id": "EOC-R-C5-4",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 5 - Literal Comprehension - 92-102.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C5",
    "question_number": 4,
    "question_type": "multiple_choice",
    "passage_content": "The following text is from Georgia Douglas Johnson's 1922 poem \"Youth.\"\n\nThe dew is on the grasses, dear,\nThe blush is on the rose,\nAnd swift across our dial-youth,\nA shifting shadow goes.\n\nThe primrose moments, lush with bliss,\nExhale and fade away,\nLife may renew the Autumn time,\nBut nevermore the May! [cite: 81]",
    "question_stem": "According to the text, in what way is youth unlike the autumn of life? [cite: 81]",
    "option_a": "It is untouched by shadows.",
    "option_b": "It cannot be extended.",
    "option_c": "It remains perpetually fresh.",
    "option_d": "It is full of bliss.",
    "correct_answer": "It cannot be extended.",
    "explanation_original": "The answer is found in a key place, namely the end of the passage. [cite: 124] In context of the poem's title and subject, \"Youth,\" the statement that Life may renew the Autumn time,/But nevermore the May means that old age (Autumn) can stretch out for a long time, whereas youth (May) must end-i.e., \"it cannot be extended.\" [cite: 125] (A) is incorrect because the poem states that swift across our dial-youth,/A shifting shadow goes. [cite: 126] (C) is incorrect because it states exactly the opposite of the correct answer: by definition, something that \"cannot be extended\" does not \"remain perpetually (forever) fresh.\" [cite: 127] Be careful with (D): the poem only states that youth is lush with bliss, but the question asks how youth is \"unlike\" old age, and the passage does not make that particular comparison. [cite: 128]",
    "explanation_ai_enhanced": "The final two lines of the poem create a direct contrast: \"Life may renew the Autumn time, / But nevermore the May!\" [cite: 81] In this metaphor, \"Autumn\" represents later life, while \"May\" represents youth. The poem claims that while autumn can be renewed, the May of life (youth) can never be brought back, meaning it cannot be extended.",
    "feedback_a": "This is incorrect. The poem states that across youth, 'A shifting shadow goes.' [cite: 81, 126]",
    "feedback_b": "This is the correct answer. The line 'But nevermore the May!' indicates that youth, unlike autumn, cannot be renewed or extended. [cite: 81, 125]",
    "feedback_c": "This is incorrect. The poem says youth's moments 'Exhale and fade away,' which contradicts the idea of being perpetually fresh. [cite: 81, 127]",
    "feedback_d": "While the poem says youth has moments 'lush with bliss,' it doesn't use this to contrast youth with autumn. [cite: 81, 128]"
  },
  {
    "question_id": "EOC-R-C5-5",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 5 - Literal Comprehension - 92-102.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C5",
    "question_number": 5,
    "question_type": "multiple_choice",
    "passage_content": "Geophysicists first began to appreciate the smoldering origins of the land under the sea, known formally as ocean crust, in the early 1960s. [cite: 83] Sonar surveys revealed that volcanoes form nearly continuous ridges that wind around the globe like seams on a baseball. [cite: 84] Later, the same scientists strove to explain what fuels these erupting mountain ranges, called mid-ocean ridges. [cite: 85] Basic theories suggest that because shifting tectonic plates pull the ocean floor apart along the ridges, molten rock deep within the earth's interior must rise to fill the gap. [cite: 86] This material is produced in the second layer of the Earth's interior - the mostly solid upper mantle and makes its way up through the crust. [cite: 87] The collision of two plates can also result in a volcano. [cite: 88]",
    "question_stem": "Based on the passage, why do undersea volcanoes develop? [cite: 89]",
    "option_a": "Because breaks in the ocean floor allow liquid rock from the mantle to enter.",
    "option_b": "Because mid-ocean ridges pull apart when the pressure beneath them increases.",
    "option_c": "Because tectonic plates accumulate along the ocean floor.",
    "option_d": "Because the Earth's crust collides with the mantle.",
    "correct_answer": "Because breaks in the ocean floor allow liquid rock from the mantle to enter.",
    "explanation_original": "The key information appears in the fourth and fifth sentences, which indicate that \"erupting mountain ranges\" (i.e., volcanoes) are believed to form when the ocean floor is pulled apart and molten (liquid) rock from the upper mantle rises into the resulting space. [cite: 129] That corresponds directly to (A). [cite: 130] (B) is incorrect because the ridges are pulled apart by shifting tectonic plates, not by pressure. [cite: 130] (C) is entirely unsupported by the passage. [cite: 131] (D) is incorrect because the passage states that volcanoes can result from \"the collision of two plates,\" not from the collision between a plate and the mantle. [cite: 131]",
    "explanation_ai_enhanced": "The passage explains that volcanoes (erupting mountain ranges) form because \"shifting tectonic plates pull the ocean floor apart along the ridges, [and] molten rock deep within the earth's interior must rise to fill the gap.\" [cite: 86] This molten rock comes from the upper mantle. [cite: 87] This description directly matches the idea that breaks in the floor allow liquid rock from the mantle to enter.",
    "feedback_a": "This is the correct answer. The text states plates pull the ocean floor apart, allowing molten rock from the mantle to rise and fill the gap. [cite: 86, 87, 129]",
    "feedback_b": "This is incorrect. The text attributes the pulling apart to 'shifting tectonic plates,' not to pressure. [cite: 86, 130]",
    "feedback_c": "This is incorrect. The passage states that plates pull apart, not that they accumulate. [cite: 86]",
    "feedback_d": "This is incorrect. The passage mentions the collision of two *plates* can cause a volcano, not the crust colliding with the mantle. [cite: 88, 131]"
  },
  {
    "question_id": "EOC-R-C5-6",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 5 - Literal Comprehension - 92-102.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C5",
    "question_number": 6,
    "question_type": "multiple_choice",
    "passage_content": "The following text is adapted from Edith Wharton's novel The Custom of the Country. Mrs. Spragg has recently arrived in New York City with her daughter. [cite: 93]\n\nThe room showed no traces of human use, and Mrs. Spragg herself wore as complete an air of detachment as if she had been a wax figure in a show-window. [cite: 94] Her attire was fashionable enough to justify such a post, and her pale soft-cheeked face, with puffy eye-lids and drooping mouth, suggested a partially-melted wax figure which had run to double-chin. [cite: 95]",
    "question_stem": "According to the text, what is true about Mrs. Spragg? [cite: 96]",
    "option_a": "She feels anxious in her environment.",
    "option_b": "Her clothing is not suited to her position.",
    "option_c": "Her features are sharp and distinctive.",
    "option_d": "She appears aloof and disconnected from her surroundings.",
    "correct_answer": "She appears aloof and disconnected from her surroundings.",
    "explanation_original": "All the information you need to answer this question can be found in the first sentence: the phrases no traces of human use and as complete an air of detachment as if she had been a wax figure in a show-window correspond directly to \"aloof and disconnected\" in (D). [cite: 133] (A) does not work because the passage only states that Mrs. Spragg is completely detached from her environment, not that she is \"anxious.\" [cite: 134] (B) is incorrect both because the passage indicates that Mrs. Spragg is dressed fashionably and because it says nothing about her actual position. [cite: 135] (C) is directly contradicted by the passage, which indicates that Mrs. Spragg's features recall a partially melted wax figure. [cite: 136]",
    "explanation_ai_enhanced": "The passage describes Mrs. Spragg as having a \"complete an air of detachment.\" [cite: 94] This phrase directly corresponds to the idea that she appears \"aloof and disconnected from her surroundings.\" The comparison to a \"wax figure in a show-window\" further reinforces this sense of unreality and disconnection. [cite: 94]",
    "feedback_a": "The passage describes her as 'detached,' not 'anxious.' [cite: 94, 134]",
    "feedback_b": "This is incorrect. The passage states her attire was 'fashionable enough.' [cite: 95, 135]",
    "feedback_c": "This is incorrect. Her features are compared to a 'partially-melted wax figure,' which suggests softness, not sharpness. [cite: 95, 136]",
    "feedback_d": "This is the correct answer. The text's description of her 'complete an air of detachment' directly supports this. [cite: 94, 133]"
  },
  {
    "question_id": "EOC-R-C5-7",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 5 - Literal Comprehension - 92-102.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C5",
    "question_number": 7,
    "question_type": "multiple_choice",
    "passage_content": "The Importance of Being Earnest is an 1895 play by Oscar Wilde. [cite: 99]\nALGERNON: Did you hear what I was playing, Lane?\nLANE: I didn't think it polite to listen, sir. [cite: 100]\nALGERNON: I'm sorry for that, for your sake. I don't play accurately-any one can play accurately-but I play with wonderful expression. [cite: 101] As far as the piano is concerned, sentiment is my forte. I keep science for Life. [cite: 102]",
    "question_stem": "Based on the text, what is true about Algernon? [cite: 103]",
    "option_a": "He is embarrassed that Lane has overheard him playing the piano.",
    "option_b": "As a musician, he is more concerned with emotion than technical correctness.",
    "option_c": "Science appeals to him for the same reasons that music does.",
    "option_d": "He wishes that he could play the piano more accurately.",
    "correct_answer": "As a musician, he is more concerned with emotion than technical correctness.",
    "explanation_original": "In his short speech, Algernonon reveals that he is uninterested in playing the piano accurately (\"technical correctness\") and is much more concerned with sentiment (\"emotion\"), information that eliminates (D) and points directly to (B). [cite: 137] (A) is incorrect because rather than being embarrassed by his presumably terrible piano-playing, Algernon seems quite proud of it. [cite: 138] (C) is contradicted in the last two sentences, in which Algernon indicates his desire to keep music and science separate. [cite: 139]",
    "explanation_ai_enhanced": "Algernon explicitly states his priorities in playing the piano: \"I don't play accurately...but I play with wonderful expression. As far as the piano is concerned, sentiment is my forte.\" [cite: 101, 102] This shows a clear preference for emotion ('sentiment,' 'expression') over technical precision ('accurately').",
    "feedback_a": "This is incorrect. He seems proud of his playing, saying 'I'm sorry for that, for your sake,' implying Lane missed out. [cite: 101, 138]",
    "feedback_b": "This is the correct answer. Algernon states that 'sentiment is my forte' and that he plays with 'wonderful expression' rather than accuracy. [cite: 101, 102, 137]",
    "feedback_c": "This is incorrect. He explicitly separates the two, stating, 'I keep science for Life,' implying it is different from his approach to piano. [cite: 102, 139]",
    "feedback_d": "This is incorrect. He dismisses accuracy, saying 'any one can play accurately.' [cite: 101, 137]"
  }
]
