[
  {
    "question_id": "EOC-R-C6-1",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 6 - Reading for Function - 103-121.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C6",
    "question_number": 1,
    "question_type": "multiple_choice",
    "passage_content": "Far below the mid-ocean ridge volcanoes and their countless layers of crust-forming lava is the mantle, a 3,200-kilometer-thick layer of scorching hot rock that forms the earth's midsection and surrounds its metallic core. <u>At the planet's cool surface, upthrusted mantle rocks are dark green, but if you could see them in their rightful home, they would be glowing red- or even white-hot.</u> The top of the mantle is about 1,300 degrees Celsius, and it gets about one degree hotter with each kilometer of depth. The weight of overlying rock means the pressure also increases with depth about 1,000 atmospheres for every three kilometers.",
    "question_stem": "Which choice best states the function of the underlined sentence within the text as a whole?",
    "option_a": "To convey the intense pressure that pervades the mantle",
    "option_b": "To suggest that scientific understanding of mantle rocks is limited",
    "option_c": "To describe a difference between mantle rocks and other types of rock",
    "option_d": "To emphasize a difference between mantle rocks in different locations",
    "correct_answer": "To emphasize a difference between mantle rocks in different locations",
    "explanation_original": "This is a good example of a function question whose answer depends only on the underlined sentence itself rather than on the information before or after it. The key word but occurs halfway through the sentence and indicates that its purpose is to describe a contrast: the first half of the sentence describes mantle rocks at the surface (green), whereas the second half describes them deep beneath the earth (very hot). In other words, it \"emphasizes a difference between mantle rocks in two locations,\" making the answer (D). (A) is incorrect because the underlined sentence focuses on heat, not pressure. (B) is entirely off-topic, and (C) does not fit because the underlined sentence describes mantle rocks only.",
    "explanation_ai_enhanced": "The underlined sentence uses the transition word 'but' to establish a clear contrast. It describes the appearance of mantle rocks at the 'cool surface' (dark green) versus their appearance in their 'rightful home' deep within the Earth (glowing red- or white-hot). This directly serves the function of emphasizing a difference in the rocks based on their location.",
    "feedback_a": "This is incorrect. The underlined sentence discusses temperature and appearance, not pressure, which is mentioned later in the passage.",
    "feedback_b": "The sentence describes known characteristics of the rocks, rather than suggesting that understanding is limited.",
    "feedback_c": "The sentence only compares mantle rocks to themselves in different environments, not to other types of rock.",
    "feedback_d": "This is the correct answer. The sentence explicitly contrasts the rocks' appearance on the surface with their appearance deep inside the Earth."
  },
  {
    "question_id": "EOC-R-C6-2",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 6 - Reading for Function - 103-121.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C6",
    "question_number": 2,
    "question_type": "multiple_choice",
    "passage_content": "The Awakening is an 1890 novel by Kate Chopin. Edna Pontellier, the protagonist, is on vacation with her husband and children at Grand Isle resort in Louisiana.\n\nEdna Pontellier could not have told why, wishing to go to the beach with Robert, she should in the first place have declined, and in the second place have followed in obedience to one of the two contradictory impulses which impelled her. A certain light was beginning to dawn dimly within her. In short, Mrs. Pontellier was beginning to realize her position in the universe as a human being, and to recognize her relations as an individual to the world within and about her.",
    "question_stem": "Which choice best states the primary purpose of the text?",
    "option_a": "To highlight Edna's tendency to behave in contradictory ways",
    "option_b": "To present a situation in which Edna must make a momentous decision",
    "option_c": "To describe Edna's newfound insight into her interior and exterior existence",
    "option_d": "To convey Edna's sense of duty toward her family",
    "correct_answer": "To describe Edna's newfound insight into her interior and exterior existence",
    "explanation_original": "The transitional phrase In short at the beginning of the last sentence signals that the author is about to summarize an essential idea, and indeed, the key information is located right afterwards. It involves Edna's sudden realization (\"newfound insight\") about herself and her position relative to the world around her (\"her interior and exterior existence\"). That corresponds to (C). (A) is incorrect because it takes a word from the passage (contradictory) and twists it beyond the scope of the passage: the narrator states only that Edna experiences contradictory impulses when Robert asks her to accompany him to the beach-we cannot infer that she has a general \"tendency to behave in contradictory ways.\" (B) is incorrect because it is Edna's realization that is \"momentous,\" not her decision. (D) is contradicted by the passage: the primary focus is on Edna's discovery about herself, not on her sense of obligation towards her family.",
    "explanation_ai_enhanced": "The passage builds from Edna's confusion over her 'contradictory impulses' to a clarifying summary statement. The phrase 'In short' signals this summary, which states that Mrs. Pontellier was 'beginning to realize her position in the universe as a human being.' This realization is a 'newfound insight' into her existence, making C the most accurate description of the text's purpose.",
    "feedback_a": "While the passage mentions 'contradictory impulses,' this is a specific detail leading to the main point, not the overall purpose of the text.",
    "feedback_b": "The passage focuses on an internal realization, which is described as 'momentous,' rather than on an external decision.",
    "feedback_c": "This is the correct answer. The text culminates in the summary that Edna was beginning to have a significant realization about herself and her place in the world.",
    "feedback_d": "The passage focuses on Edna's internal discovery about herself as an individual, not her sense of duty to her family."
  },
  {
    "question_id": "EOC-R-C6-3",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 6 - Reading for Function - 103-121.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C6",
    "question_number": 3,
    "question_type": "multiple_choice",
    "passage_content": "In order to better understand people's receptiveness to opposing viewpoints, public policy scholars Julia Minson of Harvard University and Frances Chen of the University of British Columbia reviewed dozens of studies spanning 1984 to 2021. Among their findings was the fact that people who feel strongly about an issue can be receptive to others' views without altering their own opinions. <u>As the researchers point out, two thoughtful people might examine each other's ideas seriously and, recognizing that it is possible for reasonable people to hold either perspective, respectfully agree to disagree.</u>",
    "question_stem": "Which choice best states the function of the underlined sentence within the text as a whole?",
    "option_a": "It highlights a potential outcome of a strong disagreement.",
    "option_b": "It describes a process by which people's opinions can evolve.",
    "option_c": "It emphasizes the importance of considering multiple perspectives.",
    "option_d": "It discusses a strategy that permits opposing parties to reconcile their differences.",
    "correct_answer": "It highlights a potential outcome of a strong disagreement.",
    "explanation_original": "The underlined sentence begins with the phrase As the researchers point out, indicating that the information that follows will focus on an implication or conclusion of the research described in the previous sentences. The previous sentence discusses the finding that two people who feel strongly about an issue can be receptive to others' views without altering their own opinions, and the underlined sentence expands on that idea. (A) is correct because disagreeing respectfully is something that people with strongly opposing opinions might choose to do at the end of an argument-that is \"a potential outcome.\" (B) and (D) are both contradicted by the passage. The focus here is on people whose views do not evolve, or who do not reconcile (bring together) their differences. Although the passage does discuss how individuals with different perspectives might interact, (C) is incorrect because the sentence in question does not mention \"the importance of multiple perspectives.\"",
    "explanation_ai_enhanced": "The preceding sentence establishes that people can be receptive to other views without changing their own. The underlined sentence then provides a specific example of this: two people examining each other's ideas and then choosing to 'respectfully agree to disagree.' This represents a possible result, or 'potential outcome,' of a disagreement that doesn't end in one person changing their mind.",
    "feedback_a": "This is the correct answer. The sentence describes 'agreeing to disagree' as a possible result of a strong disagreement.",
    "feedback_b": "This is incorrect. The sentence explicitly describes a situation where people's opinions do *not* evolve.",
    "feedback_c": "While considering other perspectives is part of the process described, the sentence's primary function is to describe the outcome, not just the importance of the action.",
    "feedback_d": "This is incorrect. 'Reconcile their differences' implies finding a middle ground, whereas the sentence describes an outcome where both parties maintain their original, opposing views."
  },
  {
    "question_id": "EOC-R-C6-4",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 6 - Reading for Function - 103-121.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C6",
    "question_number": 4,
    "question_type": "multiple_choice",
    "passage_content": "To be a female artist in the nineteenth century was challenging enough, but to be a female sculptor was nearly unthinkable. <u>Not only were sculptors expected to have a familiarity with the human form that no woman in that age could acquire, but they had to work with heavy materials, such as blocks of marble weighing many hundreds of pounds.</u> Nevertheless, a few intrepid American women wound their way to Italy and learned to sculpt.",
    "question_stem": "Which choice best describes the function of the underlined sentence in the text as a whole?",
    "option_a": "It discusses some of the expenses involved in becoming an artist.",
    "option_b": "It emphasizes the antagonism between women and the nineteenth-century artistic establishment.",
    "option_c": "It explains the virtual impossibility of becoming a female sculptor in the nineteenth century.",
    "option_d": "It describes some of the physical limitations placed on nineteenth-century women.",
    "correct_answer": "It explains the virtual impossibility of becoming a female sculptor in the nineteenth century.",
    "explanation_original": "The underlined sentence appears close to the start of the passage (second sentence), so start by backing up and reading from the beginning. The first sentence states that to be a female sculptor in the nineteenth century was nearly unthinkable, and the examples given in the underlined sentence (familiarity with human form, weight of materials) logically serve to support that claim. (A) and (B) are completely off-topic and can be eliminated. (D) refers to nineteenth-century women, not female artists, and is outside the scope of the passage. (C) correctly relates the idea from the first sentence that the second sentence is used to support (nearly unthinkable = virtual impossibility).",
    "explanation_ai_enhanced": "The first sentence makes the broad claim that being a female sculptor was 'nearly unthinkable.' The underlined sentence immediately follows and provides two specific reasons why this was the case: the societal restrictions on anatomical knowledge and the physical demands of the materials. Therefore, the function of the underlined sentence is to explain and support the initial claim of 'virtual impossibility.'",
    "feedback_a": "This is incorrect; the sentence discusses professional and physical barriers, not financial expenses.",
    "feedback_b": "While the barriers imply antagonism, the sentence's direct function is to explain *why* it was so difficult, not just to state that there was opposition.",
    "feedback_c": "This is the correct answer. The sentence provides concrete examples that explain why being a female sculptor was 'nearly unthinkable' or a 'virtual impossibility'.",
    "feedback_d": "This is too general. The sentence is specifically about the limitations faced by female *sculptors*, not all nineteenth-century women."
  },
  {
    "question_id": "EOC-R-C6-5",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 6 - Reading for Function - 103-121.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C6",
    "question_number": 5,
    "question_type": "multiple_choice",
    "passage_content": "The following text is from Charlotte Grimké's poem \"Wordsworth.\"\n\nPoet of the serene and thoughtful lay!\n<u>In youth's fair dawn, when the soul, still untried,\nLongs for life's conflict, and seeks restlessly\nFood for its cravings in the stirring songs,\nThe thrilling strains of more impassioned bards;</u>\nOr, eager for fresh joys, culls with delight\nThe flowers that bloom in fancy's fairy realm\nWe may not prize the mild and steadfast ray\nThat streams from thy pure soul in tranquil song",
    "question_stem": "Which choice best describes the function of the underlined portion in the text as a whole?",
    "option_a": "To criticize the human tendency toward conflict",
    "option_b": "To describe the power of music to express emotions",
    "option_c": "To highlight the consequences of uncontrolled restlessness",
    "option_d": "To convey the soul's youthful desire for excitement",
    "correct_answer": "To convey the soul's youthful desire for excitement",
    "explanation_original": "As a result, it is necessary to focus on the wording of the underlined portion, which describes the soul's search for life's conflict, food for its craving, the thrilling strains of impassioned bards-in other words, \"excitement,\" which corresponds to (D). (A) is incorrect because the poem is strongly positive, whereas \"criticize\" is negative. (C) is fairly negative as well, and the underlined section does mention any \"consequences.\" (B) is off-topic: while the word songs appears in the sentence, music is not the focus.",
    "explanation_ai_enhanced": "The underlined lines describe the soul in 'youth's fair dawn.' This youthful soul 'longs for life's conflict,' seeks 'food for its cravings,' and desires 'stirring songs' and 'thrilling strains.' All of these phrases collectively describe a deep desire for intense experiences, which is best summarized as a desire for excitement.",
    "feedback_a": "The tone is descriptive, not critical. The poem portrays this longing as a natural part of youth.",
    "feedback_b": "While 'songs' and 'strains' are mentioned, they are examples of what the youthful soul craves, not the main focus of the description.",
    "feedback_c": "The lines describe the desire for restlessness but do not mention any consequences of it.",
    "feedback_d": "This is the correct answer. The phrases 'life's conflict,' 'cravings,' and 'thrilling strains' all point to a desire for excitement."
  },
  {
    "question_id": "EOC-R-C6-6",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 6 - Reading for Function - 103-121.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C6",
    "question_number": 6,
    "question_type": "multiple_choice",
    "passage_content": "One of the most persistent and problematic biases in science involves motivated reasoning-that is, the tendency to interpret observations to fit preconceived notions. According to Professor Brian Nosek, a specialist in human biases and co-founder of the Center for Open Science at the University of Virginia, psychologists have demonstrated that \"most of our reasoning is in fact rationalization.\" In other words, people begin by making decisions about what to think or do, and their \"explanation\" later serves as a means to justify what they believed or how they intended to act in the first place.",
    "question_stem": "Which choice best states the primary purpose of the text?",
    "option_a": "To describe a phenomenon detrimental to the reliability of scientific findings",
    "option_b": "To suggest that true objectivity in science cannot be attained",
    "option_c": "To emphasize the inaccuracy of many scientific conclusions",
    "option_d": "To call attention to the dangers of motivated reasoning",
    "correct_answer": "To describe a phenomenon detrimental to the reliability of scientific findings",
    "explanation_original": "Although the question asks about the passage a whole, you can get a sense of the answer by using only the first sentence. The phrase One of the most persistent and problematic biases in science indicates that the passage will present and discuss this problem. The language is moderate and neutral, suggesting that the correct answer will be so as well. (A) is consistent with the stated purpose and does not go outside the bounds of the passage, so it is correct. (B) is too extreme-the passage only states that motivated reasoning is a problem, not that \"true objectivity cannot be attained.\" Be careful with (C): the passage only indicates that scientists have a tendency to interpret observations to fit preconceived notions-it does not go so far as to emphasize that \"many scientific conclusions\" are actually wrong, only that they have been arrived at in a way that is not fully objective. (D) is too extreme and too negative, and the passage never explicitly discusses any dangers.",
    "explanation_ai_enhanced": "The passage introduces 'motivated reasoning' as a 'persistent and problematic bias in science.' It then explains how this phenomenon works. A 'problematic bias' is something that is 'detrimental to the reliability of scientific findings.' The purpose of the text is to define and explain this phenomenon.",
    "feedback_a": "This is the correct answer. The text defines 'motivated reasoning' as a 'problematic bias' and explains how it works, which aligns with describing a phenomenon that harms scientific reliability.",
    "feedback_b": "This is an overstatement. The passage describes a bias as a problem but does not make the absolute claim that objectivity is impossible.",
    "feedback_c": "This is too strong. The passage discusses a flawed process of reasoning, not necessarily that the conclusions themselves are inaccurate.",
    "feedback_d": "While motivated reasoning could be dangerous, the text focuses on describing it as a 'problematic bias' in a scientific context, not on its broader 'dangers'."
  },
  {
    "question_id": "EOC-R-C6-7",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 6 - Reading for Function - 103-121.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C6",
    "question_number": 7,
    "question_type": "multiple_choice",
    "passage_content": "In recent years, many companies have shifted from a model in which workers are placed in individual cubicles to one based on open-office plans, with the goal of fostering employee interaction and collaboration. Studies suggest, however, that such strategies may backfire, increasing job dissatisfaction and leaving workers no more likely to work together than before. <u>Researchers at Harvard Business School theorize that employees' tendency to avoid one another in open offices may be attributable to the \"fourth wall\"-the imaginary curtain that prevents actors from being distracted by the audience and preserves the imaginary world of a play.</u> To preserve a sense of psychological autonomy, employees in open offices establish their own fourth walls, which their colleagues quickly come to respect.",
    "question_stem": "Which choice best describes the function of the underlined portion in the text as a whole?",
    "option_a": "To describe a drawback of open offices",
    "option_b": "To present an explanation for an unintended phenomenon",
    "option_c": "To emphasize the importance of collaboration in the workplace",
    "option_d": "To compare office work to theatrical work",
    "correct_answer": "To present an explanation for an unintended phenomenon",
    "explanation_original": "The fastest way to answer this question is to focus on the word theorize in the underlined portion-it indicates that the sentence in question serves to present an argument or explanation. The only answer consistent with this purpose is (B), which contains the word \"explain.\" Otherwise, (A) is incorrect because the underlined portion does not \"describe a drawback of open offices\" but rather offers a theory about why a drawback (increased job dissatisfaction) exists. The beginning of the passage indicates that open offices are intended to promote collaboration but then moves to a discussion of why it does not take place, making (C) incorrect. Although the underlined portion does draw a comparison between open-office workers' behavior and the \"fourth wall,\" which is an element of the theater, the main purpose of the underlined sentence is not to compare office and theatrical work but rather to explain why open offices backfire.",
    "explanation_ai_enhanced": "The sentence immediately before the underlined portion describes an 'unintended phenomenon': open offices backfiring and causing employees to be *less* collaborative. The underlined sentence then begins with 'Researchers...theorize that...,' which directly introduces a potential reason or 'explanation' for this unexpected outcome by using the 'fourth wall' analogy.",
    "feedback_a": "This is incorrect. The previous sentence describes the drawback; the underlined sentence attempts to explain it.",
    "feedback_b": "This is the correct answer. The word 'theorize' signals that an explanation for the previously mentioned phenomenon is being offered.",
    "feedback_c": "The passage discusses a *failure* of collaboration, so emphasizing its importance is not the function of this specific sentence.",
    "feedback_d": "The comparison to theatrical work is the mechanism of the explanation, but the overall function is to provide the explanation itself, not just to make the comparison."
  }
]
