[
  {
    "question_id": "EOC-R-C7-1",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 7 - Text Completions - 122-133.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C7",
    "question_number": 1,
    "question_type": "multiple_choice",
    "passage_content": "Physicists have yet to figure out what exactly happens at the singularity of a black hole: matter is crushed, but what becomes of it then? The event horizon, by hiding the singularity, isolates this gap in our knowledge. All kinds of processes unknown to science may occur at the singularity, yet they have no effect on the outside world. Astronomers plotting the orbits of planets and stars can safely ignore the uncertainties introduced by singularities and",
    "question_stem": "Which choice most logically completes the text?",
    "option_a": "apply the standard laws of physics with confidence.",
    "option_b": "focus on gaining a deeper understanding of black holes.",
    "option_c": "attempt to peer behind the event horizon.",
    "option_d": "uncover phenomena not currently known to science.",
    "correct_answer": "apply the standard laws of physics with confidence.",
    "explanation_original": "The second-to-last sentence includes the transition yet, which indicates key information: although singularities may involve all sorts of mysterious processes, they have no real-world effect. Thus, scientists can ignore them. The correct answer must restate or be consistent with this idea. (A) is correct because if singularities don't have an effect, then scientists can treat everything as normal and apply the usual laws of physics. (B) is unrelated to the required idea, and (C) and (D) both contradict the idea of ignoring puzzling aspects of black holes and maintaining the existing scientific framework.",
    "explanation_ai_enhanced": "The passage states that the mysterious processes at a singularity 'have no effect on the outside world.' It follows logically that if these processes have no observable impact, astronomers can 'safely ignore' them. Ignoring these uncertainties means they can proceed with their work as usual, which involves applying the standard laws of physics with confidence.",
    "feedback_a": "This is the correct answer. Since the effects of singularities are isolated, astronomers can ignore them and confidently use standard physical laws.",
    "feedback_b": "This contradicts the passage's point that astronomers can 'safely ignore' the uncertainties related to singularities.",
    "feedback_c": "This contradicts the passage's point that astronomers can 'safely ignore' the uncertainties related to singularities.",
    "feedback_d": "This contradicts the passage's point that astronomers can 'safely ignore' the uncertainties related to singularities."
  },
  {
    "question_id": "EOC-R-C7-2",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 7 - Text Completions - 122-133.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C7",
    "question_number": 2,
    "question_type": "multiple_choice",
    "passage_content": "Most grocery stores spray produce with water on a regular basis in order to ensure that they maintain a wholesome, fresh-picked appearance. However, according to Martin Lindstrom, author of Brandwashed: Tricks Companies Use to Manipulate Our Minds and Persuade Us to Buy, not only does this liquid lack any practical purpose, but it actually has a deleterious effect:",
    "question_stem": "Which choice most logically completes the text?",
    "option_a": "shoppers are unlikely to purchase fruits and vegetables that appear dry and withered.",
    "option_b": "moisture causes picked vegetables to spoil more quickly than they otherwise would.",
    "option_c": "certain vegetables lose some of their nutrients when they are boiled.",
    "option_d": "produce must be watered at predictable intervals in order to appeal to consumers.",
    "correct_answer": "moisture causes picked vegetables to spoil more quickly than they otherwise would.",
    "explanation_original": "The key phrase occurs right before the blank: not only does the liquid [used to water fresh produce] lack any practical purpose, but it also has a deleterious (negative] effect. The information that follows must logically explain that effect. (A) does not explain the negative impact of watering on already-picked fruits and vegetables - the fact that shoppers are unlikely to select produce in poor condition is irrelevant to this section of the passage. (C) is incorrect because the passage focuses only on the effects of water on uncooked vegetables. (D) incorrectly states a positive effect of watering produce. (B) is correct because faster spoilage is a negative effect of spraying fresh fruits and vegetables with water.",
    "explanation_ai_enhanced": "The text sets up a contrast. While stores spray produce to make it look fresh, the author claims the practice has a 'deleterious effect,' which means a harmful or negative one. The blank must be filled with a statement that describes this negative effect. Moisture causing produce to spoil more quickly is a clear negative consequence.",
    "feedback_a": "This describes why stores spray produce, not the negative effect the author is introducing.",
    "feedback_b": "This is the correct answer, as faster spoilage is a clear 'deleterious effect' of adding moisture.",
    "feedback_c": "The passage is about spraying produce in a store, not about the effects of boiling.",
    "feedback_d": "This explains a supposed benefit of watering produce, which contradicts the author's claim of a 'deleterious effect.'"
  },
  {
    "question_id": "EOC-R-C7-3",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 7 - Text Completions - 122-133.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C7",
    "question_number": 3,
    "question_type": "multiple_choice",
    "passage_content": "Although it is widely assumed that cognitive bias clouds our assessment of the people around us, their research and that of others, a group of researchers at the Santa Fe Institute has found that people's estimations of what their friends and family believe are often largely correct. That's because as highly social creatures, we have become very good at sizing up those around us- what researchers call \"social sensing.\" It is therefore possible",
    "question_stem": "Which choice most logically completes the text?",
    "option_a": "to gather highly accurate information about trends by asking about individuals about their social circles rather than their own beliefs.",
    "option_b": "to determine people's views on a variety of topics by analyzing the ways in which they interact with others.",
    "option_c": "to discover what people truly believe about an issue by asking them to reflect on their personal biases.",
    "option_d": "to develop an algorithm that reliably predicts people's preferences about a wide range of items.",
    "correct_answer": "to gather highly accurate information about trends by asking about individuals about their social circles rather than their own beliefs.",
    "explanation_original": "This is a good example of a question in which the answer is very nearly stated in the passage. The text makes clear that people are generally pretty accurate in identifying the beliefs of their friends and family members, so logically it must be possible to gather accurate information about trends by asking individuals what the people close to them think rather than what they themselves think-which is exactly what (A) says. (B) is incorrect because the passage focuses on beliefs, not interactions. (C) says exactly the opposite of what is indicated by the passage-reliable information can be obtained by asking people about others, not themselves. (D) goes way beyond the scope of the passage, which does not discuss the role of technology in determining people's preferences at all.",
    "explanation_ai_enhanced": "The main idea of the passage is that people are surprisingly accurate at estimating the beliefs of their friends and family ('social sensing'). The logical conclusion ('It is therefore possible...') must be a direct application of this finding. If people are good at reporting on their social circles, then asking them about those circles is a viable way to gather accurate information.",
    "feedback_a": "This is the correct answer. It is a direct logical consequence of the 'social sensing' ability described in the text.",
    "feedback_b": "The passage is about people's accuracy in estimating beliefs, not analyzing interactions.",
    "feedback_c": "This contradicts the passage, which suggests asking about others is more accurate than asking people to report on their own beliefs (which may be clouded by bias).",
    "feedback_d": "The passage discusses a human ability, not the development of an algorithm or technology."
  },
  {
    "question_id": "EOC-R-C7-4",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 7 - Text Completions - 122-133.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C7",
    "question_number": 4,
    "question_type": "multiple_choice",
    "passage_content": "One of the most startling discoveries of the early 21st century was that Indo-European languages seem not to have been spread by Anatolian farmers living in what is now Turkey, as was commonly thought, but rather by a people called the Yamnaya, horse-herding nomads who lived on the Eurasian steppes more than 5,000 years ago. A host of linguistic evidence suggesting this possibility was first compiled persuasively by archaeologist David Anthony in 2007; DNA evidence later proved he was on target, showing that",
    "question_stem": "Which choice most logically completes the text?",
    "option_a": "members of tribes from the steppes arrived in Germany sometime between 2500 and 2000 BCE.",
    "option_b": "the Yamnaya were a genetic blend of three separate Eurasian populations.",
    "option_c": "around 5,000 years ago, the Yamnaya's genes began to appear throughout Europe and Asia.",
    "option_d": "the Yamnayans were linguistically unique in comparison to other groups from the same period.",
    "correct_answer": "around 5,000 years ago, the Yamnaya's genes began to appear throughout Europe and Asia.",
    "explanation_original": "The statement immediately before the blank indicates that David Anthony was on target, so the blank must refer to evidence supporting his theory. What was Anthony's theory? That Indo-European languages were spread by the Yamnaya... The correct answer must support it with information indicating that the Yamnaya moved throughout the regions, plural, where Indo-European languages became established. (A) focuses on Germany, which is only one area, so it can be eliminated. (B) is off-topic-the Yamnaya's genetic roots are irrelevant to the argument. (D) does not fit because the correct answer must involve the Yamnaya's migration and its eventual effects. Only (C) contains that information: if \"the Yamnaya's genes appeared throughout Europe and Asia,\" these people must have been present in many regions, hence the spread of their language.",
    "explanation_ai_enhanced": "The text states that DNA evidence proved David Anthony's theory 'was on target.' His theory was that the Yamnaya people spread Indo-European languages. To prove this, the DNA evidence would need to show a widespread migration of the Yamnaya people into the areas where these languages are spoken. The appearance of their genes 'throughout Europe and Asia' provides exactly this evidence of a large-scale migration.",
    "feedback_a": "This is too specific. Evidence of arrival in Germany alone would not support the broad theory of spreading languages throughout Europe and Asia.",
    "feedback_b": "This describes the genetic makeup of the Yamnaya but does not provide evidence that they migrated and spread their language.",
    "feedback_c": "This is the correct answer, as the widespread appearance of Yamnaya genes is the DNA evidence needed to support the migration theory.",
    "feedback_d": "This is about linguistics, but the blank needs to be filled with the 'DNA evidence' that supported the linguistic theory."
  },
  {
    "question_id": "EOC-R-C7-5",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 7 - Text Completions - 122-133.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C7",
    "question_number": 5,
    "question_type": "multiple_choice",
    "passage_content": "When Isaac Newton published the Principia in 1687, his laws of motion solved numerous problems in physics; however, they also introduced a new conundrum, which was not fully grasped until centuries after Newton and which still poses a problem for cosmologists today. Essentially, Newton's laws work about twice as well as they are intended: they describe the everyday world that people move through, but they also account perfectly well for a world in which people walk backwards, clocks tick from evening to morning, and",
    "question_stem": "Which choice most logically completes the text?",
    "option_a": "objects interact unpredictably with one another.",
    "option_b": "planets that are in motion remain in motion.",
    "option_c": "particles of different weights move at varying speeds.",
    "option_d": "apples rise from the ground to the branches of a tree.",
    "correct_answer": "apples rise from the ground to the branches of a tree.",
    "explanation_original": "The first two examples in the list describe situations in which things run backwards, so logically, the final item in the list must describe a normal occurrence that is reversed. Objects interacting unpredictably; planets remaining in motion; and particles of different weights moving at varying speeds are not examples of a phenomenon running backwards. Only apples rising back to a tree, rather than falling from one, illustrates the required idea. (D) is thus correct.",
    "explanation_ai_enhanced": "The passage explains that Newton's laws work equally well for a world where time is reversed. It provides two examples of this: 'people walk backwards' and 'clocks tick from evening to morning.' The blank requires a third example that follows this pattern of a reversed natural process. Apples falling from a tree is a classic example of gravity; the reverse of this would be apples rising from the ground to the tree.",
    "feedback_a": "This does not fit the pattern of time reversal.",
    "feedback_b": "This is a statement of one of Newton's laws (inertia), not an example of time reversal.",
    "feedback_c": "This describes normal physics, not a reversed phenomenon.",
    "feedback_d": "This is the correct answer. It perfectly fits the pattern of reversing a familiar physical process, just like the other examples in the list."
  },
  {
    "question_id": "EOC-R-C7-6",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 7 - Text Completions - 122-133.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C7",
    "question_number": 6,
    "question_type": "multiple_choice",
    "passage_content": "Exactly how Mars was formed approximately 4.5 billion years ago is a mystery, although there are several theories. One idea is that the planet was created via a titanic collision of rocks in space, spawning an all-encompassing magma ocean. When it cooled, a crust with high levels of basalt was formed. Another possibility is that parts of the first crust on Mars had a different origin, one that would primarily show large concentrations of silica. Planetary geochemist Valerie Payré and her partners analyzed data for the planet's southern hemisphere, the planet's oldest region. They discovered nine locations rich in feldspar, a mineral associated with lava flows that are higher in silica than basalt. This finding led them to conclude that",
    "question_stem": "Which choice most logically completes the text?",
    "option_a": "portions of Mars' surface were never covered by a crust.",
    "option_b": "the magma ocean formed from rocks colliding in space was not all-encompassing.",
    "option_c": "the southern hemisphere of Mars contained more silica than was previously believed.",
    "option_d": "the first crust on Mars did not develop until long after the planet was formed.",
    "correct_answer": "the magma ocean formed from rocks colliding in space was not all-encompassing.",
    "explanation_original": "This is a complicated question, so we're going to break it down into parts. Notice that the process outlined here requires you to work backwards through the passage. First, what is the finding? That nine regions of Mars were rich in feldspar, which is associated with lava flows that are higher in silica than basalt. What is the significance of this finding? It supports the theory that parts of the first crust on Mars had a different origin. A different origin from what? From the all-encompassing magma ocean that was created from rocks colliding in space. Logically, if parts of the crust were formed from something other than the magma ocean, then the ocean could not have been all-encompassing (covering everything). And that is what (B) says.",
    "explanation_ai_enhanced": "The passage presents two competing theories for Mars's crust: (1) an 'all-encompassing magma ocean' that created a basalt crust, and (2) an alternate origin for some parts of the crust that would be rich in silica. The researchers then found evidence of silica-rich areas. This finding supports the second theory. If some parts of the crust had a different, silica-rich origin, it logically means that the magma ocean could not have been 'all-encompassing' (covering everything), because some parts were formed differently.",
    "feedback_a": "The passage discusses different origins for the crust, not the absence of a crust.",
    "feedback_b": "This is the correct answer. Evidence for an alternate crust origin implies that the single-origin 'magma ocean' theory is incomplete and the ocean was not all-encompassing.",
    "feedback_c": "While the finding does involve discovering silica, the passage doesn't state what was 'previously believed,' so we cannot conclude it was more than expected. The conclusion relates to the two competing theories.",
    "feedback_d": "The passage discusses the origin of the first crust but does not provide a timeline for its development relative to the planet's formation."
  }
]
