[
  {
    "question_id": "EOC-G-C7-1",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 7 - Additional Comma Uses & Misuses - 108-120.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C7",
    "question_number": 1,
    "question_type": "multiple_choice",
    "question_stem": "In areas where human activity occurs in close proximity to wildlife, it was long assumed that animals would change their habits to avoid people. However, a study led by Professor Laura Prugh of the University of ____ that even in remote, rarely visited national parks, nearly any level of human activity in a protected area can alter animals' behavior.",
    "option_a": "Washington, found",
    "option_b": "Washington found:",
    "option_c": "Washington found,",
    "option_d": "Washington found",
    "correct_answer": "Washington found",
    "explanation_original": "However, a study led by Professor Laura Prugh of the University of Washington found that even in remote, rarely visited national parks, nearly any level of human activity in a protected area can alter animals' behavior.",
    "explanation_ai_enhanced": "This question tests the rule against placing a comma between a subject and its verb. The subject of the verb 'found' is 'a study led by Professor Laura Prugh of the University of Washington.' Even though the subject is long, no comma should separate it from the verb.",
    "feedback_a": "This option incorrectly places a comma between the long subject ('a study...') and its verb ('found').",
    "feedback_b": "A colon is incorrect here because the information that follows is not a list or a direct explanation of 'Washington'.",
    "feedback_c": "This option incorrectly places a comma between the subject and the verb.",
    "feedback_d": "This is the correct answer. No punctuation is needed between the subject and the verb."
  },
  {
    "question_id": "EOC-G-C7-2",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 7 - Additional Comma Uses & Misuses - 108-120.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C7",
    "question_number": 2,
    "question_type": "multiple_choice",
    "question_stem": "Bright stars acted as compasses that helped ancient Polynesian mariners navigate between the many islands of the Pacific Ocean. Using double hulled canoes, they were able to make ____ within the immense Polynesian triangle.",
    "option_a": "contact, with nearly every island",
    "option_b": "contact with nearly every, island",
    "option_c": "contact with nearly every island",
    "option_d": "contact with nearly every island,",
    "correct_answer": "contact with nearly every island",
    "explanation_original": "Using double hulled canoes, they were able to make contact with nearly every island within the immense Polynesian triangle.",
    "explanation_ai_enhanced": "This question tests comma usage with prepositions and nouns. A comma should not be placed before a preposition ('with') or between the final adjective ('every') and the noun ('island') it modifies.",
    "feedback_a": "This option incorrectly places a comma before the preposition 'with'.",
    "feedback_b": "This option incorrectly places a comma between the adjective 'every' and the noun 'island'.",
    "feedback_c": "This is the correct answer. No commas are needed within this phrase.",
    "feedback_d": "The comma at the end of the phrase is unnecessary."
  },
  {
    "question_id": "EOC-G-C7-3",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 7 - Additional Comma Uses & Misuses - 108-120.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C7",
    "question_number": 3,
    "question_type": "multiple_choice",
    "question_stem": "Originally established by the British crown, the Postal Service became essential to the American Revolution. The development of a mail network among the colonies facilitated ____ between pockets of resistance that otherwise might have remained isolated.",
    "option_a": "communication, and coordination",
    "option_b": "communication and coordination,",
    "option_c": "communication and coordination",
    "option_d": "communication, and, coordination",
    "correct_answer": "communication and coordination",
    "explanation_original": "The development of a mail network among the colonies facilitated communication and coordination between pockets of resistance that otherwise might have remained isolated.",
    "explanation_ai_enhanced": "This question tests the use of commas with compound items. When two items (in this case, the nouns 'communication' and 'coordination') are joined by 'and', no comma should be placed between them.",
    "feedback_a": "A comma is not used to separate a simple pair of nouns joined by 'and'.",
    "feedback_b": "The comma after 'coordination' is unnecessary.",
    "feedback_c": "This is the correct answer. No comma is needed to separate the two nouns.",
    "feedback_d": "This option uses incorrect and excessive punctuation."
  },
  {
    "question_id": "EOC-G-C7-4",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 7 - Additional Comma Uses & Misuses - 108-120.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C7",
    "question_number": 4,
    "question_type": "multiple_choice",
    "question_stem": "Throughout his writing, Montaigne manages to give the impression of being ready to commit to paper his every thought. As a result, the reader feels as if he were attempting to capture ____.",
    "option_a": "the process of thinking, itself.",
    "option_b": "the process of thinking itself.",
    "option_c": "the process, of thinking itself.",
    "option_d": "the process, of thinking, itself.",
    "correct_answer": "the process of thinking itself.",
    "explanation_original": "As a result, the reader feels as if he were attempting to capture the process of thinking itself.",
    "explanation_ai_enhanced": "This question tests the rule for punctuating emphatic pronouns (words ending in '-self' or '-selves'). A comma should not be placed before or around an emphatic pronoun like 'itself' when it is used for emphasis directly after a noun.",
    "feedback_a": "This option incorrectly places a comma before the emphatic pronoun 'itself'.",
    "feedback_b": "This is the correct answer. No commas are needed in this phrase.",
    "feedback_c": "This option incorrectly places a comma before the preposition 'of'.",
    "feedback_d": "This option contains multiple unnecessary commas."
  },
  {
    "question_id": "EOC-G-C7-5",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 7 - Additional Comma Uses & Misuses - 108-120.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C7",
    "question_number": 5,
    "question_type": "multiple_choice",
    "question_stem": "Having appeared sometime around 1500 B.C., Sanskrit is one of India's 22 official languages. Despite its association with classical Indian culture, it is still used in many ____.",
    "option_a": "hymns, mantras, and chants.",
    "option_b": "hymns mantras, and chants.",
    "option_c": "hymns; mantras, and, chants.",
    "option_d": "hymns, mantras and chants.",
    "correct_answer": "hymns, mantras, and chants.",
    "explanation_original": "Despite its association with classical Indian culture, it is still used in many hymns, mantras, and chants.",
    "explanation_ai_enhanced": "This question tests punctuation for items in a list. When listing three or more items, they should be separated by commas. The comma before 'and' (the Oxford comma) is optional but commonly used for clarity. Both A and D are grammatically acceptable, but SAT questions are designed to have one best answer, and A follows the standard convention of using the Oxford comma.",
    "feedback_a": "This is the correct answer, using standard comma separation for a list of three items.",
    "feedback_b": "This option is missing the comma between 'hymns' and 'mantras'.",
    "feedback_c": "This option incorrectly mixes semicolons and commas and adds an extra comma after 'and'.",
    "feedback_d": "This is also grammatically correct, as the comma before 'and' in a list is optional. However, option A is the most conventionally punctuated choice."
  },
  {
    "question_id": "EOC-G-C7-6",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 7 - Additional Comma Uses & Misuses - 108-120.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C7",
    "question_number": 6,
    "question_type": "multiple_choice",
    "question_stem": "Although there was no contact between Japan and Britain during the prehistoric era, there are surprising parallels between them. In both places, inhabitants built stone circles, crafted elaborate pots, and used flaked stone tools. Furthermore, the ____ bear striking similarities to the circle at Stonehenge.",
    "option_a": "astonishing Japanese stone circles at Oyu,",
    "option_b": "astonishing, Japanese stone circles at Oyu",
    "option_c": "astonishing Japanese, stone circles at Oyu",
    "option_d": "astonishing Japanese stone circles at Oyu",
    "correct_answer": "astonishing Japanese stone circles at Oyu",
    "explanation_original": "Furthermore, the astonishing Japanese stone circles at Oyu bear striking similarities to the circle at Stonehenge.",
    "explanation_ai_enhanced": "This question tests comma usage between adjectives. A comma is not used between two adjectives when the first adjective ('astonishing') modifies the combined idea of the second adjective and the noun ('Japanese stone circles'). You would not say 'astonishing and Japanese stone circles,' so no comma is needed.",
    "feedback_a": "The comma at the end of the phrase incorrectly separates the subject from its verb 'bear'.",
    "feedback_b": "The comma between 'astonishing' and 'Japanese' is incorrect because they are not coordinate adjectives.",
    "feedback_c": "The comma after 'Japanese' is incorrect.",
    "feedback_d": "This is the correct answer. No commas are needed within the noun phrase."
  },
  {
    "question_id": "EOC-G-C7-7",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 7 - Additional Comma Uses & Misuses - 108-120.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C7",
    "question_number": 7,
    "question_type": "multiple_choice",
    "question_stem": "Many animals recognize the voices of members of their own species, and some can even recognize those of other species, such as humans. ____, it turns out a few animals, including gorillas, can not only identify familiar voices but also connect those voices to pleasant or unpleasant memories.",
    "option_a": "Therefore",
    "option_b": "Indeed",
    "option_c": "However",
    "option_d": "For example",
    "correct_answer": "Indeed",
    "explanation_original": "Many animals recognize the voices of members of their own species... Indeed, it turns out a few animals, including gorillas, can not only identify familiar voices but also connect those voices to pleasant or unpleasant memories.",
    "explanation_ai_enhanced": "The second sentence elaborates on and emphasizes the idea presented in the first sentence. The first sentence makes a general claim (animals recognize voices), and the second sentence provides a more specific, stronger example of this ability (gorillas connect voices to memories). 'Indeed' is the correct transition to introduce a statement that confirms or strengthens the previous one.",
    "feedback_a": "'Therefore' indicates a cause-and-effect relationship, which is not present here.",
    "feedback_b": "This is the correct answer. 'Indeed' is used to add emphasis to the preceding statement.",
    "feedback_c": "'However' indicates a contrast, but the second sentence builds on, rather than contradicts, the first.",
    "feedback_d": "'For example' is a possibility, but 'Indeed' is better because the second statement is more of an intensification than a simple example."
  },
  {
    "question_id": "EOC-G-C7-8",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 7 - Additional Comma Uses & Misuses - 108-120.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C7",
    "question_number": 8,
    "question_type": "multiple_choice",
    "question_stem": "Judith Jamison decided on a career in dance only after three semesters of studying psychology at Fisk ____ her education at the Philadelphia Dance Academy. In 1964, she was spotted by choreographer Agnes de Mille, who invited her to appear in a performance with the American Ballet Theater.",
    "option_a": "University, she completed",
    "option_b": "University; and she completed",
    "option_c": "University, completing",
    "option_d": "University; completing",
    "correct_answer": "University, completing",
    "explanation_original": "Judith Jamison decided on a career in dance...at Fisk University, completing her education at the Philadelphia Dance Academy.",
    "explanation_ai_enhanced": "This question requires correctly joining a main clause with a subsequent action. The phrase 'completing her education...' is a participial phrase that describes an action done by the subject of the main clause ('Judith Jamison'). A comma is the correct way to attach this kind of descriptive phrase to the end of the main clause.",
    "feedback_a": "This option creates a comma splice by joining two independent clauses with only a comma.",
    "feedback_b": "A semicolon should separate two independent clauses. The 'and' here is redundant and makes the construction awkward.",
    "feedback_c": "This is the correct answer. The participial phrase 'completing...' correctly modifies the subject of the main clause.",
    "feedback_d": "A semicolon is incorrect because what follows ('completing...') is a phrase, not an independent clause."
  },
  {
    "question_id": "EOC-G-C7-9",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 7 - Additional Comma Uses & Misuses - 108-120.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C7",
    "question_number": 9,
    "question_type": "multiple_choice",
    "question_stem": "When a person breaks a bone, it eventually knits itself back together. ____ a researcher at Delft University of Technology in the Netherlands, wondered why buildings couldn't do the same. Inspired by the human body, Jonkers created self-healing concrete.",
    "option_a": "Microbiologist, Henk Jonkers,",
    "option_b": "Microbiologist Henk Jonkers,",
    "option_c": "Microbiologist, Henk Jonkers",
    "option_d": "Microbiologist Henk Jonkers-",
    "correct_answer": "Microbiologist Henk Jonkers,",
    "explanation_original": "Microbiologist Henk Jonkers, a researcher at Delft University of Technology in the Netherlands, wondered why buildings couldn't do the same.",
    "explanation_ai_enhanced": "This question tests punctuation with names and titles. The phrase 'a researcher at Delft...' is a non-essential appositive describing Henk Jonkers. However, the name 'Henk Jonkers' is essential to identify which microbiologist is being discussed. Therefore, no commas should go around the name itself. A comma is needed *after* the name to set off the following non-essential phrase ('a researcher at Delft...').",
    "feedback_a": "This option incorrectly places a comma between the title 'Microbiologist' and the name 'Henk Jonkers'.",
    "feedback_b": "This is the correct answer. The name is essential, so it isn't set off by commas, but the following descriptive phrase is non-essential and is set off by a comma.",
    "feedback_c": "This option has an incorrect comma between the title and the name and is missing the comma after the name.",
    "feedback_d": "A dash is not the appropriate punctuation here."
  },
  {
    "question_id": "EOC-G-C7-10",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 7 - Additional Comma Uses & Misuses - 108-120.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C7",
    "question_number": 10,
    "question_type": "multiple_choice",
    "question_stem": "Perhaps the ocean organism most vulnerable to temperature change is coral. There is evidence that reefs will bleach—that is, eject algae that play a key role in maintaining their ____ even a slight persistent increase in temperature.",
    "option_a": "ecosystems—at",
    "option_b": "ecosystems, at",
    "option_c": "ecosystems at,",
    "option_d": "ecosystems: at",
    "correct_answer": "ecosystems—at",
    "explanation_original": "There is evidence that reefs will bleach—that is, eject algae that play a key role in maintaining their ecosystems—at even a slight persistent increase in temperature.",
    "explanation_ai_enhanced": "The sentence uses an opening dash to introduce a non-essential explanatory phrase ('that is, eject algae...'). To correctly punctuate a non-essential element in the middle of a sentence, the same punctuation mark must be used at the beginning and the end. Therefore, a closing dash is required.",
    "feedback_a": "This is the correct answer. A closing dash is needed to match the opening dash and properly enclose the non-essential phrase.",
    "feedback_b": "This option incorrectly uses a comma to close a phrase that was opened with a dash.",
    "feedback_c": "The comma after 'at' is unnecessary and incorrect.",
    "feedback_d": "A colon is not the correct punctuation to close the phrase."
  },
  {
    "question_id": "EOC-G-C7-11",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 7 - Additional Comma Uses & Misuses - 108-120.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C7",
    "question_number": 11,
    "question_type": "multiple_choice",
    "question_stem": "Once in power, King Henry VII of England legitimized his rule by suppressing rebellions and proclaiming his links to the European continent. According to Elizabeth Cleland, a curator at the Metropolitan Museum of Art, the ____ recognized the importance of art in emphasizing such ties.",
    "option_a": "king who had spent his youth, in exile abroad",
    "option_b": "king—who had spent his youth in exile abroad,",
    "option_c": "king, who had spent his youth in exile abroad,",
    "option_d": "king who had spent his youth in exile abroad,",
    "correct_answer": "king, who had spent his youth in exile abroad,",
    "explanation_original": "...the king, who had spent his youth in exile abroad, recognized the importance of art in emphasizing such ties.",
    "explanation_ai_enhanced": "The clause 'who had spent his youth in exile abroad' provides additional, non-essential information about King Henry VII. Since there is only one king being discussed, this information is not needed to identify him. Non-essential clauses should be set off by a pair of commas.",
    "feedback_a": "This option uses incorrect and illogical comma placement.",
    "feedback_b": "A dash is incorrect here as it is not paired with another dash.",
    "feedback_c": "This is the correct answer. The non-essential 'who' clause is correctly enclosed in commas.",
    "feedback_d": "This option is missing the opening comma, which is necessary because the clause is non-essential."
  },
  {
    "question_id": "EOC-G-C7-12",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 7 - Additional Comma Uses & Misuses - 108-120.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C7",
    "question_number": 12,
    "question_type": "multiple_choice",
    "question_stem": "The simplest type of bridge can be created by dragging a log over a creek. However, the construction of modern bridges typically requires years of ____ architects, engineers, and artists may spend a decade or more working together to design a single structure.",
    "option_a": "education, today,",
    "option_b": "education today,",
    "option_c": "education today",
    "option_d": "education: today,",
    "correct_answer": "education: today,",
    "explanation_original": "However, the construction of modern bridges typically requires years of education: today, architects, engineers, and artists may spend a decade or more working together to design a single structure.",
    "explanation_ai_enhanced": "The second clause ('today, architects, engineers, and artists...') serves as an example or elaboration of the first clause ('construction...requires years of education'). A colon is used to connect two independent clauses when the second clause explains or gives an example of the first.",
    "feedback_a": "This option creates a comma splice by joining two independent clauses with only a comma.",
    "feedback_b": "This option also creates a comma splice.",
    "feedback_c": "This option creates a run-on sentence by joining two independent clauses with no punctuation.",
    "feedback_d": "This is the correct answer. The colon correctly introduces the clause that explains the preceding statement."
  },
  {
    "question_id": "EOC-G-C7-13",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 7 - Additional Comma Uses & Misuses - 108-120.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C7",
    "question_number": 13,
    "question_type": "multiple_choice",
    "question_stem": "Illusions, cognitive scientists have found, can reveal everything from how we process time and space to how we experience consciousness. ____ watching a waterfall shifts his or her gaze to a group of rocks on the side, the rocks appear to move in the opposite direction from the flow of water.",
    "option_a": "Nevertheless, if a person",
    "option_b": "Therefore, if a person",
    "option_c": "Still, if a person",
    "option_d": "To illustrate, if a person",
    "correct_answer": "To illustrate, if a person",
    "explanation_original": "To illustrate, if a person watching a waterfall shifts his or her gaze..., the rocks appear to move...",
    "explanation_ai_enhanced": "The first sentence makes a general claim that illusions can reveal how we process time and space. The second sentence describes a specific illusion (the waterfall effect). Therefore, the second sentence serves as an example for the first. The transition 'To illustrate' is the most appropriate choice to introduce an example.",
    "feedback_a": "'Nevertheless' indicates a contrast, which is not the relationship between these sentences.",
    "feedback_b": "'Therefore' indicates a result, but the second sentence is an example, not a result.",
    "feedback_c": "'Still' indicates a contrast, which is incorrect.",
    "feedback_d": "This is the correct answer. The waterfall effect is a perfect illustration of the general claim made in the first sentence."
  },
  {
    "question_id": "EOC-G-C7-14",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 7 - Additional Comma Uses & Misuses - 108-120.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C7",
    "question_number": 14,
    "question_type": "multiple_choice",
    "question_stem": "Eli Whitney's most famous invention, the cotton gin, was patented in 1794. The ____ is short for \"engine,\" and the cotton gin revolutionized cotton production by automating its processing.",
    "option_a": "word, gin,",
    "option_b": "word gin—",
    "option_c": "word gin",
    "option_d": "word gin,",
    "correct_answer": "word gin",
    "explanation_original": "The word gin is short for \"engine,\"...",
    "explanation_ai_enhanced": "The word 'gin' is the subject of the verb 'is'. No punctuation should be placed between a simple subject and its verb.",
    "feedback_a": "This option incorrectly places commas around the subject 'gin'.",
    "feedback_b": "A dash is not appropriate here.",
    "feedback_c": "This is the correct answer. No punctuation is needed between the subject and the verb.",
    "feedback_d": "This option incorrectly places a comma between the subject and the verb."
  },
  {
    "question_id": "EOC-G-C7-15",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 7 - Additional Comma Uses & Misuses - 108-120.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C7",
    "question_number": 15,
    "question_type": "multiple_choice",
    "question_stem": "Patients who participate in clinical trials hope to gain access to experimental treatments that would not otherwise be available to them. Every clinical drug trial conducted today randomly assigns patients to one of two ____ receives the actual medication.",
    "option_a": "groups, however. Only one of which",
    "option_b": "groups; however, only one of which",
    "option_c": "groups, however, only one of them",
    "option_d": "groups; however, only one of them",
    "correct_answer": "groups; however, only one of which",
    "explanation_original": "...assigns patients to one of two groups; however, only one of which receives the actual medication.",
    "explanation_ai_enhanced": "This question requires joining an independent clause ('Every clinical...two groups') with a dependent clause ('only one of which...'). A semicolon is used to join two independent clauses. Here, the semicolon correctly separates the main clause from the transitional phrase 'however'. The phrase 'only one of which...' correctly creates a dependent clause that refers back to 'groups'.",
    "feedback_a": "Using a period creates a sentence fragment ('Only one of which...').",
    "feedback_b": "This is the correct answer. It correctly uses a semicolon before the transition and the phrase 'only one of which' to create a grammatically sound dependent clause.",
    "feedback_c": "This option creates a comma splice.",
    "feedback_d": "This option joins two independent clauses ('...two groups' and 'only one of them receives...') with a semicolon and transition, which is grammatically correct but stylistically less fluid than option B."
  },
  {
    "question_id": "EOC-G-C7-16",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 7 - Additional Comma Uses & Misuses - 108-120.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C7",
    "question_number": 16,
    "question_type": "multiple_choice",
    "question_stem": "Since the early nineteenth century, doomsayers have gloomily predicted that increasing populations would exhaust their food ____ shortages would result in catastrophic famines. Yet the world currently produces enough food to feed 10 billion people, and there are only seven billion of us.",
    "option_a": "supplies in only a few decades they claimed",
    "option_b": "supplies, in only a few decades, they claimed",
    "option_c": "supplies. In only a few decades, they claimed,",
    "option_d": "supplies in only a few decades they claimed,",
    "correct_answer": "supplies. In only a few decades, they claimed,",
    "explanation_original": "...would exhaust their food supplies. In only a few decades, they claimed, shortages would result in catastrophic famines.",
    "explanation_ai_enhanced": "The original text contains two complete sentences that have been fused together. The first sentence ends with 'food supplies.' The second sentence is 'shortages would result in catastrophic famines,' which is interrupted by the non-essential phrase 'In only a few decades, they claimed,'. The correct way to fix this is to separate the two sentences with a period.",
    "feedback_a": "This option creates a run-on sentence.",
    "feedback_b": "This option creates a comma splice.",
    "feedback_c": "This is the correct answer. A period is used to separate the two independent clauses, and the interrupting phrase in the second sentence is correctly set off by commas.",
    "feedback_d": "This option creates a run-on sentence and has incorrect comma usage."
  },
  {
    "question_id": "EOC-G-C7-17",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 7 - Additional Comma Uses & Misuses - 108-120.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C7",
    "question_number": 17,
    "question_type": "multiple_choice",
    "question_stem": "High-elevation pine trees are among the oldest forms of flora on the North American continent. Among them, Pinus longaeva is notable for its extreme longevity and stability during periods of change. Contributing to the species' ____ that enhance survival in harsh, dry habits and defensive traits that make it less vulnerable than other high-elevation pines to tree-killing bark beetles.",
    "option_a": "remarkable durability, are physiological traits",
    "option_b": "remarkable durability are: physiological traits",
    "option_c": "remarkable, durability are physiological traits",
    "option_d": "remarkable durability are physiological traits",
    "correct_answer": "remarkable durability are physiological traits",
    "explanation_original": "Contributing to the species' remarkable durability are physiological traits that enhance survival...",
    "explanation_ai_enhanced": "This sentence uses an inverted structure. The subject is 'physiological traits,' and the verb is 'are.' The verb comes before the subject. No comma should be placed between a verb and its subject, even in an inverted sentence. Also, 'remarkable' and 'durability' should not be separated by a comma.",
    "feedback_a": "This option incorrectly places a comma between the verb 'are' and the subject 'physiological traits'.",
    "feedback_b": "A colon is incorrect here because what precedes it is not an independent clause.",
    "feedback_c": "The comma between 'remarkable' and 'durability' is incorrect.",
    "feedback_d": "This is the correct answer. No punctuation is needed in the underlined portion."
  },
  {
    "question_id": "EOC-G-C7-18",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 7 - Additional Comma Uses & Misuses - 108-120.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C7",
    "question_number": 18,
    "question_type": "multiple_choice",
    "question_stem": "Unlike electronic devices, which are powered by the manipulation of electrons, the human brain relies on the movement of ions in liquid. Inspired by this process, researchers have long sought to develop water-based \"ionics\". Although ions in water move more slowly than the electrons that are used in smartphones or ____ researchers believe that the ionic species with different physical and chemical properties could be harnessed in a variety of ways.",
    "option_a": "computers,",
    "option_b": "computers",
    "option_c": "computers;",
    "option_d": "computers, but",
    "correct_answer": "computers,",
    "explanation_original": "Although ions in water move more slowly than the electrons that are used in smartphones or computers, researchers believe that...",
    "explanation_ai_enhanced": "The sentence begins with an introductory dependent clause starting with 'Although.' When a dependent clause comes before the main independent clause, it must be separated from the main clause by a comma.",
    "feedback_a": "This is the correct answer. A comma is required to separate the introductory dependent clause from the main clause.",
    "feedback_b": "This option is missing the required comma, creating a run-on sentence.",
    "feedback_c": "A semicolon is incorrect because the first part of the sentence is a dependent clause, not an independent one.",
    "feedback_d": "Adding 'but' is redundant because the sentence already starts with the contrasting conjunction 'Although'."
  },
  {
    "question_id": "EOC-G-C7-19",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 7 - Additional Comma Uses & Misuses - 108-120.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C7",
    "question_number": 19,
    "question_type": "multiple_choice",
    "question_stem": "Facing extreme conditions such as starvation and stress, some bacteria enter a dormant state in which life processes stop. Biologists have discovered how these microbes assess environmental conditions before reviving ____ carries implications for evaluating life on Earth as well as other planets.",
    "option_a": "themselves, this process",
    "option_b": "themselves this process:",
    "option_c": "themselves this process",
    "option_d": "themselves a process that",
    "correct_answer": "themselves a process that",
    "explanation_original": "...before reviving themselves a process that carries implications for evaluating life on Earth as well as other planets.",
    "explanation_ai_enhanced": "The phrase 'a process that carries implications...' is an appositive that renames and describes the action of the microbes assessing conditions and reviving themselves. This construction correctly connects the description to the action without creating a comma splice or a run-on sentence.",
    "feedback_a": "This option creates a comma splice by linking two independent clauses ('Biologists have discovered...' and 'this process carries...') with only a comma.",
    "feedback_b": "A colon is incorrect here because what precedes it is not a complete independent clause.",
    "feedback_c": "This option creates a run-on sentence by fusing two clauses without proper punctuation or conjunction.",
    "feedback_d": "This is the correct answer. The appositive 'a process that...' correctly renames and describes the preceding action."
  },
  {
    "question_id": "EOC-G-C7-20",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 7 - Additional Comma Uses & Misuses - 108-120.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C7",
    "question_number": 20,
    "question_type": "multiple_choice",
    "question_stem": "Most theories claim the Moon formed out of the debris of a collision between the Earth and a Mars-sized object known as Theia, which came together in orbit over a period of months or years. A new simulation advances a different ____ may have formed in a matter of hours, when material from the Earth and Theia was launched into orbit immediately after the impact.",
    "option_a": "theory, though the Moon",
    "option_b": "theory, though: the Moon",
    "option_c": "theory; though, the Moon",
    "option_d": "theory though the Moon",
    "correct_answer": "theory, though: the Moon",
    "explanation_original": "A new simulation advances a different theory, though: the Moon may have formed in a matter of hours...",
    "explanation_ai_enhanced": "The phrase 'though' is used here as a non-essential transition at the end of the first clause. The clause 'the Moon may have formed in a matter of hours...' serves as a direct explanation or elaboration of the 'different theory' mentioned. A colon is the perfect punctuation to introduce such an explanation following an independent clause.",
    "feedback_a": "This option creates a run-on sentence.",
    "feedback_b": "This is the correct answer. The comma sets off the non-essential 'though', and the colon correctly introduces the explanation of the new theory.",
    "feedback_c": "A semicolon is incorrect here because it separates 'though' from the clause it logically belongs with.",
    "feedback_d": "This option is missing the necessary punctuation around the transition 'though'."
  }
]
