[
  {
    "question_id": "EOC-R-C2-1",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 2 - Vocabulary in Context -30-61 - Copy.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C2",
    "question_number": 1,
    "question_type": "multiple_choice",
    "option_a": "dazzling",
    "option_b": "artificial",
    "option_c": "impressive",
    "option_d": "realistic",
    "option_e": null,
    "correct_answer": "artificial",
    "explanation_original": "Negative; key words: rigid, in contrast, lifelike. \"Artificial\" is the only negative answer and is the opposite of lifelike.",
    "explanation_ai_enhanced": "The text establishes a contrast between the depiction of human figures and animals in Ancient Egyptian art. The keyword 'In contrast' signals this opposition. While animals are described as 'lifelike,' human figures are described as 'rigid and ______.' Therefore, the blank must be filled with a word that is opposite in meaning to 'lifelike' and similar in meaning to 'rigid.' [cite_start]'Artificial,' meaning unnatural or man-made, fits this context perfectly as it contrasts with the natural and 'lifelike' quality of the animal depictions. [cite: 675, 676, 820]\n\nWhy A, C, and D are wrong: 'Dazzling' and 'impressive' are positive terms that do not align with the sense of stiffness conveyed by 'rigid.' [cite_start]'Realistic' is a synonym for 'lifelike,' making it the opposite of the required word. [cite: 820]",
    "feedback_a": "'Dazzling' is a positive term that does not align with the sense of stiffness conveyed by 'rigid.'",
    "feedback_b": "Correct. [cite_start]'Artificial' means unnatural and serves as an antonym to 'lifelike,' fitting the contrast set up by the sentence. [cite: 821]",
    "feedback_c": "'Impressive' is a positive term that does not align with the sense of stiffness conveyed by 'rigid.'",
    [cite_start]"feedback_d": "'Realistic' is a synonym for 'lifelike,' making it the opposite of what is required by the sentence's contrast. [cite: 821]",
    "passage_content": "In Ancient Egyptian art, human figures are presented in a rigid and ______ manner. [cite_start]In contrast, animals are often very well-observed and lifelike. [cite: 675, 676]",
    "question_stem": "In Ancient Egyptian art, human figures are presented in a rigid and ______ manner. In contrast, animals are often very well-observed and lifelike."
  },
  {
    "question_id": "EOC-R-C2-2",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 2 - Vocabulary in Context -30-61 - Copy.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C2",
    "question_number": 2,
    "question_type": "multiple_choice",
    "option_a": "relative",
    "option_b": "dominant",
    "option_c": "regular",
    "option_d": "secure",
    "option_e": null,
    "correct_answer": "dominant",
    "explanation_original": "Positive; key words: inherit their mother's rank, compete with one another. The correct word must mean something like \"high.\" A \"dominant\" animal is the one that has high status, so (B) is correct. Don't get distracted by \"secure\": the focus is on achieving a high rank, within the pack, not a stable one, as \"secure\" would imply.",
    [cite_start]"explanation_ai_enhanced": "The text states that female hyenas 'inherit their mother's rank' and that sisters must 'compete with one another' for a position in the 'hierarchy.' [cite: 677] The keywords 'compete' and 'hierarchy' suggest a struggle for a high-status or powerful position. [cite_start]'Dominant' means having power and influence over others, which accurately describes a high-ranking position within a social hierarchy. [cite: 823]\n\nWhy A, C, and D are wrong: 'Relative' means considered in relation to something else and does not fit the context of social rank. 'Regular' implies ordinary or standard, which is the opposite of a competed-for position in a hierarchy. [cite_start]While a hyena might want a 'secure' position, the word 'compete' points more directly to the idea of dominance and high rank rather than mere stability. [cite: 824]",
    "feedback_a": "'Relative' means considered in relation to something else and does not fit the context of social rank.",
    "feedback_b": "Correct. [cite_start]The context of competition within a social 'hierarchy' indicates a struggle for a 'dominant' or high-status position. [cite: 823]",
    "feedback_c": "'Regular' implies ordinary or standard, which is contrary to the idea of a special, competed-for position in a hierarchy.",
    [cite_start]"feedback_d": "The word 'compete' suggests a fight for power and high rank, making 'dominant' a better fit than 'secure,' which implies stability. [cite: 824]",
    "passage_content": "Female hyenas remain within their clan and inherit their mother's rank. [cite_start]As a result, sisters must compete with one another to obtain a ______ position in the hierarchy. [cite: 677]",
    "question_stem": "Female hyenas remain within their clan and inherit their mother's rank. As a result, sisters must compete with one another to obtain a ______ position in the hierarchy."
  },
  {
    "question_id": "EOC-R-C2-3",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 2 - Vocabulary in Context -30-61 - Copy.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C2",
    "question_number": 3,
    "question_type": "multiple_choice",
    "option_a": "demanding",
    "option_b": "prevalent",
    "option_c": "frivolous",
    "option_d": "important",
    "option_e": null,
    "correct_answer": "frivolous",
    "explanation_original": "Negative; key words: essential role, more effective than speech, questioning. The correct word must mean something like \"unimportant.\" \"Demanding\" and \"prevalent\" (dominant, widely accepted) do not make sense, and \"important\" means the opposite of the required word. \"Frivolous\" means \"unserious,\" so (C) is correct.",
    "explanation_ai_enhanced": "The text presents a contrast. [cite_start]Researchers are beginning to 'question' an old belief about music because new evidence shows it plays an 'essential role' and is 'more effective than speech at improving people's moods.' [cite: 679] The old belief must, therefore, be the opposite of 'essential.' The blank requires a word that means unimportant or not serious. [cite_start]'Frivolous' means not having any serious purpose or value, which fits the context perfectly. [cite: 827]\n\nWhy A, B, and D are wrong: 'Demanding' and 'prevalent' (widespread) do not mean 'unimportant' and don't fit the sentence's logic. [cite_start]'Important' is the opposite of the required meaning, as it reflects the new belief about music, not the one being questioned. [cite: 826]",
    "feedback_a": "'Demanding' does not mean 'unimportant' and doesn't fit the logic of the sentence.",
    [cite_start]"feedback_b": "'Prevalent' means widespread, which does not fit the contrast being made in the sentence. [cite: 826]",
    "feedback_c": "Correct. [cite_start]'Frivolous' means unserious or unimportant, which describes the old belief about music that researchers are now 'questioning.' [cite: 827]",
    "feedback_d": "'Important' describes the new belief about music, not the old one being questioned. [cite_start]It is the opposite of the required word. [cite: 826]",
    "passage_content": "Because music plays an essential role in facilitating social functions and is more effective than speech at improving people's moods, researchers are beginning to question whether it truly is as ______ as they once believed. [cite_start]In fact, they believe it may have evolved to promote societal cohesion. [cite: 679, 680]",
    "question_stem": "Because music plays an essential role in facilitating social functions and is more effective than speech at improving people's moods, researchers are beginning to question whether it truly is as ______ as they once believed."
  },
  {
    "question_id": "EOC-R-C2-4",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 2 - Vocabulary in Context -30-61 - Copy.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C2",
    "question_number": 4,
    "question_type": "multiple_choice",
    "option_a": "a forerunner",
    "option_b": "a relic",
    "option_c": "an heir",
    "option_d": "a proponent",
    "option_e": null,
    "correct_answer": "a forerunner",
    "explanation_original": "Neutral/positive; key words: earliest known imaging device; the correct word must mean something like \"ancestor.\" A \"forerunner\" is something that comes before, so (A) is correct. A \"relic\" (something surviving from an earlier time) and an \"heir\" are both things that come after, eliminating (B) and (C). A \"proponent\" is a person who is in favor of something, a definition that does not fit at all. (D) can thus be eliminated as well.",
    [cite_start]"explanation_ai_enhanced": "The text describes the camera obscura as 'the earliest known imaging device' and then states it was the '______ of the modern-day photographic camera.' [cite: 682] This relationship implies that the camera obscura came before the modern camera and paved the way for it. 'A forerunner' is something or someone that precedes the development of something else, functioning as a precursor or ancestor. [cite_start]This perfectly describes the relationship. [cite: 828][cite_start]\n\nWhy B, C, and D are wrong: 'A relic' is something that survives from an earlier time, and 'an heir' is something that comes after; both words reverse the chronological relationship. [cite: 829] [cite_start]'A proponent' is a person who advocates for something, which is illogical as the camera obscura is an object, not a person. [cite: 830]",
    "feedback_a": "Correct. [cite_start]A 'forerunner' is a precursor, which accurately describes the camera obscura's relationship to the modern camera. [cite: 828]",
    [cite_start]"feedback_b": "A 'relic' is something that has survived from the past, which does not accurately describe the developmental relationship here. [cite: 829]",
    [cite_start]"feedback_c": "An 'heir' is a successor, which reverses the chronological relationship between the camera obscura and the modern camera. [cite: 829]",
    [cite_start]"feedback_d": "A 'proponent' is a person who supports a cause, which does not make sense in this context. [cite: 830]",
    "passage_content": "The camera obscura—a darkened room with a small hole or lens through which an image is projected—was perhaps the earliest known imaging device. [cite_start]First referred to in a fourth-century Chinese text known as Mozi, it was ______ of the modern-day photographic camera. [cite: 682]",
    "question_stem": "The camera obscura—a darkened room with a small hole or lens through which an image is projected—was perhaps the earliest known imaging device. First referred to in a fourth-century Chinese text known as Mozi, it was ______ of the modern-day photographic camera."
  },
  {
    "question_id": "EOC-R-C2-5",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 2 - Vocabulary in Context -30-61 - Copy.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C2",
    "question_number": 5,
    "question_type": "multiple_choice",
    "option_a": "partisans",
    "option_b": "zealots",
    "option_c": "advocates",
    "option_d": "skeptics",
    "option_e": null,
    "correct_answer": "skeptics",
    "explanation_original": "Negative; key words: questioned; the correct word must describe people who question whether something is true. That is the definition of \"skeptics,\" so (D) is correct. \"Partisans\" (people who take sides) and \"zealots\" (people who are fanatical about a cause) do not fit, eliminating (A) and (B). In (D), \"advocates\" are people who are in favor of something, the opposite of the required word.",
    [cite_start]"explanation_ai_enhanced": "The text states that for centuries, a certain group has 'questioned the authorship of Shakespeare's plays,' proposing dozens of alternative candidates. [cite: 684, 685] The blank requires a word that describes people who doubt or question a commonly accepted belief. 'Skeptics' are people inclined to question or doubt accepted opinions. [cite_start]This is a direct match for the context. [cite: 833][cite_start]\n\nWhy A, B, and C are wrong: 'Partisans' (strong supporters of a party or cause) and 'advocates' (people who publicly support something) are the opposite of what is needed. [cite: 834, 835] [cite_start]'Zealots' are people who are fanatical and uncompromising in pursuit of their ideals, which is too extreme and doesn't specifically mean questioning authorship. [cite: 834]",
    [cite_start]"feedback_a": "'Partisans' are strong supporters, which is the opposite of people who question authorship. [cite: 834]",
    [cite_start]"feedback_b": "'Zealots' are fanatics, a term too extreme and less precise than 'skeptics' for this context. [cite: 834]",
    [cite_start]"feedback_c": "'Advocates' are supporters, which is the opposite of the required word. [cite: 835]",
    "feedback_d": "Correct. [cite_start]'Skeptics' are people who question or doubt accepted beliefs, which is exactly what the sentence describes. [cite: 833]",
    "passage_content": "For centuries, ______ have questioned the authorship of Shakespeare's plays. [cite_start]In total, no fewer than fifty alternative candidates, including Francis Bacon, Queen Elizabeth I, and Christopher Marlowe, have been proposed as the true writer. [cite: 684, 685]",
    "question_stem": "For centuries, ______ have questioned the authorship of Shakespeare's plays."
  },
  {
    "question_id": "EOC-R-C2-6",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 2 - Vocabulary in Context -30-61 - Copy.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C2",
    "question_number": 6,
    "question_type": "multiple_choice",
    "option_a": "flourish",
    "option_b": "diminish",
    "option_c": "extend",
    "option_d": "succumb",
    "option_e": null,
    "correct_answer": "flourish",
    "explanation_original": "The passage indicates that the Great Barrier Reef is changing in a way that will eventually result in its destruction, so the blank must be a positive word that indicates the opposite of decline. \"Diminish\" (become smaller) and \"succumb\" (give into, e.g., a disease) are both negative and can be eliminated. \"Extend\" (get longer) is positive but does not make any sense in context. Only \"flourish\" is a positive word that fits as the opposite of decline.",
    "explanation_ai_enhanced": "The text contrasts the past state of the Great Barrier Reef with its future. [cite_start]The future state is negative: it is 'likely to decline' and its supporting factors are 'changing at unprecedented rates.' [cite: 687, 688] The blank describes the past state that these changes are affecting. Therefore, the word in the blank must be positive and mean the opposite of 'decline.' [cite_start]'Flourish' means to grow or develop in a healthy or vigorous way, which is a perfect antonym for 'decline.' [cite: 839][cite_start]\n\nWhy B, C, and D are wrong: 'Diminish' (decrease) and 'succumb' (fail to resist) are negative words that align with the reef's future decline, not its past state. [cite: 837] [cite_start]'Extend' (to make longer) is positive, but it doesn't fit the biological context of growth and health as well as 'flourish' does. [cite: 838]",
    "feedback_a": "Correct. [cite_start]'Flourish' means to thrive, which is a positive word that contrasts with the reef's expected 'decline.' [cite: 839]",
    [cite_start]"feedback_b": "'Diminish' is a negative word meaning to decrease, which aligns with the predicted 'decline,' not the past state. [cite: 837]",
    [cite_start]"feedback_c": "'Extend' means to get longer, which is less appropriate in this biological context than 'flourish.' [cite: 838]",
    [cite_start]"feedback_d": "'Succumb' is a negative word meaning to give in, which describes the reef's future, not its past. [cite: 837]",
    "passage_content": "All of the factors that allowed the Great Barrier Reef to ______ are changing at unprecedented rates. [cite_start]Over the next several decades, marine biologists believe, it is likely to decline below a crucial threshold from which it is impossible to recover. [cite: 687, 688]",
    "question_stem": "All of the factors that allowed the Great Barrier Reef to ______ are changing at unprecedented rates."
  },
  {
    "question_id": "EOC-R-C2-7",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 2 - Vocabulary in Context -30-61 - Copy.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C2",
    "question_number": 7,
    "question_type": "multiple_choice",
    "option_a": "deny",
    "option_b": "complete",
    "option_c": "dictate",
    "option_d": "rely on",
    "option_e": null,
    "correct_answer": "dictate",
    "explanation_original": "The sentence indicates that the most respected [filmmakers] hold facts in scrupulous regard (I.e., very high regard) along with the rules that whether they (those facts) are acceptable. Logically, the word in the blank must be neutral/positive and mean something like \"determine.\" \"Deny\" is negative, so (A) can be eliminated immediately. \"Complete\" does not make sense in context, so (B) can be eliminated as well. Be careful with (D): this answer states things backwards. Historians and historical filmmakers \"rely on\" the rules of evidence to decide which facts are sufficiently well-documented—the rules of evidence do not rely on the acceptability on facts. Only (C) creates a logical meaning. \"Dictate\" can be used to mean \"determine\" in the sense of \"set the rules for,\" so this choice is correct.",
    [cite_start]"explanation_ai_enhanced": "The text explains that respected historians and filmmakers have a 'scrupulous regard for facts and the rules of evidence.' [cite: 690] These rules of evidence are used to determine the 'acceptability' of the facts. Therefore, the rules of evidence '______ their acceptability.' The blank needs a word that means determine or control. 'Dictate' can mean to state or order authoritatively, or to control or determine. [cite_start]In this context, it means that the rules of evidence determine what is acceptable. [cite: 844][cite_start]\n\nWhy A, B, and D are wrong: 'Deny' is negative and illogical. [cite: 842] 'Complete' does not make sense; rules don't complete acceptability. [cite_start]'Rely on' reverses the logic: historians rely on the rules; the rules do not rely on acceptability. [cite: 843]",
    [cite_start]"feedback_a": "'Deny' is negative and contradicts the meaning of the sentence. [cite: 842]",
    "feedback_b": "'Complete' does not logically fit the sentence; rules of evidence do not 'complete' acceptability.",
    "feedback_c": "Correct. [cite_start]'Dictate' is used here to mean 'determine' or 'set the rules for,' which accurately describes how rules of evidence function. [cite: 844]",
    "feedback_d": "This choice reverses the logic. [cite_start]Historians 'rely on' the rules; the rules themselves do not 'rely on' the acceptability of facts. [cite: 843]",
    [cite_start]"passage_content": "Although traditional historians and historical filmmakers differ in their choice of medium, the most respected ones share a scrupulous regard for facts and the rules of evidence that ______ their acceptability. [cite: 690]",
    "question_stem": "Although traditional historians and historical filmmakers differ in their choice of medium, the most respected ones share a scrupulous regard for facts and the rules of evidence that ______ their acceptability."
  },
  {
    "question_id": "EOC-R-C2-8",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 2 - Vocabulary in Context -30-61 - Copy.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C2",
    "question_number": 8,
    "question_type": "multiple_choice",
    "option_a": "disregard",
    "option_b": "explanation",
    "option_c": "responsibility",
    "option_d": "appreciation",
    "option_e": null,
    "correct_answer": "appreciation",
    "explanation_original": "The contradictor however indicates that the passage is contrasting the situation in the past with the situation in the present. If psychologists formerly dismissed fiction, then logically they must now have a much higher opinion of it. The blank must therefore be filled with a positive word meaning something along the lines of \"liking for.\" \"Disregard\" is negative, so (A) can be eliminated immediately. \"Explanation\" and \"responsibility\" do not make sense, eliminating (B) and (C) as well. That leaves (D): if psychologists have revised their formerly negative opinion of fiction, they have developed a new \"appreciation\" for it.",
    "explanation_ai_enhanced": "The use of 'however' signals a contrast between the past and the present. [cite_start]In the past, psychologists 'dismissed fiction.' [cite: 693] Therefore, in 'more recent times,' they must have developed the opposite of dismissal—a positive view. The blank requires a positive word that means something like respect or high regard. [cite_start]'Appreciation' means recognition and enjoyment of the good qualities of someone or something, which fits this context perfectly. [cite: 849][cite_start]\n\nWhy A, B, and C are wrong: 'Disregard' is a synonym for 'dismissed' and reflects the past view, not the new one. [cite: 848] [cite_start]'Explanation' and 'responsibility' are neutral terms that do not convey the necessary positive shift in opinion. [cite: 848]",
    [cite_start]"feedback_a": "'Disregard' is a synonym for 'dismissed' and thus reflects the past attitude, not the current, changed one. [cite: 848]",
    "feedback_b": "'Explanation' does not fit the context. Psychologists developed a new view of fiction, not a new explanation for it in this sense.",
    "feedback_c": "'Responsibility' does not make sense. It is illogical to say they developed a new responsibility for insights.",
    "feedback_d": "Correct. [cite_start]'Appreciation' denotes a positive recognition of value, which contrasts with the earlier 'dismissal' of fiction. [cite: 849]",
    "passage_content": "In the past, psychologists dismissed fiction as a way of understanding human emotions. [cite_start]In more recent times, however, they have developed a new ______ for the insights that stories can provide into human behavior. [cite: 693]",
    "question_stem": "In the past, psychologists dismissed fiction as a way of understanding human emotions. In more recent times, however, they have developed a new ______ for the insights that stories can provide into human behavior."
  },
  {
    "question_id": "EOC-R-C2-9",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 2 - Vocabulary in Context -30-61 - Copy.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C2",
    "question_number": 9,
    "question_type": "multiple_choice",
    "option_a": "supplant",
    "option_b": "deny",
    "option_c": "salvage",
    "option_d": "challenge",
    "option_e": null,
    "correct_answer": "supplant",
    "explanation_original": "Although the passage includes two sentence, this question can be answered with information from the first sentence only. There, we learn that Kakuzo is considered responsible for the revival of Nihonga—the implication is that this art form was dying out. Why? Because Western-style painting was threatening to it. Logically, the blank must be filled with a word meaning something like \"replace.\" That is the definition of \"supplant,\" so (A) is correct. \"Deny,\" \"salvage\" (save), and \"challenge\" all do not make sense in context.",
    [cite_start]"explanation_ai_enhanced": "The text credits Okakura Kakuzo with the 'revival' of the traditional Japanese painting style, Nihonga. [cite: 695] A revival is necessary only when something is in decline or danger of disappearing. The reason for this danger is that Western-style painting 'was threatening to ______ it.' This implies that the Western style was poised to take the place of Nihonga. [cite_start]'Supplant' means to supersede and replace, which perfectly captures this idea of one style taking over from another. [cite: 853]\n\nWhy B, C, and D are wrong: 'Deny' and 'challenge' do not mean 'replace' and are less precise. Western painting wasn't just questioning Nihonga, it was displacing it. 'Salvage' means to save, which is the opposite of what the Western style was threatening to do; [cite_start]Kakuzo was the one trying to salvage Nihonga. [cite: 854]",
    "feedback_a": "Correct. [cite_start]'Supplant' means to replace, which is what Western-style painting was threatening to do to the traditional Japanese style, necessitating its 'revival.' [cite: 853]",
    "feedback_b": "'Deny' does not fit the context of one art style displacing another.",
    "feedback_c": "'Salvage' means to save, which is what Kakuzo did. [cite_start]It's the opposite of the threat posed by Western painting. [cite: 854]",
    "feedback_d": "While Western painting posed a 'challenge,' the word 'supplant' more accurately describes the threat of complete replacement implied by the need for a 'revival.'",
    "passage_content": "Okakura Kakuzo is credited with the revival of Nihonga, painting done with traditional Japanese techniques, at a time when Western-style painting was threatening to ______ it. [cite_start]When, in 1897, it became clear that European methods were to be given prominence at the Tokyo Academy of Fine Arts, he resigned his directorship and shortly after helped found the Japanese National Arts Academy. [cite: 695]",
    "question_stem": "Okakura Kakuzo is credited with the revival of Nihonga, painting done with traditional Japanese techniques, at a time when Western-style painting was threatening to ______ it."
  },
  {
    "question_id": "EOC-R-C2-10",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 2 - Vocabulary in Context -30-61 - Copy.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C2",
    "question_number": 10,
    "question_type": "multiple_choice",
    "option_a": "a pragmatist",
    "option_b": "a polemicist",
    "option_c": "a curiosity",
    "option_d": "an amateur",
    "option_e": null,
    "correct_answer": "a polemicist",
    "explanation_original": "Elders is described in the passage as an outspoken advocate for a variety of controversial issues, and the word in the blank must indicate how she was perceived as a result. Logically, the correct word must be somewhat negative and describe a person who is involved in controversy, or who is perceived as difficult. (A) does not fit because a \"pragmatist\" is someone who is concerned with practical solutions. (C) does not work either because someone who is \"a curiosity\" is viewed as odd or puzzling, which has nothing to do with controversy. The same is true for \"amateur\" (non-professional) in (D). A \"polemicist,\" on the other hand, is someone who takes sides very strongly, which is consistent with being an outspoken advocate for controversial issues.",
    [cite_start]"explanation_ai_enhanced": "The text describes Joycelyn Elders as an 'outspoken advocate for a variety of controversial health issues.' [cite: 697] 'As a result,' she established a certain reputation. The blank needs a noun that describes a person who engages in controversy and is outspoken. 'A polemicist' is a person who engages in controversial debate or who argues strongly for or against something. [cite_start]This description is consistent with being an 'outspoken advocate for controversial issues.' [cite: 860][cite_start]\n\nWhy A, C, and D are wrong: 'A pragmatist' is a practical, realistic person, which is not what is implied by the focus on controversy. [cite: 857] [cite_start]'A curiosity' is someone odd or unusual, and 'an amateur' is a non-professional; neither of these relates to being an outspoken advocate. [cite: 858, 859]",
    [cite_start]"feedback_a": "A 'pragmatist' is a practical person, which doesn't align with the description of being an 'outspoken advocate for controversial issues.' [cite: 857]",
    "feedback_b": "Correct. [cite_start]A 'polemicist' is someone who engages in strong, controversial debate, which is a reputation one would establish by being an 'outspoken advocate for controversial issues.' [cite: 860]",
    [cite_start]"feedback_c": "A 'curiosity' is someone odd or puzzling, which is unrelated to the context of health advocacy and controversy. [cite: 858]",
    [cite_start]"feedback_d": "An 'amateur' is a non-professional, a term that doesn't fit the description of a surgeon general's reputation. [cite: 859]",
    "passage_content": "Like many of the surgeons general before her, Joycelyn Elders became an outspoken advocate for a variety of controversial health issues. [cite_start]As a result, she quickly established a reputation for being ______. [cite: 697, 698]",
    "question_stem": "Like many of the surgeons general before her, Joycelyn Elders became an outspoken advocate for a variety of controversial health issues. As a result, she quickly established a reputation for being ______."
  },
  {
    "question_id": "EOC-R-C2-11",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 2 - Vocabulary in Context -30-61 - Copy.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C2",
    "question_number": 11,
    "question_type": "multiple_choice",
    "option_a": "velocity",
    "option_b": "significance",
    "option_c": "mastery",
    "option_d": "influence",
    "option_e": null,
    "correct_answer": "velocity",
    "explanation_original": "The second sentence indicates that Chicago grew from almost nothing to a city of two million in the space of just 80 years, so the blank must be filled with a word meaning \"speed.\" That is the definition of \"velocity,\" so (A) is correct. \"Significance,\" \"mastery,\" and \"influence\" do not fit the required definition.",
    [cite_start]"explanation_ai_enhanced": "The text states that Chicago 'epitomized the remarkable ______ of urbanization' in the 19th century. [cite: 699] [cite_start]The next sentence provides the evidence: the city's population grew from a few hundred to nearly two million in just 80 years. [cite: 700] This evidence illustrates the incredible speed and rate of growth. 'Velocity' means speed, especially in a given direction. [cite_start]In this context, it is used to mean the speed of the city's growth and urbanization. [cite: 862]\n\nWhy B, C, and D are wrong: While Chicago's urbanization certainly had 'significance' and 'influence,' and its growth could be seen as a form of 'mastery,' the specific evidence provided (population growth over a short time) points directly to the speed of the change. [cite_start]'Velocity' is the most precise word to describe this rapid expansion. [cite: 862]",
    "feedback_a": "Correct. [cite_start]'Velocity' means speed, and the evidence of massive population growth in only 80 years directly supports the idea of the remarkable speed of urbanization. [cite: 862]",
    [cite_start]"feedback_b": "While the urbanization was significant, 'velocity' is more precise because the supporting detail is about the rate of growth. [cite: 862]",
    "feedback_c": "'Mastery' does not fit the context. The sentence is describing the rate of urbanization, not a level of skill or control.",
    [cite_start]"feedback_d": "While Chicago's growth gave it influence, the word in the blank describes the nature of the urbanization itself, which the evidence shows was remarkably fast. [cite: 862]",
    "passage_content": "Chicago epitomized the remarkable ______ of urbanization during the nineteenth century. [cite_start]The city expanded from several hundred residents in 1830 to nearly two million just eighty years later. [cite: 699, 700]",
    "question_stem": "Chicago epitomized the remarkable ______ of urbanization during the nineteenth century."
  },
  {
    "question_id": "EOC-R-C2-12",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 2 - Vocabulary in Context -30-61 - Copy.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C2",
    "question_number": 12,
    "question_type": "multiple_choice",
    "option_a": "scorn",
    "option_b": "jubilation",
    "option_c": "consideration",
    "option_d": "impatience",
    "option_e": null,
    "correct_answer": "scorn",
    "explanation_original": "The first sentence indicates that Margulis's theory built upon ideas that had largely been discredited (become considered inaccurate), and the second sentence illustrates that idea by emphasizing the many journals that rejected her groundbreaking paper. Given that context, the blank must be filled with an extremely negative word meaning \"dislike.\" (A) is correct because something that is \"scorned\" is viewed as worthless. (B) is incorrect because \"jubilation\" is an extremely positive word meaning \"joy\"; in (C), \"consideration\" is positive as well. Although \"impatience\" is negative, this word is not a good match because it does not have a connotation of strong dislike.",
    [cite_start]"explanation_ai_enhanced": "The text explains that Lynn Margulis's theory was met with a negative reaction for two key reasons: it was based on 'discredited' ideas, and her paper was 'rejected by fifteen journals.' [cite: 702, 703] This context requires an extremely negative word in the blank to describe the scientific community's initial reaction. [cite_start]'Scorn' is a feeling and expression of contempt or disdain for someone or something, which perfectly captures the level of disrespect indicated by the rejections and the use of discredited ideas. [cite: 866][cite_start]\n\nWhy B, C, and D are wrong: 'Jubilation' (joy) and 'consideration' (careful thought) are positive and the opposite of what is needed. [cite: 867] [cite_start]'Impatience' is negative, but it is not strong enough; the scientific community didn't just not want to wait, they actively disliked and rejected the theory. [cite: 868]",
    "feedback_a": "Correct. [cite_start]'Scorn' means contempt or disdain, which is a strongly negative reaction consistent with the theory being based on 'discredited' ideas and the paper being 'rejected' multiple times. [cite: 866]",
    [cite_start]"feedback_b": "'Jubilation' means great happiness and is the opposite of the required meaning. [cite: 867]",
    [cite_start]"feedback_c": "'Consideration' is a positive word implying careful thought, which is contrary to the context of rejection. [cite: 867]",
    [cite_start]"feedback_d": "'Impatience' is a negative word, but it is too weak to capture the strong sense of rejection and disdain implied by the context. [cite: 868]",
    "passage_content": "Lynn Margulis's revolutionary theory of eukaryotic cell development was initially met with almost unanimous ______ because it built upon ideas that had largely been discredited. [cite_start]In fact, her groundbreaking 1967 paper, \"On the Origin of Mitosing Cells,\" was published only after being rejected by fifteen journals. [cite: 702, 703]",
    "question_stem": "Lynn Margulis's revolutionary theory of eukaryotic cell development was initially met with almost unanimous ______ because it built upon ideas that had largely been discredited."
  },
  {
    "question_id": "EOC-R-C2-13",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 2 - Vocabulary in Context -30-61 - Copy.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C2",
    "question_number": 13,
    "question_type": "multiple_choice",
    "option_a": "contain",
    "option_b": "elevate",
    "option_c": "compromise",
    "option_d": "enjoy",
    "option_e": null,
    "correct_answer": "elevate",
    "explanation_original": "The key phrases simple but refined and rational and more harmonious indicate that the word in the blank must be very positive and mean something like \"improve.\" Compromise\" (weaken the quality of) has a negative connotation in this context, and \"contain\" is neutral/negative so (A) and (C) can be eliminated. \"Enjoy\" is positive but does not make sense when plugged in. Simple but refined aesthetics (concepts of beauty) cannot \"enjoy\" anything—only people can do that. (B) is correct because \"elevate\" (raise to a more sophisticated level) logically describes how proponents (people in favor of; prefix pro-) an artistic movement with simple but refined aesthetics would view its effect.",
    "explanation_ai_enhanced": "The text describes the claims of the Arts and Crafts movement's proponents. [cite_start]They believed their 'simple but refined aesthetics' would have a positive effect, making individuals 'more rational and society more harmonious.' [cite: 705, 706] Therefore, the blank needs a positive verb that means to improve or lift up. [cite_start]'Elevate' means to raise to a more important or impressive level, which perfectly describes the positive, uplifting effect the movement's proponents hoped to have on industrial consumerism.\n\nWhy A, C, and D are wrong: 'Contain' (control) and 'compromise' (weaken or endanger) do not fit the positive context. [cite: 870] [cite_start]'Enjoy' is illogical; an aesthetic cannot 'enjoy' an experience, only a person can. [cite: 870]",
    "feedback_a": "'Contain' means to control, which does not fit the positive, improving effect described in the text.",
    "feedback_b": "Correct. 'Elevate' means to raise or improve, fitting the context that the movement's 'refined aesthetics' would make society 'more rational and harmonious.'",
    [cite_start]"feedback_c": "'Compromise' means to weaken, which is the opposite of the positive effect described in the text. [cite: 870]",
    "feedback_d": "This choice is illogical. [cite_start]An aesthetic quality cannot 'enjoy' something; only a sentient being can. [cite: 870]",
    "passage_content": "Proponents of the Arts and Crafts movement claimed that its simple but refined aesthetics would ______ the new experience of industrial consumerism. [cite_start]Individuals would become more rational and society more harmonious. [cite: 705, 706]",
    "question_stem": "Proponents of the Arts and Crafts movement claimed that its simple but refined aesthetics would ______ the new experience of industrial consumerism."
  },
  {
    "question_id": "EOC-R-C2-14",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 2 - Vocabulary in Context -30-61 - Copy.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C2",
    "question_number": 14,
    "question_type": "multiple_choice",
    "option_a": "docile",
    "option_b": "advantageous",
    "option_c": "adept",
    "option_d": "precocious",
    "option_e": null,
    "correct_answer": "adept",
    "explanation_original": "The sentence indicates that the whale migrat[es] thousands of miles each year without a compass, so logically the whale is an \"excellent\" or \"exceptional\" navigator. \"Docile\" (tame) and \"advantageous\" (bringing advantages) do not make sense. Someone who is \"precocious\" (pre-CO-cious, not pre-cious!) acquires or demonstrates an ability earlier than usual, but there is no information in the sentence consistent with that specific definition. Only \"adept\" (highly skilled) is both positive and makes sense in context, so (C) is correct.",
    [cite_start]"explanation_ai_enhanced": "The text describes the whale's impressive navigational ability, highlighting that it migrates 'thousands of miles each year without a compass' and arrives 'in precisely the same spot.' [cite: 708] This indicates a high level of skill. [cite_start]The word 'adept' means very skilled or proficient at something, which is a perfect descriptor for the whale's abilities as a navigator. [cite: 871]\n\nWhy A, B, and D are wrong: 'Docile' means tame or submissive, which is unrelated to navigational skill. 'Advantageous' means beneficial, which describes a situation, not a skill level. [cite_start]'Precocious' means having developed certain abilities at an earlier age than usual; the text describes the whale's current skill, not the age at which it was acquired. [cite: 871]",
    "feedback_a": "'Docile' means tame, which has no connection to the whale's skill as a navigator.",
    "feedback_b": "'Advantageous' means beneficial, which describes a condition or outcome, not a level of skill.",
    "feedback_c": "Correct. [cite_start]'Adept' means highly skilled, which accurately describes a whale that can navigate thousands of miles with precision. [cite: 871]",
    [cite_start]"feedback_d": "'Precocious' refers to developing skills early, but the sentence focuses on the whale's current high level of ability, not when it was learned. [cite: 871]",
    [cite_start]"passage_content": "The whale is a remarkably ______ navigator, migrating thousands of miles each year without a compass and always arriving in precisely the same spot. [cite: 708]",
    "question_stem": "The whale is a remarkably ______ navigator, migrating thousands of miles each year without a compass and always arriving in precisely the same spot."
  },
  {
    "question_id": "EOC-R-C2-15",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 2 - Vocabulary in Context -30-61 - Copy.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C2",
    "question_number": 15,
    "question_type": "multiple_choice",
    "option_a": "defended",
    "option_b": "exerted",
    "option_c": "restrained",
    "option_d": "thwarted",
    "option_e": null,
    "correct_answer": "exerted",
    "explanation_original": "If Constantinople was one of the...most influential cities in the world, then it \"had\" or \"possessed\" a powerful cultural pull and dominated economic life throughout the Mediterranean. \"Defended\" does not have the required connotation because the sentence says nothing about Constantinople being attacked. \"Restrained\" (held back) and \"thwarted\" (prevented) are both negative and do not make sense. Only \"exerted\" fits: something that \"exerts a pull\" brings force or power. (B) is thus correct.",
    [cite_start]"explanation_ai_enhanced": "The text establishes that Constantinople was one of the 'most influential cities in the world' and 'dominated economic life.' [cite: 709, 710] It follows that the city must have actively used or put forth its influence. The phrase 'a powerful cultural pull' describes this influence. The verb 'exerted' means to apply or bring to bear a force, influence, or quality. [cite_start]To 'exert a pull' is a standard collocation that means to use one's power or influence. [cite: 875][cite_start]\n\nWhy A, C, and D are wrong: 'Defended' is illogical as there is no mention of an attack. [cite: 873] [cite_start]'Restrained' (held back) and 'thwarted' (prevented) are negative verbs that mean the opposite of what an influential and dominant city would do with its cultural pull. [cite: 874]",
    [cite_start]"feedback_a": "'Defended' does not fit the context, as the sentence does not mention any threat or attack. [cite: 873]",
    "feedback_b": "Correct. [cite_start]To 'exert a pull' means to apply force or influence, which is consistent with Constantinople being an 'influential' and 'dominant' city. [cite: 875]",
    [cite_start]"feedback_c": "'Restrained' means held back, which is the opposite of what an influential city would do. [cite: 874]",
    [cite_start]"feedback_d": "'Thwarted' means prevented, which is also the opposite of the required meaning. [cite: 874]",
    "passage_content": "At its peak, roughly corresponding to the Middle Ages, Constantinople was one of the largest and most influential cities in the world. [cite_start]It ______ a powerful cultural pull and dominated economic life throughout the Mediterranean basin. [cite: 709, 710]",
    "question_stem": "It ______ a powerful cultural pull and dominated economic life throughout the Mediterranean basin."
  },
  {
    "question_id": "EOC-R-C2-16",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 2 - Vocabulary in Context -30-61 - Copy.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C2",
    "question_number": 16,
    "question_type": "multiple_choice",
    "option_a": "purify",
    "option_b": "filter",
    "option_c": "improve",
    "option_d": "explain",
    "option_e": null,
    "correct_answer": "improve",
    "explanation_original": "If [n]euroscientists and humans are... joining forces, then logically they might \"improve\" our understanding of narrative's role in human cognition. (C) is a direct match. \"Purify\" and \"filter\" are words commonly associated with \"refine,\" but they do not fit the definition indicated by the passage, so (A) and (B) can be elimianted. Be careful with (D): neuroscientists and humanists want to \"explain\" the role of narrative in cognition, not our understanding of that role. (D) can thus be eliminated as well.",
    [cite_start]"explanation_ai_enhanced": "The text suggests a collaboration between neuroscientists and humanists by 'joining forces.' [cite: 782] The purpose of this collaboration is to 'vastly refine our understanding' of narrative. In this context, 'refine' means to make small changes to something in order to improve it. [cite_start]The collaboration would enhance or make their collective understanding better. [cite: 876][cite_start]\n\nWhy A, B, and D are wrong: 'Purify' and 'filter' are literal meanings of refine (e.g., refining oil), but they do not fit the abstract context of 'understanding.' [cite: 877] [cite_start]'Explain' is close, but the goal is to improve the understanding they already have, not simply to explain it. [cite: 878]",
    [cite_start]"feedback_a": "This is a literal meaning of 'refine' that does not apply to the abstract concept of 'understanding.' [cite: 877]",
    [cite_start]"feedback_b": "This is a literal meaning of 'refine' that does not apply to the abstract concept of 'understanding.' [cite: 877]",
    "feedback_c": "Correct. [cite_start]In this context, 'refine' means to 'improve' or make more precise, which is what joining forces would do for the researchers' understanding. [cite: 876]",
    [cite_start]"feedback_d": "The goal is not to 'explain' their understanding, but to make that understanding better or more precise through collaboration. [cite: 878]",
    [cite_start]"passage_content": "Neuroscientists and humanists are tackling similar questions—by joining forces, they might vastly refine our understanding of the role that narrative plays in human cognition, for example, or explore with empirical precision the power of literature to represent consciousness. [cite: 782]",
    "question_stem": "As used in the text, what does \"refine\" mean?"
  },
  {
    "question_id": "EOC-R-C2-17",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 2 - Vocabulary in Context -30-61 - Copy.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C2",
    "question_number": 17,
    "question_type": "multiple_choice",
    "option_a": "confused",
    "option_b": "influenced",
    "option_c": "deceived",
    "option_d": "puzzled",
    "option_e": null,
    "correct_answer": "influenced",
    "explanation_original": "To determine the meaning of the underlined word, back up and read the sentence from the beginning. If some researchers have cautioned against relying too heavily on genetic factors, that is logically because estimates of an individual's chance of developing a particular malady (illness) are \"affected\" by environmental factors. \"Confused\" is the literal definition of confounded, but this word does not make sense at all in context. \"Deceived\" and \"puzzled\" likewise do not make sense. Only \"influenced\" means something like \"affected\" and fits in context: if people's chances of developing a particular are influenced by their environment, then genetic factors should not be given too much weight. (B) is thus correct.",
    [cite_start]"explanation_ai_enhanced": "The text presents an argument against 'relying too heavily on genetic factors' for predicting disease. [cite: 785] [cite_start]The reason is that estimates of disease risk are 'more confounded by environmental factors than is usually recognized.' [cite: 785] This means that environmental factors affect or have an impact on the estimates, making genetics an incomplete picture. [cite_start]The word 'influenced' best captures this idea of being affected or altered by an outside factor. [cite: 882][cite_start]\n\nWhy A, C, and D are wrong: 'Confused,' 'deceived,' and 'puzzled' are all possible meanings of 'confounded,' but they describe a state of mind. [cite: 881, 882] The sentence is not saying that the estimates are mentally confused, but that they are complicated or affected by environmental factors. [cite_start]'Influenced' is the only choice that fits this scientific context. [cite: 882]",
    "feedback_a": "This is a common meaning of 'confounded,' but it refers to a mental state. [cite_start]The estimates themselves are not confused; they are affected by other factors. [cite: 881]",
    "feedback_b": "Correct. [cite_start]In this context, 'confounded' means that the estimates are complicated and 'influenced' by environmental factors, making them less reliable if based only on genetics. [cite: 882]",
    "feedback_c": "'Deceived' means tricked, which does not make sense in the context of disease risk estimates.",
    "feedback_d": "'Puzzled' refers to a state of confusion, which is not what is happening to the risk estimates themselves.",
    [cite_start]"passage_content": "However, some researchers have cautioned against relying too heavily on genetic factors, arguing that estimates of an individual's chances of developing a particular malady are more confounded by environmental factors than is usually recognized. [cite: 785]",
    "question_stem": "As used in the text, what does \"confounded\" mean?"
  },
  {
    "question_id": "EOC-R-C2-18",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 2 - Vocabulary in Context -30-61 - Copy.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C2",
    "question_number": 18,
    "question_type": "multiple_choice",
    "option_a": "elects",
    "option_b": "requires",
    "option_c": "controls",
    "option_d": "suppresses",
    "option_e": null,
    "correct_answer": "controls",
    "explanation_original": "The passage is discussing the part of the brain that contagious yawning along with empathy and social-know how. The body's abilities are controlled by the brain, so in this context, governs must mean \"controls.\" (C) is thus correct. \"Elect\" is a word that is often associated with governing, but in the context of the brain, it does not make sense. That eliminates (A). \"Requires\" does not mean \"controls,\" so (B) can be eliminated as well. \"Suppresses\" (prevents) is exactly the opposite of the required meaning. The passage states that catching a yawn is linked to our ability to empathize, so all those skills must be activated together. That eliminates (D).",
    "explanation_ai_enhanced": "The text describes a specific part of the brain that is activated during contagious yawning. [cite_start]This same part of the brain also 'governs empathy and social know-how.' [cite: 788] In a biological or systemic context, to 'govern' means to control, regulate, or direct the functioning of something. [cite_start]Therefore, this part of the brain 'controls' empathy and social skills. [cite: 884][cite_start]\n\nWhy A, B, and D are wrong: 'Elects' refers to political governing and makes no sense in a biological context. [cite: 885] 'Requires' does not mean control. [cite_start]'Suppresses' means to prevent or inhibit, which is the opposite of the brain's function of enabling or managing these skills. [cite: 887]",
    [cite_start]"feedback_a": "'Elects' relates to political processes and is not appropriate for a biological context. [cite: 885]",
    "feedback_b": "'Requires' is not a synonym for 'governs'; the brain part enables these functions, it doesn't require them.",
    "feedback_c": "Correct. [cite_start]In a biological context, 'govern' means to 'control' or regulate the function of a system, which is what this part of the brain does for empathy. [cite: 884]",
    "feedback_d": "'Suppresses' means to prevent, which is the opposite of what the brain part does. [cite_start]It activates or manages empathy. [cite: 887]",
    "passage_content": "And some studies have shown that humans with more fine-tuned social skills are more likely to catch a yawn. [cite_start]3 As used in the text, what does \"governs\" mean? elects requires controls suppresses For instance, contagious yawning activates the same part of the brain that governs empathy and social know-how. [cite: 788, 789]",
    "question_stem": "As used in the text, what does \"governs\" mean?"
  },
  {
    "question_id": "EOC-R-C2-19",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 2 - Vocabulary in Context -30-61 - Copy.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C2",
    "question_number": 19,
    "question_type": "multiple_choice",
    "option_a": "acquire",
    "option_b": "gather",
    "option_c": "attain",
    "option_d": "observe",
    "option_e": null,
    "correct_answer": "observe",
    "explanation_original": "The beginning of the passage indicates that the boy was fully occupied with his own cogitations (that is, lost in his thoughts) during the ride, and the last sentence indicates that the narrator carefully watched the boy as he inspected his new surroundings. Given that context, catch must logically mean something like \"see\" (countenance means \"face\"). The best fit for this definition is \"observe\"— a the sentence is essentially saying that the narrator wanted to see how the boy would react. (A) does not fit because it does not make sense to say that someone \"acquired\" another person's impressions. (B) does not fit because it is illogical to say that a person \"gathered\" (collected) impressions in someone's face. (C) likewise does not make any sense because a person must \"attain\" (achieve) their own facial reaction. (D) is thus correct.",
    [cite_start]"explanation_ai_enhanced": "In the text, the narrator says, 'I watched to catch his impressions in his countenance.' [cite: 795] The narrator is looking at the boy's face ('countenance') to see or discern his reaction to the new home. In this context, 'to catch' means to perceive, notice, or 'observe.' [cite_start]The narrator is trying to see the boy's feelings as they appear on his face. [cite: 891]\n\nWhy A, B, and C are wrong: 'Acquire,' 'gather,' and 'attain' do not fit the context of perceiving a facial expression. One cannot 'acquire' or 'gather' impressions from someone else's face in a literal sense. 'Attain' means to achieve, which is also illogical in this context. [cite_start]'Observe' is the most fitting synonym for watching to see a reaction. [cite: 892, 893, 894]",
    [cite_start]"feedback_a": "It is not logical to say one 'acquires' another person's impressions by looking at their face. [cite: 892]",
    "feedback_b": "One cannot 'gather' impressions from a face in the way one gathers objects. [cite_start]This choice is illogical. [cite: 893]",
    [cite_start]"feedback_c": "'Attain' means to achieve or reach, which does not fit the context of seeing someone's reaction. [cite: 894]",
    "feedback_d": "Correct. [cite_start]The narrator 'watched' the boy's face to 'catch,' or 'observe,' his reaction to the new surroundings. [cite: 891]",
    "passage_content": "The boy was fully occupied with his own cogitations for the remainder of the ride, till we halted before the farmhouse garden-gate. I watched to catch his impressions in his countenance. [cite_start]He surveyed the carved front and low-browed lattices, the straggling gooseberry-bushes and crooked firs, with solemn intentness, and then shook his head: his private feelings entirely disapproved of the exterior of his new abode. [cite: 794, 795]",
    "question_stem": "As used in the text, what does \"catch\" mean?"
  },
  {
    "question_id": "EOC-R-C2-20",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 2 - Vocabulary in Context -30-61 - Copy.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C2",
    "question_number": 20,
    "question_type": "multiple_choice",
    "option_a": "return to",
    "option_b": "pick up",
    "option_c": "plea for",
    "option_d": "assert",
    "option_e": null,
    "correct_answer": "return to",
    "explanation_original": "Although you are given a fairly lengthy excerpt from this poem, the key phrase appears in the same sentence as the underlined word. Dickinson indicates that the whirling suns [s]hall...claim the haven of the fiery darkness from whence they came (from which they came). In other words, she is saying that the suns will \"return to\" the darkness that they emerged from. (A) is thus correct. Neither \"pick up\" nor \"plea for\" is consistent with this meaning, so (B) and (C) can be eliminated. Although \"assert\" is a common meaning of claim, it is being used in a very different sense here, so (D) does not fit either.",
    "explanation_ai_enhanced": "The poem describes a cyclical process for the suns. [cite_start]They 'blaze and then decay' and then 'claim / The haven of the darkness whence they came.' [cite: 799] The phrase 'whence they came' means 'from where they came.' So, the suns are going back to the darkness that was their origin. [cite_start]In this poetic context, to 'claim' this haven means to re-enter or 'return to' it. [cite: 897, 898][cite_start]\n\nWhy B, C, and D are wrong: 'Pick up' and 'plea for' are inconsistent with the meaning of going back to a place of origin. [cite: 899] [cite_start]'Assert' is a common meaning of 'claim' (e.g., to assert a right), but it doesn't fit the context of movement and return described in the poem. [cite: 900]",
    "feedback_a": "Correct. [cite_start]The suns are described as going back to the darkness 'whence they came,' so to 'claim' that haven is to 'return to' it. [cite: 898]",
    "feedback_b": "'Pick up' does not fit the poetic context of returning to a place of origin.",
    "feedback_c": "'Plea for' means to beg for, which is inconsistent with the cyclical action described.",
    [cite_start]"feedback_d": "This is a common definition of 'claim,' but it does not fit this specific context, which describes a physical return to a place. [cite: 900]",
    [cite_start]"passage_content": "The following text is from Emily Dickinson's 1896 poem \"Beclouded.\" \n\nEternities before the first-born day,\nOr ere the first sun fledged his wings of flame,\nCalm Night, the everlasting and the same,\nA brooding mother over chaos lay.\nAnd whirling suns shall blaze and then decay,\nShall run their fiery courses and then claim\nThe haven of the darkness whence they came;\nBack to Nirvanic peace shall grope their way. [cite: 797, 798, 799, 800]",
    "question_stem": "As used in the text, what does \"claim\" mean?"
  },
  {
    "question_id": "EOC-R-C2-21",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 2 - Vocabulary in Context -30-61 - Copy.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C2",
    "question_number": 21,
    "question_type": "multiple_choice",
    "option_a": "held down",
    "option_b": "engaged with",
    "option_c": "fastened to",
    "option_d": "associated with",
    "option_e": null,
    "correct_answer": "associated with",
    "explanation_original": "The passage indicates that it is hard to imagine [O'Keeffe] anywhere but the desert, so logically, she must be strongly \"identified with\" or \"associated with\" the American Southwest. (D) is a direct match for this meaning, so it is correct. \"Held down\" and \"fastened to\" do not make any sense in context, so (A) and (C) can be eliminated. O'Keeffe may have been \"engaged with\" the American Southwest in her paintings; however, this phrase does not fit the definition indicated by the passage.",
    [cite_start]"explanation_ai_enhanced": "The text states that Georgia O'Keeffe 'is so closely tied to the American Southwest that it is hard to imagine her anywhere but the desert.' [cite: 800] This means that in people's minds, her identity as an artist is strongly linked to that region. 'Associated with' means closely connected or identified with. [cite_start]This choice perfectly captures the non-literal connection between the artist and the location. [cite: 901][cite_start]\n\nWhy A, B, and C are wrong: 'Held down' and 'fastened to' suggest a literal, physical restraint, which is not the intended meaning. [cite: 903] [cite_start]While O'Keeffe was 'engaged with' the Southwest through her work, 'associated with' better captures the idea of how she is perceived by the public, which is the focus of the phrase 'it is hard to imagine her anywhere else.' [cite: 904, 905]",
    [cite_start]"feedback_a": "This implies a literal physical connection, which is not the intended meaning here. [cite: 903]",
    [cite_start]"feedback_b": "While true that she was 'engaged with' the Southwest, 'associated with' better reflects the idea of her public identity being linked to the place. [cite: 904, 905]",
    [cite_start]"feedback_c": "This implies a literal physical connection, which is not the intended meaning. [cite: 903]",
    "feedback_d": "Correct. [cite_start]'Tied to' is used figuratively to mean that O'Keeffe is strongly 'associated with' the Southwest in the public imagination. [cite: 901]",
    "passage_content": "As a painter, Georgia O'Keeffe is so closely tied to the American Southwest that it is hard to imagine her anywhere but the desert. In 1939, however, she accepted a commission to travel to Hawaii and paint scenes for a campaign promoting pineapple juice. [cite_start]Although serious artists did not normally take on commercial work, O'Keeffe was won over by images of palm trees and sandy white beaches. [cite: 800, 801, 802]",
    "question_stem": "As used in the text, what does \"tied to\" mean?"
  }
]
