[
  {
    "question_id": "EOC-R-C9-1",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 9 - Graphs & Charts - 146-159.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C9",
    "question_number": 1,
    "question_type": "multiple_choice",
    "image_url": "EOC-R-C9-1_image.png",
    "passage_content": "A student studying the presence of white-nose syndrome, a disease that has decimated bat populations across North America since 2007, examined data about the number of bats in a protected area. Because bats live in the dark and their cries are inaudible to people, biologists must use acoustic detectors to record their sounds and then analyze them to identify the species present in a given location. Observing that the highest number of cries came from big brown bats (Eptesicus fuscus), the student concluded that brown bat species were not affected by the disease.",
    "question_stem": "Which statement best describes data from the graph that would undermine the student's conclusion?",
    "option_a": "No bat species emitted more than 10 cries on average per night.",
    "option_b": "The number of cries from little brown bats was among the lowest of any species.",
    "option_c": "More cries were recorded for tri-colored bats than for hoary bats.",
    "option_d": "Eastern red bats were more vocally active than big brown bats.",
    "correct_answer": "The number of cries from little brown bats was among the lowest of any species.",
    "explanation_original": "What is the student's conclusion? That brown bat species were not affected by [white-nose syndrome] because the highest average number of cries recorded came from big brown bats. If you look at the graph, you can see that there are actually two brown bat species listed, and the number of cries for the other species (little brown bat) is at the very low end—a finding that would imply some brown bats are in fact affected. That is what (B) says, so it is correct. All of the other answers are off-topic.",
    "explanation_ai_enhanced": "The student's conclusion is a broad generalization about 'brown bat species' (plural) based only on the data for 'big brown bats.' To undermine this generalization, one must show that it doesn't apply to all brown bat species. The graph includes another species, the 'little brown bat,' which has one of the lowest numbers of cries (around 2.5). This finding contradicts the idea that all brown bat species are unaffected.",
    "feedback_a": "This is an inaccurate reading of the graph; the Big Brown Bat has an average of 10 cries.",
    "feedback_b": "This is the correct answer. The low number of cries from the *other* brown bat species undermines the student's broad conclusion about all brown bats.",
    "feedback_c": "This is a true statement based on the graph, but it is irrelevant to the student's conclusion about brown bats.",
    "feedback_d": "This is a false statement according to the graph; big brown bats were more vocally active than Eastern red bats."
  },
  {
    "question_id": "EOC-R-C9-2",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 9 - Graphs & Charts - 146-159.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C9",
    "question_number": 2,
    "question_type": "multiple_choice",
    "image_url": "EOC-R-C9-2_image.png",
    "passage_content": "El Niño is a climate pattern in which water in the Pacific Ocean near the equator becomes hotter than usual, affecting the atmosphere and weather around the world. Although El Niño climate conditions are unpredictable, they typically occur every few years and can change the weather in the United States, particularly in the southern states and in California. Climatologists have found that although El Niño years do not bring heavy rains every month, the difference in rainfall during the winter in El Niño years can be much greater than the difference during other seasons. Los Angeles, for example, receives around 15mm of rain on in May on average and during El Niño years, whereas",
    "question_stem": "Which choice uses data from the graph to logically complete the text?",
    "option_a": "5mm more rain than average falls in October when El Niño is present.",
    "option_b": "over 100 mm of rain falls in January during El Niño years.",
    "option_c": "the amount of rainfall in August and September is lower than average during El Niño years.",
    "option_d": "the amount of rainfall in February during El Niño years is 100 mm higher than average.",
    "correct_answer": "the amount of rainfall in February during El Niño years is 100 mm higher than average.",
    "explanation_original": "The last sentence indicates that average and El Niño rainfall are the same in May (in a season other than winter), and the word whereas before the blank indicates that the remainder of the sentence must describe the opposite—a winter month in which the difference between average and El Niño rainfall is large. The correct answer must therefore include a comparison between El Niño rainfall and average rainfall. (B) does not include a comparison, so this answer can be eliminated immediately. (A) does mention a month in which El Niño is associated with more rain than average, but 5mm is a very small amount, and the correct answer must involve an amount that is much greater. (C) does not fit because the correct answer must involve months in which El Niño rainfall is higher... (D) correctly cites an example of a winter month (February) in which El Niño is associated with rainfall that is much higher than the average.",
    "explanation_ai_enhanced": "The text sets up a contrast with 'whereas'. It first gives an example of a non-winter month (May) with similar rainfall, then needs an example of a winter month (Dec, Jan, Feb) where the difference is 'much greater'. In February, El Niño rainfall is approximately 160 mm and average rainfall is approximately 60 mm, a difference of about 100 mm. This large difference in a winter month perfectly completes the text's logic.",
    "feedback_a": "The difference in October is small, which does not fit the text's claim that the winter difference is 'much greater'.",
    "feedback_b": "While true, this statement doesn't provide the necessary comparison between El Niño and average rainfall that the word 'whereas' requires.",
    "feedback_c": "The claim is about winter months having a greater difference, not other seasons having lower rainfall.",
    "feedback_d": "This is the correct answer. It identifies a winter month with a large difference in rainfall, completing the contrast set up by the text."
  },
  {
    "question_id": "EOC-R-C9-3",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 9 - Graphs & Charts - 146-159.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C9",
    "question_number": 3,
    "question_type": "multiple_choice",
    "image_url": "EOC-R-C9-3_image.png",
    "passage_content": "Plants use photosynthesis to create energy from visible light from the sun. In addition to visible light, however, sunlight contains ultraviolet (UV) light. Researchers at the University of Hokkaido wondered whether it would be possible to provide plants with additional visible light by employing a wavelength converting material (WCM) capable of transforming UV light into red light. They created a thin-film WCM coating and applied it to clear plastic sheets, which were placed next to Swiss chard plants. In winter, the plants with the WCM films were significantly taller and contained more biomass after 63 days as compared to the control group. The researchers concluded that this accelerated growth was caused by the increased supply of red light provided by the WCM films.",
    "question_stem": "Which choice uses data from the graph to support the researchers' conclusion?",
    "option_a": "Light that is less than 400 nanometers long had a much lower level of intensity than light that is more than 450 nanometers long.",
    "option_b": "Light ranging from 500 to 550 nanometers had the highest level of intensity.",
    "option_c": "The intensity of light waves more than 600 nanometers long that passed through the films increased to nearly peak levels.",
    "option_d": "UV absorption declined steeply in light waves that are less than 450 nanometers.",
    "correct_answer": "The intensity of light waves more than 600 nanometers long that passed through the films increased to nearly peak levels.",
    "explanation_original": "What is the researchers' conclusion? You'll find it in the last sentence: the accelerated growth of the plants with WCM films was caused by the increased supply of red light. The correct answer must support the idea that the films increased the red-light supply. The fact that the light that passed through the films increased to 'peak levels' of intensity in the 'red' area of the graph directly illustrates the idea that the films caused the plants to receive more red light. (C) is thus correct. The other answers include information about light wavelength, intensity, and absorption but do not explicitly mention the effect of the films.",
    "explanation_ai_enhanced": "The researchers' conclusion is that the WCM films helped plants grow by increasing the supply of red light. We need to find data in the graph that shows this increase. The graph indicates that red light has a wavelength of over 600 nanometers. The upward arrow labeled 'with WCM films' in this red light section shows that the films dramatically increased the intensity of red light. Option C accurately describes this part of the graph.",
    "feedback_a": "This statement might be true from the graph, but it doesn't mention the WCM films and is therefore irrelevant to the researchers' conclusion.",
    "feedback_b": "This is true according to the graph, but it refers to the peak intensity of natural light, not the effect of the WCM films on red light.",
    "feedback_c": "This is the correct answer. It directly describes the graph's depiction of the WCM films increasing the intensity of red light (wavelengths > 600 nm).",
    "feedback_d": "This describes UV absorption but does not connect the WCM films to an increase in red light."
  },
  {
    "question_id": "EOC-R-C9-4",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 9 - Graphs & Charts - 146-159.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C9",
    "question_number": 4,
    "question_type": "multiple_choice",
    "image_url": "EOC-R-C9-4_image.png",
    "passage_content": "Despite the sensationalist claims about the effects of video games on children's development that regularly appear in the media, a growing body of research purports to demonstrate that game players outperform non-gamers on a range of cognitive measures... However, these studies employ a variety of methodologies, criteria, and types of participants. Marc Palaus and colleagues at Oberta University in Spain conducted a review of 116 studies... While they concluded that it is possible to establish links between video games and skills..., they also observed that the lack of standardization could contribute to inconsistencies in the findings of similar studies.",
    "question_stem": "Which choice most effectively uses data from the graph to support the researchers' observation?",
    "option_a": "The studies run by Takeushi relied on larger sample sizes and involved younger participants than any of the other studies.",
    "option_b": "Few of the studies included participants under the age of 18.",
    "option_c": "Each study focused on participants in a particular age range and did not include members that were much older or younger.",
    "option_d": "The participants in the studies conducted by Erickson, Vo, and Kühn and Gallinat were all under the age of 30.",
    "correct_answer": "The studies run by Takeushi relied on larger sample sizes and involved younger participants than any of the other studies.",
    "explanation_original": "What is the researchers' observation? That the lack of standardization [among studies] could contribute to inconsistencies in the findings of similar studies. The correct answer must therefore mention a factor that varies from study to study and include a comparison of some type. The words Each study in (C) and all in (D) indicate that these answers are discussing factors that remain the same across studies, so both choices can be eliminated...Only (A) mentions an inconsistency that illustrates the researchers' observation: the studies run by one of the participants differed noticeably from the other studies in that they involved far more participants. In other words, it shows that the studies were not standardized.",
    "explanation_ai_enhanced": "The researchers' observation is about a 'lack of standardization' leading to 'inconsistencies' among studies. We need to find an example in the table that highlights this inconsistency. Option A points out that the Takeushi studies are different from the others in two ways: sample size (189 and 240 vs. much smaller numbers) and age of participants (children/adolescents vs. mostly adults). This is a perfect example of a lack of standardization.",
    "feedback_a": "This is the correct answer because it points out clear differences (inconsistencies) between the Takeushi studies and the others, supporting the 'lack of standardization' claim.",
    "feedback_b": "This is incorrect. The Zhang and Takeushi studies all focus on participants under 18.",
    "feedback_c": "This describes a similarity (each study has a narrow age range), not a lack of standardization *between* the studies.",
    "feedback_d": "This describes a similarity among three of the studies, not an inconsistency across the whole set."
  },
  {
    "question_id": "EOC-R-C9-5",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 9 - Graphs & Charts - 146-159.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C9",
    "question_number": 5,
    "question_type": "multiple_choice",
    "image_url": "EOC-R-C9-5_image.png",
    "passage_content": "Seals are among the few mammals other than humans that are capable of learning new types of vocalizations. ...In 2021, researchers... conducted a study in which they played a series of pre-recorded sounds for a group of harbor seal pups... They found that the baby seals were able to modify their vocalization patterns: overall, the pups lowered the fundamental frequency (F0) of their calls in response to increased noise. In some cases, the response was highly pronounced, with the same animal emitting vocalizations at much lower frequencies in high noise than in low noise.",
    "question_stem": "Which choice most effectively uses data from the table to support the researchers' finding?",
    "option_a": "Seal B emitted vocalizations of 330 Hz in low noise and 300 Hz in high noise.",
    "option_b": "The fundamental frequency of Seal A's vocalizations in high noise was 100 Hz lower than in low noise.",
    "option_c": "Whereas the fundamental frequency of Seal A's call was 125 Hz lower in high noise than in no noise, the frequency of Seal B's call dropped by less than 50 Hz.",
    "option_d": "In both low and high noise, the fundamental frequency of Seal E's call was around 150 Hz lower than it was without noise.",
    "correct_answer": "The fundamental frequency of Seal A's vocalizations in high noise was 100 Hz lower than in low noise.",
    "explanation_original": "What is the researchers' finding? It appears in the last sentence: the seal pups changed their vocalizations in response to the sounds, and in some cases, the same animal might produce vocalizations with much lower fundamental frequencies in high noise than in low noise. The correct answer must therefore focus on one animal only and indicate a large gap in fundamental frequency between low and high noise. (C) makes a comparison between two seals, so it can be eliminated automatically. Be careful with (A): it does compare the frequencies in low and high noise, but the gap is fairly small (30 Hz). (D) is likewise incorrect because the correct answer must cite a large difference in the responses to the two noise levels, and here it is very similar. Only (B) offers an example of a seal whose vocalizations showed a large gap (100 Hz) between low and high noise.",
    "explanation_ai_enhanced": "The researchers' key finding, highlighted at the end of the passage, is that *in some cases*, the drop in call frequency was 'highly pronounced' for the same animal when comparing 'high noise' to 'low noise'. We need to find the option that best illustrates this specific point. For Seal A, the call frequency in low noise is ~425 Hz, and in high noise, it is ~325 Hz. This is a drop of 100 Hz, which is a 'highly pronounced' difference.",
    "feedback_a": "This shows a drop of only 30 Hz for Seal B, which is not as 'highly pronounced' as the drop for Seal A.",
    "feedback_b": "This is the correct answer. A drop of 100 Hz for a single seal (Seal A) is a perfect example of the 'highly pronounced' response mentioned in the text.",
    "feedback_c": "This option compares two different seals (A and B), but the claim is about the response within the 'same animal'.",
    "feedback_d": "This option compares Seal E's response in low and high noise to the 'no noise' condition, but the specific claim is about the difference between 'low noise' and 'high noise'."
  }
]
