[
  {
    "question_id": "EOC-R-C8-1",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 8 - Supporting & Undermining -134-145.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C8",
    "question_number": 1,
    "question_type": "multiple_choice",
    "passage_content": "\"Gerarda\" is an 1895 poem by Eloise Bibb. In the poem, Bibb emphasizes the contrast between the way in which objects are depicted in Gerarda's paintings and their true appearance, writing.",
    "question_stem": "Which quotation from \"Gerarda\" effectively illustrates the claim?",
    "option_a": "But in her spiritual world she leaves / Her mind, her thoughts, her soul, her brain,",
    "option_b": "Her paintings hang upon the wall, / The power of genius stamps them all;",
    "option_c": "Now to-day o'er canvas bent, / She strives to place these visions sent",
    "option_d": "And thus her pictures plainly show, / Not nature's self but ideal glow.",
    "correct_answer": "And thus her pictures plainly show, / Not nature's self but ideal glow.",
    "explanation_original": "The question indicates that the correct answer must support the idea that Bibb \"emphasizes the contrast between appearance and reality.\" As you read through the answer choices, look for a word such as but or yet that will indicate a contrast: (A) and (D) both contain but, whereas (B) and (C) do not include this type of language and can be assumed to be incorrect. (A) does not fit because it does not mention Gerarda's paintings, whereas (D) both mentions her \"pictures\" and refers to \"not nature's self (= reality) but ideal glow (= appearance).\" (D) is thus correct.",
    "explanation_ai_enhanced": "The claim is that the poem highlights a contrast between reality ('true appearance') and the depiction in art. Option D directly illustrates this by stating the pictures show 'Not nature's self' (reality) 'but ideal glow' (the artistic depiction). This phrasing perfectly captures the claimed contrast.",
    "feedback_a": "This quotation discusses Gerarda's inner world but does not mention her paintings or the contrast with reality.",
    "feedback_b": "This quotation praises the paintings but does not contrast their depiction with reality.",
    "feedback_c": "This describes Gerarda's process of painting but not the content of the paintings in relation to reality.",
    "feedback_d": "This is the correct answer. It explicitly states a contrast between 'nature's self' (reality) and the 'ideal glow' (artistic appearance) in her pictures."
  },
  {
    "question_id": "EOC-R-C8-2",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 8 - Supporting & Undermining -134-145.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C8",
    "question_number": 2,
    "question_type": "multiple_choice",
    "passage_content": "\"Frederick Douglass\" is an 1895 poem by Paul Laurence Dunbar. In the poem, Dunbar praises Douglass for his honesty and refusal to be intimidated, writing",
    "question_stem": "Which quotation from \"Frederick Douglass\" effectively illustrates the claim?",
    "option_a": "No miser in the good he held was he,- / His kindness followed his horizon's rim",
    "option_b": "A hush is over all the teeming lists, / And there is pause, a breath-space in the strife;",
    "option_c": "And he was no soft-tongued apologist; / He spoke straightforward, fearlessly uncowed;",
    "option_d": "He was her champion thro' direful years, / And held her weal all other ends above.",
    "correct_answer": "And he was no soft-tongued apologist; / He spoke straightforward, fearlessly uncowed;",
    "explanation_original": "Start by defining the claim: Dunbar praises Douglass for his honesty and refusal to be intimidated. The correct answer must be positive and illustrate these qualities. (A) refers to \"kindness,\" but that is not quite a match, so this option can be eliminated. (B) is a relatively neutral description that does not involve the necessary criteria. Although (D) is positive, this answer is off-topic as well. (C) is correct because it indicates that Douglass felt no need to apologize, spoke in a \"straightforward\" manner, and was \"fearlessly uncowed\" (intimidated).",
    "explanation_ai_enhanced": "The claim specifies two qualities praised by Dunbar: 'honesty' and 'refusal to be intimidated.' The correct quotation must illustrate these. Option C states Douglass 'spoke straightforward' (honesty) and was 'fearlessly uncowed' (a refusal to be intimidated). This is a direct match for the claim.",
    "feedback_a": "This quotation illustrates Douglass's kindness and generosity, not his honesty or fearlessness.",
    "feedback_b": "This quotation describes a moment of silence and does not describe Douglass's character traits.",
    "feedback_c": "This is the correct answer. 'Spoke straightforward' matches honesty, and 'fearlessly uncowed' matches refusal to be intimidated.",
    "feedback_d": "This quotation describes Douglass as a champion for a cause, but not specifically his honesty or fearlessness in speech."
  },
  {
    "question_id": "EOC-R-C8-3",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 8 - Supporting & Undermining -134-145.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C8",
    "question_number": 3,
    "question_type": "multiple_choice",
    "passage_content": "\"Left-digit\" bias, in which people focus on the first digit of a number and ignore the last, is a well-documented phenomenon that explains why prices tend to end in \"9\". According to a recent study by researchers in California and Sweden, it also influences journalists' coverage of unemployment rates. Even when jobless levels and the amount of change in unemployment rates are similar in two regions, crossing a round number informs reporters' assessment of the story's newsworthiness-even when both figures fall within the same margin of error.",
    "question_stem": "Which finding, if true, would most directly support the researchers' finding?",
    "option_a": "The Bureau of Labor Statistics publishes a report of unemployment rates by state, rounding its statistics to the nearest decimal place.",
    "option_b": "The mention of high unemployment figures in a newspaper caused consumer spending to drop by almost 2.5% in one city.",
    "option_c": "A city newspaper ran several stories about joblessness when the unemployment rate reached 5% but quickly stopped coverage of the issue.",
    "option_d": "A newspaper published significantly fewer stories about local unemployment when the jobless rate was 3.9% than when it rose to 4.1%.",
    "correct_answer": "A newspaper published significantly fewer stories about local unemployment when the jobless rate was 3.9% than when it rose to 4.1%.",
    "explanation_original": "The rest of the passage is essentially dedicated to describing what they found: \"left-digit\" bias affects whether journalists cover unemployment rates, and employment figures that cross a round number (a number ending in zero) attract more attention than ones that do not. The correct answer must therefore provide an example of a situation in which coverage of a jobless rate increased when it crossed a round number. The only answer that meets this requirement is (D): the change from 3.9% to 4.1% unemployment was very small, but the jump over a round number correlated with greater coverage of the issue. (A) is completely off-topic, and (B) does not fit because the passage does not even mention consumer spending. (C) describes an increase in unemployment coverage when the jobless rate reached a round number (5%), but the last part of the answer (\"quickly stopped coverage\") does not fit.",
    "explanation_ai_enhanced": "The researchers' finding is that 'crossing a round number informs reporters' assessment of the story's newsworthiness.' This means a small change that crosses a whole number (like going from 3.9% to 4.1%) will generate more news than a similar small change that doesn't (like going from 4.1% to 4.3%). Option D provides a perfect example of this phenomenon: a small 0.2% increase from 3.9% to 4.1% (crossing the 4.0% threshold) led to significantly more news stories.",
    "feedback_a": "This describes how statistics are reported but does not provide evidence about how journalists cover the story.",
    "feedback_b": "This describes the effect of news coverage on consumers, not the factors that influence the coverage itself.",
    "feedback_c": "While this shows attention being paid to a round number (5%), it doesn't provide the comparison needed to support the claim about *crossing* a round number.",
    "feedback_d": "This is the correct answer. It shows that crossing the round number of 4% had a significant impact on news coverage, even though the rate change was small."
  },
  {
    "question_id": "EOC-R-C8-4",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 8 - Supporting & Undermining -134-145.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C8",
    "question_number": 4,
    "question_type": "multiple_choice",
    "passage_content": "One argument that is commonly cited to support the idea that birds lack a sense of smell is that some birds' olfactory bulbs are relatively small. As a result, many scientists concluded that these creatures gave up smell in favor of improved eyesight. This notion became so pervasive that it once was repeated to avian expert Danielle Whittaker as fact by a prominent neurobiologist.",
    "question_stem": "Which finding, if true, would most undermine the neurobiologist's statement?",
    "option_a": "An analysis of avian genomes revealed the presence of proteins that bind to odors and relay a signal to the brain.",
    "option_b": "The number of olfactory neurons is much smaller in birds than in most other animals.",
    "option_c": "The odors that birds depend on for food and social relationships are quickly dispersed in the wind.",
    "option_d": "Birds sometimes overlook strongly scented prey in favor of animals that are more visually striking.",
    "correct_answer": "An analysis of avian genomes revealed the presence of proteins that bind to odors and relay a signal to the brain.",
    "explanation_original": "What did the neurobiologist say? That these creatures (i.e., birds) gave up smell in favor of improved eyesight. This is an \"undermine\" question, so the correct answer must contradict that idea. Most logically, it will indicate that birds have both good eyesight and a sense of smell. The relationship between (A) and the claim in question may not be immediately obvious, but consider it carefully: if avian (bird) genomes suggest that birds are physiologically capable of perceiving odors, that would suggest they do in fact have a sense of smell. The presence of an unusually small number of olfactory neurons in birds would support rather than undermine the claim in question, so (B) can be eliminated. (C) and (D) have the same problem.",
    "explanation_ai_enhanced": "The neurobiologist's statement claims that birds 'gave up smell.' To undermine this, we need evidence suggesting that birds do have a functional sense of smell. Finding proteins in bird DNA that are specifically designed to 'bind to odors and relay a signal to the brain' would be direct biological evidence that birds are equipped to smell, thus contradicting the idea that they gave it up.",
    "feedback_a": "This is the correct answer. The presence of the biological machinery for smell would directly undermine the claim that birds gave up this sense.",
    "feedback_b": "This finding would *support* the neurobiologist's statement, suggesting that a reduced number of neurons corresponds to a weaker sense of smell.",
    "feedback_c": "This describes a challenge to using smell, which could be used to *support* the idea that birds might favor other senses.",
    "feedback_d": "This finding shows a preference for sight over smell in some situations, which would *support* the neurobiologist's statement."
  },
  {
    "question_id": "EOC-R-C8-5",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 8 - Supporting & Undermining -134-145.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C8",
    "question_number": 5,
    "question_type": "multiple_choice",
    "passage_content": "New research suggests that coffee could have a positive effect on cardiovascular health. Although caffeine is coffee's most well-known constituent, the beverage contains more than 100 biologically active components. In a study led by Jiyoung Kim, researchers at Seoul National University concluded that non-caffeinated compounds likely play a role in the positive relationship between coffee consumption and health.",
    "question_stem": "Which finding, if true, would most directly support the researchers' conclusion?",
    "option_a": "Whereas regular coffee contains from 70-140 mg of caffeine per cup, decaf contains approximately 0-7mg",
    "option_b": "Decaffeinated coffee causes cells to produce NQO1, an enzyme that has neuroprotective benefits.",
    "option_c": "Extracts from caffeinated coffee have been shown to aid weight loss more than a placebo.",
    "option_d": "People who drink several cups of coffee every day are less vulnerable to certain diseases.",
    "correct_answer": "Decaffeinated coffee causes cells to produce NQO1, an enzyme that has neuroprotective benefits.",
    "explanation_original": "What is the researchers' conclusion? That non-caffeinated compounds likely play a role in the positive relationship between coffee consumption and health. The correct answer must therefore be consistent with the idea that something other than caffeine is responsible for coffee's health benefits. (A) has no relationship to this argument... (C) is incorrect because it focuses on the health benefits of caffeinated rather than decaffeinated coffee, and (D) does not quite work because it does not indicate what type of coffee is involved. Only (B) works: if decaf causes the production of an enzyme with \"neuroprotective benefits\" (i.e., that protects the brain), then caffeine is presumably not the cause.",
    "explanation_ai_enhanced": "The researchers' specific conclusion is that 'non-caffeinated compounds' are responsible for coffee's health benefits. To support this, we need evidence that shows a health benefit from coffee that is independent of caffeine. A finding that *decaffeinated* coffee produces a beneficial enzyme directly proves that a non-caffeinated component is at work.",
    "feedback_a": "This provides factual information about caffeine levels but does not link non-caffeinated compounds to any health benefits.",
    "feedback_b": "This is the correct answer. It shows a direct health benefit ('neuroprotective benefits') from decaffeinated coffee, supporting the idea that non-caffeinated compounds are responsible.",
    "feedback_c": "This finding attributes a benefit to *caffeinated* coffee, which does not support the researchers' conclusion about non-caffeinated compounds.",
    "feedback_d": "This supports the general idea that coffee is healthy but does not help distinguish whether the benefit comes from caffeine or other compounds."
  },
  {
    "question_id": "EOC-R-C8-6",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 8 - Supporting & Undermining -134-145.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C8",
    "question_number": 6,
    "question_type": "multiple_choice",
    "passage_content": "Scientists have long known that self-pollination can inhibit plants' ability to adapt to environmental changes, but until recently they did not know exactly how or how quickly the changes occurred. A group of researchers at Washington State University set up a controlled greenhouse experiment in which a group of monkeyflower plants were isolated from the bumblebees that normally pollinate them. Initially, the plants produced few seeds, but as they adapted to the self-pollination process, their seed production increased dramatically. In addition, their flowers changed shape to facilitate the transfer of pollen. However, scientists expected that the plants would eventually become more vulnerable to shifts in their environment.",
    "question_stem": "Which finding, if true, would most directly support the scientists' expectation?",
    "option_a": "Some flowers also received pollen from nearby flowering plants, a process that is known as geitonogamy.",
    "option_b": "The plants' genetic variation decreased by 24% over nine generations, making them more susceptible to a variety of pathogens.",
    "option_c": "None of the plants contained the types of genetic defects that are typically found in the wild.",
    "option_d": "By eliminating the transfer of pollen grains, the plants were able to reduce the amount of pollen wasted by 60%.",
    "correct_answer": "The plants' genetic variation decreased by 24% over nine generations, making them more susceptible to a variety of pathogens.",
    "explanation_original": "What is the scientists' expectation? ...the scientists expected that although the self-pollinating plants appeared to be doing well, they would eventually develop a weakness that would make them more vulnerable to shifts in their environment. The correct answer must be consistent with that idea. (A) and (D) are off-topic and can be eliminated. (C) would weaken rather than support the expectation: plants without genetic defects would be less likely to become vulnerable to disease. (B) is correct because an almost 25% decrease in genetic diversity that left plants more \"susceptible\" (i.e., vulnerable) to diseases would be directly consistent with the researchers' expectations.",
    "explanation_ai_enhanced": "The scientists' expectation was that the self-pollinating plants would 'become more vulnerable to shifts in their environment.' We need a finding that demonstrates this increased vulnerability. A decrease in genetic variation is a well-known biological mechanism that makes a population less able to adapt to changes, such as new diseases. Therefore, a finding that genetic variation decreased and made the plants 'more susceptible' directly supports the expectation.",
    "feedback_a": "This is off-topic and discusses a different pollination process.",
    "feedback_b": "This is the correct answer. A decrease in genetic variation and increased susceptibility to pathogens is a direct example of becoming more vulnerable.",
    "feedback_c": "This finding would *undermine* the expectation, as it suggests the plants were healthier than expected.",
    "feedback_d": "This describes an adaptation or benefit of self-pollination, which contradicts the expectation of increased vulnerability."
  },
  {
    "question_id": "EOC-R-C8-7",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 8 - Supporting & Undermining -134-145.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C8",
    "question_number": 7,
    "question_type": "multiple_choice",
    "passage_content": "It was only when Alma Thomas turned away from figurative art and toward abstraction that she rose to acclaim as an artist. When the solidity of her line gave way to broken, vibrant colors, the beauty she had long seen emerged.",
    "question_stem": "Which choice, if true, would most effectively support the writer's claim?",
    "option_a": "Her painting Starry Night and the Astronauts (1972) includes a small kaleidoscope of red, orange, and yellow that suggests the spaceship Apollo 10.",
    "option_b": "Thomas was fascinated by the natural world, incorporating everything from the flowers in her garden to the stars in the night sky into her paintings.",
    "option_c": "Her Still Life with Vases and Flowers (1964), which contains realistic images, feels labored, whereas Lunar Surface (1970) glows with rich splashes of purple and blue.",
    "option_d": "Although Thomas's own works focused on nature, she believed that art could also evoke the energy of airplanes, cars, skyscrapers, and electric signals.",
    "correct_answer": "Her Still Life with Vases and Flowers (1964), which contains realistic images, feels labored, whereas Lunar Surface (1970) glows with rich splashes of purple and blue.",
    "explanation_original": "What is the writer's claim? That the beauty of Alma Thomas's work emerged when she moved away from figurative art and began to work abstractly. The correct answer must support or illustrate that idea. (A) mentions Thomas's use of color but does not indicate whether this painting was figurative or abstract. (B) is off-topic, focusing on the subject matter of Thomas's work rather than its style. (D) is incorrect for the same reason. Only (C) offers an explicit contrast between Thomas's \"labored\" early figurative work and \"glow[ing]\" abstract later work.",
    "explanation_ai_enhanced": "The writer's claim is that Alma Thomas's art became acclaimed and beautiful only when she moved from figurative to abstract art. The most effective support for this claim would be a direct comparison of a piece from each period that demonstrates this shift in quality. Option C provides this exact comparison, describing an early figurative work ('realistic images') as 'labored' while a later abstract work 'glows,' thus supporting the claim.",
    "feedback_a": "This describes an abstract painting but doesn't contrast it with her earlier figurative work to support the claim about her development.",
    "feedback_b": "This describes the subject matter of her work, not the artistic style (figurative vs. abstract) that the claim is about.",
    "feedback_c": "This is the correct answer. It provides a direct comparison between a 'labored' figurative piece and a 'glowing' abstract piece, supporting the claim.",
    "feedback_d": "This describes Thomas's beliefs about art but does not provide evidence about the quality of her own work in different styles."
  },
  {
    "question_id": "EOC-R-C8-8",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 8 - Supporting & Undermining -134-145.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C8",
    "question_number": 8,
    "question_type": "multiple_choice",
    "passage_content": "Middlemarch is an 1871 novel by George Elliot. In the story, a young woman named Dorothea Brooke becomes engaged to a scholar named Mr. Casaubon. In describing Dorothea's motives for marriage, Elliot emphasizes her belief that she and Mr. Causabon have a great deal in common.",
    "question_stem": "Which quotation from Middlemarch effectively illustrates the claim?",
    "option_a": "Dorothea by this time had looked deep into the ungauged reservoir of Mr. Casaubon's mind, seeing reflected there in vague labyrinthine extension every quality she herself brought;",
    "option_b": "If it had really occurred to Mr. Casaubon to think of Miss Brooke as a suitable wife for him, the reasons that might induce her to accept him were already planted in her mind.",
    "option_c": "His notes already made a formidable range of volumes, but the crowning task would be to condense these voluminous still-accumulating results and bring them to fit a little shelf.",
    "option_d": "But in this case Mr. Casaubon's confidence was not likely to be falsified, for Dorothea heard and retained what he said with the eager interest of a fresh young nature to which every variety in experience is an epoch.",
    "correct_answer": "Dorothea by this time had looked deep into the ungauged reservoir of Mr. Casaubon's mind, seeing reflected there in vague labyrinthine extension every quality she herself brought;",
    "explanation_original": "What is the claim? That Dorothea believes she and Mr. Casaubon have many things in common. The correct answer must therefore emphasize Dorothea's belief in their similarity. (A) is correct because it indicates that Dorothea sees \"every quality\" of her own reflected in Mr. Casaubon. In other words, she perceives him as very similar, if not downright identical, to her. (B) only indicates that Dorothea (\"Miss Brooke\") is already interested in marrying Mr. Casaubon-it says nothing about their similarities. (C) is off-topic, focusing on Mr. Casaubon and not mentioning Dorothea at all. (D) is incorrect as well because it only conveys the idea that Dorothea is extremely interested in what Mr. Casaubon has to say because of her youth; it does not explicitly mention that she views him as being similar to her.",
    "explanation_ai_enhanced": "The claim states that Dorothea believes she and Mr. Casaubon 'have a great deal in common.' The quotation that best illustrates this would show her perceiving this similarity. Option A states that when Dorothea looked into Mr. Casaubon's mind, she saw 'every quality she herself brought' reflected back. This is a direct and powerful illustration of her belief that they are very much alike.",
    "feedback_a": "This is the correct answer. It directly shows Dorothea perceiving her own qualities reflected in Mr. Casaubon, illustrating her belief that they are similar.",
    "feedback_b": "This quote explains that Dorothea already has reasons to accept him, but it does not specify that those reasons are based on their similarities.",
    "feedback_c": "This quote describes Mr. Casaubon's scholarly work and does not mention Dorothea or her beliefs about him.",
    "feedback_d": "This quote describes Dorothea's interest in what Mr. Casaubon says, but not her belief that they have a lot in common."
  }
]
