[
  {
    "question_id": "EOC-G-C4-1",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 4 - Joining & Separating Sentences - 61-73.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C4",
    "question_number": 1,
    "question_type": "multiple_choice",
    "passage_content": null,
    "question_stem": "Lake Superior is the largest freshwater lake in the world by surface area and the third largest by <u>volume, it</u> holds around 10% of the world's fresh surface water.",
    "option_a": "volume, it",
    "option_b": "volume; it",
    "option_c": "volume: it",
    "option_d": "volume. It",
    "correct_answer": "volume; it",
    "explanation_original": "Lake Superior is the largest freshwater lake in the world by surface area and the third largest by volume; it holds around 10% of the world's fresh surface water. Also acceptable: volume. It, volume: it",
    "explanation_ai_enhanced": "The original sentence contains a comma splice, an error where two independent clauses are joined by only a comma. To fix this, a stronger punctuation mark is needed. A semicolon correctly separates two closely related independent clauses. A period would also be correct, creating two separate sentences. A colon is also grammatically acceptable here, as the second clause explains the significance of the first.",
    "feedback_a": "This option creates a comma splice by incorrectly joining two complete sentences with just a comma.",
    "feedback_b": "This is a correct way to fix the comma splice, using a semicolon to connect two related independent clauses.",
    "feedback_c": "A colon is a correct option here as the second clause elaborates on the first, but the semicolon is also correct.",
    "feedback_d": "Using a period is a correct way to separate the two independent clauses, making this another valid answer."
  },
  {
    "question_id": "EOC-G-C4-2",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 4 - Joining & Separating Sentences - 61-73.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C4",
    "question_number": 2,
    "question_type": "multiple_choice",
    "passage_content": null,
    "question_stem": "Very early printed books left spaces for commentary, miniature illustrations and illuminated <u>initials; all</u> of which would have been added later by hand.",
    "option_a": "initials; all",
    "option_b": "initials, all",
    "option_c": "initials. All",
    "option_d": "initials all",
    "correct_answer": "initials, all",
    "explanation_original": "Very early printed books left spaces for commentary, miniature illustrations and illuminated initials, all of which would have been added later by hand.",
    "explanation_ai_enhanced": "The phrase 'all of which would have been added later by hand' is a non-essential clause that describes the previously listed items. Non-essential clauses must be separated from the main clause by a comma. The original use of a semicolon is incorrect because a semicolon is used to separate two independent clauses.",
    "feedback_a": "A semicolon is incorrect here because the phrase that follows it is a dependent (non-essential) clause, not an independent clause.",
    "feedback_b": "This is the correct choice. A comma properly separates the non-essential clause from the main part of the sentence.",
    "feedback_c": "Using a period would incorrectly break the sentence, leaving a fragment.",
    "feedback_d": "This option lacks the necessary punctuation, creating a run-on sentence."
  },
  {
    "question_id": "EOC-G-C4-3",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 4 - Joining & Separating Sentences - 61-73.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C4",
    "question_number": 3,
    "question_type": "multiple_choice",
    "passage_content": null,
    "question_stem": "CRISPR tools can be programmed to target and cut virtually any DNA <u>sequence, however, they</u> have been limited by the requirement that they first recognize a short sequence surrounding the targeted section.",
    "option_a": "sequence, however, they",
    "option_b": "sequence; however, they",
    "option_c": "sequence. However, they",
    "option_d": "sequence however they",
    "correct_answer": "sequence; however, they",
    "explanation_original": "CRISPR tools can be programmed to target and cut virtually any DNA sequence; however, they have been limited by the requirement that they first recognize a short sequence surrounding the targeted section. Also acceptable: sequence. However,",
    "explanation_ai_enhanced": "'However' is a conjunctive adverb used to connect two independent clauses. When used this way, it must be preceded by a semicolon or a period. The original sentence uses a comma, creating a comma splice. The correct punctuation is a semicolon before 'however' and a comma after it.",
    "feedback_a": "This option is a comma splice. A comma is not sufficient to join two independent clauses with 'however'.",
    "feedback_b": "This is correct. The semicolon properly separates the two independent clauses.",
    "feedback_c": "Using a period is also a correct way to punctuate this sentence, creating two distinct sentences.",
    "feedback_d": "This option is a run-on sentence as it lacks any punctuation before 'however'."
  },
  {
    "question_id": "EOC-G-C4-4",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 4 - Joining & Separating Sentences - 61-73.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C4",
    "question_number": 4,
    "question_type": "multiple_choice",
    "passage_content": null,
    "question_stem": "Ethnomusicologist Alan Lomax believed that remote places contained extraordinary pieces of <u>culture; he</u> traveled the globe in search of songs and stories.",
    "option_a": "culture; he",
    "option_b": "culture, he",
    "option_c": "culture. He",
    "option_d": "culture he",
    "correct_answer": "culture; he",
    "explanation_original": "Correct",
    "explanation_ai_enhanced": "The original sentence is grammatically correct. It consists of two independent clauses that are closely related in thought. Using a semicolon to join them is a perfectly acceptable and standard way to structure the sentence.",
    "feedback_a": "This is the correct answer. A semicolon can be used to join two closely related independent clauses.",
    "feedback_b": "This option creates a comma splice.",
    "feedback_c": "Using a period is also correct, but the original sentence with the semicolon is already correct.",
    "feedback_d": "This option creates a run-on sentence."
  },
  {
    "question_id": "EOC-G-C4-5",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 4 - Joining & Separating Sentences - 61-73.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C4",
    "question_number": 5,
    "question_type": "multiple_choice",
    "passage_content": null,
    "question_stem": "Introduced in 1678, the term 'conscious' acquired at least five definitions in fifty <u>years; and</u> its ambiguity has not faded in more recent times.",
    "option_a": "years; and",
    "option_b": "years, and",
    "option_c": "years. And",
    "option_d": "years and",
    "correct_answer": "years, and",
    "explanation_original": "Introduced in 1678, the term 'conscious' acquired at least five definitions in fifty years, and its ambiguity has not faded in more recent times.",
    "explanation_ai_enhanced": "When two independent clauses are joined by a FANBOYS conjunction (For, And, Nor, But, Or, Yet, So), a comma should be used before the conjunction. Using a semicolon before 'and' is grammatically incorrect in this context.",
    "feedback_a": "This is incorrect. A semicolon should not be used before a FANBOYS conjunction like 'and'.",
    "feedback_b": "This is the correct punctuation for joining two independent clauses with a FANBOYS conjunction.",
    "feedback_c": "While stylistically acceptable in some informal writing, starting a sentence with 'And' after a period is generally discouraged in formal, standard English.",
    "feedback_d": "This option lacks the necessary comma before the conjunction 'and', creating a run-on sentence."
  },
  {
    "question_id": "EOC-G-C4-6",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 4 - Joining & Separating Sentences - 61-73.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C4",
    "question_number": 6,
    "question_type": "multiple_choice",
    "passage_content": null,
    "question_stem": "Historically, the silk produced by silkworms has been used in fashion as a material for luxury <u>robes, today,</u> silk-based materials are more likely to be found in a doctor's office or operating room.",
    "option_a": "robes, today,",
    "option_b": "robes; today,",
    "option_c": "robes. Today,",
    "option_d": "robes: today,",
    "correct_answer": "robes. Today,",
    "explanation_original": "Historically, the silk produced by silkworms has been used in fashion as a material for luxury robes. Today, silk-based materials are more likely to be found in a doctor's office or operating room. Also acceptable: robes; today",
    "explanation_ai_enhanced": "The original sentence contains a comma splice by joining two independent clauses with only a comma. The first clause describes the historical use of silk, and the second clause describes its modern use. To correct this, these two complete sentences should be separated by a period or a semicolon. A period creates two clear, distinct sentences, which is a correct and standard way to fix the error.",
    "feedback_a": "This option is a comma splice, an incorrect way to join two independent clauses.",
    "feedback_b": "This is a correct way to punctuate the sentence, using a semicolon to join two closely related independent clauses.",
    "feedback_c": "This is the correct answer. A period correctly separates the two independent clauses into two distinct sentences.",
    "feedback_d": "A colon is used to introduce an explanation or list, which is not the relationship between these two clauses."
  },
  {
    "question_id": "EOC-G-C4-7",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 4 - Joining & Separating Sentences - 61-73.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C4",
    "question_number": 7,
    "question_type": "multiple_choice",
    "passage_content": null,
    "question_stem": "The Qing Dynasty attained the height of its power under the Qianlong <u>Emperor beginning in 1755, he</u> led Ten Great Campaigns that extended Qing control into Inner Asia and personally supervised a number of Confucian cultural projects.",
    "option_a": "Emperor beginning in 1755, he",
    "option_b": "Emperor. Beginning in 1755, he",
    "option_c": "Emperor; beginning in 1755, he",
    "option_d": "Emperor: beginning in 1755, he",
    "correct_answer": "Emperor. Beginning in 1755, he",
    "explanation_original": "The Qing Dynasty attained the height of its power under the Qianlong Emperor. Beginning in 1755, he led Ten Great Campaigns... Also acceptable: Emperor; beginning, Emperor: beginning",
    "explanation_ai_enhanced": "The original sentence is a comma splice, as it joins two independent clauses with only a comma. The first clause is 'The Qing Dynasty...in 1755,' and the second is 'he led Ten Great Campaigns...'. The phrase 'beginning in 1755' acts as an introductory phrase for the second clause. The correct way to fix this is to separate the two clauses with a period, a semicolon, or in this case, a colon could also work.",
    "feedback_a": "This option is a comma splice, which is grammatically incorrect.",
    "feedback_b": "This is the correct answer. Using a period correctly separates the two independent clauses.",
    "feedback_c": "This is also a correct way to fix the comma splice, using a semicolon to connect the two related clauses.",
    "feedback_d": "This is also a correct option, as a colon can introduce a clause that explains or elaborates on the previous one."
  },
  {
    "question_id": "EOC-G-C4-8",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 4 - Joining & Separating Sentences - 61-73.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C4",
    "question_number": 8,
    "question_type": "multiple_choice",
    "passage_content": null,
    "question_stem": "Interacting with animals is known to help people cope with <u>stress because the prefrontal cortex helps individuals regulate social and emotional interactions, neuroscientists</u> believe that it might be particularly relevant to their research.",
    "option_a": "stress. Because the prefrontal cortex helps individuals regulate social and emotional interactions, neuroscientists",
    "option_b": "stress because the prefrontal cortex helps individuals regulate social and emotional interactions, neuroscientists",
    "option_c": "stress, because the prefrontal cortex helps individuals regulate social and emotional interactions, neuroscientists",
    "option_d": "stress; because the prefrontal cortex helps individuals regulate social and emotional interactions, neuroscientists",
    "correct_answer": "stress. Because the prefrontal cortex helps individuals regulate social and emotional interactions, neuroscientists",
    "explanation_original": "Interacting with animals is known to help people cope with stress. Because the prefrontal cortex helps individuals regulate social and emotional interactions, neuroscientists believe that it might be particularly relevant to their research. Also acceptable: stress; because, stress: because",
    "explanation_ai_enhanced": "The sentence structure as written in the stem is a long, run-on sentence. It contains two main ideas that should be separated. The first is that interacting with animals helps with stress. The second, which starts with 'Because,' explains the neurological basis for this effect. Separating them with a period creates two clear, grammatically correct sentences. The clause starting with 'Because' becomes a proper introductory dependent clause for the second sentence.",
    "feedback_a": "This is the correct answer. It properly separates the two main ideas into distinct sentences, correcting the run-on.",
    "feedback_b": "This option creates a long and confusing run-on sentence.",
    "feedback_c": "This option attempts to fix the run-on with a comma, but it results in a comma splice.",
    "feedback_d": "A semicolon can join two independent clauses, but the clause starting with 'because' is dependent, making the semicolon incorrect here."
  },
  {
    "question_id": "EOC-G-C4-9",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 4 - Joining & Separating Sentences - 61-73.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C4",
    "question_number": 9,
    "question_type": "multiple_choice",
    "passage_content": null,
    "question_stem": "Bats can perceive and stalk their prey in complete <u>darkness: they</u> use a system of ultrasonic sounds to produce echoes that identify its location.",
    "option_a": "darkness: they",
    "option_b": "darkness, they",
    "option_c": "darkness. They",
    "option_d": "darkness; they",
    "correct_answer": "darkness: they",
    "explanation_original": "Correct",
    "explanation_ai_enhanced": "The original sentence is grammatically correct. It uses a colon to connect two independent clauses. This is appropriate because the second clause ('they use a system of ultrasonic sounds...') directly explains or elaborates on the first clause ('Bats can perceive and stalk their prey in complete darkness').",
    "feedback_a": "This is the correct answer. The colon is used effectively to introduce an explanation.",
    "feedback_b": "This option creates a comma splice.",
    "feedback_c": "Using a period is also grammatically correct, but the original sentence with the colon is already correct and creates a strong logical link.",
    "feedback_d": "Using a semicolon is also grammatically correct, but the colon is arguably more effective here at signaling an explanation."
  },
  {
    "question_id": "EOC-G-C4-10",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 4 - Joining & Separating Sentences - 61-73.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C4",
    "question_number": 10,
    "question_type": "multiple_choice",
    "passage_content": null,
    "question_stem": "As an undergraduate, Theodore Roosevelt began a systematic study of the United States Navy's role in the War of <u>1812, assisted by two uncles, he</u> studied original source materials and official records, ultimately publishing The Naval War of 1812 in 1882.",
    "option_a": "1812, assisted by two uncles, he",
    "option_b": "1812. Assisted by two uncles, he",
    "option_c": "1812; assisted by two uncles, he",
    "option_d": "1812: assisted by two uncles, he",
    "correct_answer": "1812. Assisted by two uncles, he",
    "explanation_original": "As an undergraduate, Theodore Roosevelt began a systematic study of the United States Navy's role in the War of 1812. Assisted by two uncles, he studied original source materials and official records, ultimately publishing The Naval War of 1812 in 1882. Also acceptable: 1812; assisted, 1812: assisted",
    "explanation_ai_enhanced": "The original sentence has a punctuation issue. 'Assisted by two uncles' is a participial phrase that modifies 'he' (Theodore Roosevelt). The structure '..., he studied...' creates a comma splice because it incorrectly links the main clause with the following clause. The clearest way to correct this is to make two separate sentences. The phrase 'Assisted by two uncles' then correctly acts as an introductory phrase for the second sentence.",
    "feedback_a": "This option is a comma splice.",
    "feedback_b": "This is the correct answer. Creating two sentences makes the relationship between the participial phrase and the subject clear and avoids a comma splice.",
    "feedback_c": "This is also a correct way to punctuate the sentence, using a semicolon to link the two related clauses.",
    "feedback_d": "This is also a correct option, as a colon can be used here to elaborate on Roosevelt's study."
  },
  {
    "question_id": "EOC-G-C4-11",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 4 - Joining & Separating Sentences - 61-73.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C4",
    "question_number": 11,
    "question_type": "multiple_choice",
    "passage_content": "A computer scientist who specializes in natural language processing, Yejin Choi has dedicated much of her recent research to commonsense knowledge and reasoning. She also works on developing artificial intelligence systems that can reason with common sense.",
    "question_stem": "A computer scientist who specializes in natural language processing, Yejin Choi has dedicated much of her recent research to commonsense knowledge and <u>reasoning. She also works</u> on developing artificial intelligence systems that can reason with common sense.",
    "option_a": "reasoning. She also works",
    "option_b": "reasoning, she also works",
    "option_c": "reasoning; also she works",
    "option_d": "reasoning she also works",
    "correct_answer": "reasoning. She also works",
    "explanation_original": "The text consists of two independent clauses. They can be separated by a period.",
    "explanation_ai_enhanced": "The text presents two complete sentences. The most standard way to separate them is with a period. Option A correctly does this, maintaining clarity and grammatical structure.",
    "feedback_a": "This is the correct choice, as it properly separates two independent clauses with a period.",
    "feedback_b": "This creates a comma splice, an error made by joining two independent clauses with only a comma.",
    "feedback_c": "While a semicolon can separate independent clauses, the word 'also' is not a conjunctive adverb that requires this punctuation, and the structure is awkward.",
    "feedback_d": "This creates a run-on sentence by joining two independent clauses with no punctuation."
  },
  {
    "question_id": "EOC-G-C4-12",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 4 - Joining & Separating Sentences - 61-73.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C4",
    "question_number": 12,
    "question_type": "multiple_choice",
    "passage_content": "Interacting with animals, particularly dogs, is known to help people cope with stress. Because the prefrontal cortex helps individuals regulate and process social and emotional interactions, neuroscientists believe that it might be particularly relevant to their research.",
    "question_stem": "Interacting with animals, particularly dogs, is known to help people cope with <u>stress. Because</u> the prefrontal cortex helps individuals regulate and process social and emotional interactions, neuroscientists believe that it might be particularly relevant to their research.",
    "option_a": "stress. Because",
    "option_b": "stress: because",
    "option_c": "stress because",
    "option_d": "stress because-",
    "correct_answer": "stress: because",
    "explanation_original": "The two parts of the text are independent clauses. A period is the correct punctuation to separate them.",
    "explanation_ai_enhanced": "The second part of the sentence explains why interacting with animals helps with stress. A colon is the perfect punctuation mark to introduce an explanation or elaboration. A period is also correct, but the colon provides a stronger logical link between the two ideas.",
    "feedback_a": "A period is a grammatically correct way to separate these two sentences.",
    "feedback_b": "This is the best answer. A colon is used effectively here to introduce an explanation for the statement in the first clause.",
    "feedback_c": "This option creates a run-on sentence by joining a main clause with a subordinate clause without proper punctuation.",
    "feedback_d": "A dash could be used similarly to a colon, but it's often seen as more informal. A colon is a more standard choice here."
  },
  {
    "question_id": "EOC-G-C4-13",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 4 - Joining & Separating Sentences - 61-73.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C4",
    "question_number": 13,
    "question_type": "multiple_choice",
    "passage_content": "Contemporary theatrical performers in the United States draw influences from across the globe. For example, the choreographer and dancer Savion Glover aims to restore the African roots of tap dance by eliminating hand gestures. Throughout his works, he focuses on the feet as the primary source of movement instead.",
    "question_stem": "For example, the choreographer and dancer Savion Glover aims to restore the African roots of tap dance by eliminating hand <u>gestures. Throughout his works,</u> he focuses on the feet as the primary source of movement instead.",
    "option_a": "gestures. Throughout his works,",
    "option_b": "gestures, throughout his works,",
    "option_c": "gestures; throughout his works,",
    "option_d": "gestures throughout, his works",
    "correct_answer": "gestures. Throughout his works,",
    "explanation_original": "The original text consists of two independent clauses. A period is needed to separate them correctly.",
    "explanation_ai_enhanced": "The text contains two distinct independent clauses. The first states Glover's aim, and the second explains his focus. Separating these two complete thoughts with a period is the most clear and grammatically sound option.",
    "feedback_a": "This is correct. A period properly separates the two complete sentences.",
    "feedback_b": "This choice results in a comma splice.",
    "feedback_c": "While a semicolon could work, a period is also correct and is often preferred for creating two distinct sentences.",
    "feedback_d": "This option contains misplaced commas and creates a confusing, ungrammatical sentence."
  },
  {
    "question_id": "EOC-G-C4-14",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 4 - Joining & Separating Sentences - 61-73.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C4",
    "question_number": 14,
    "question_type": "multiple_choice",
    "passage_content": "Food waste has been identified as the most prominent type of hospitality waste. Roughly 1.3 billion tons of food is lost or is thrown away annually—the equivalent of one third or even up to one half of all food intended for human consumption; therefore, food waste is a major environmental, social and economic issue.",
    "question_stem": "Roughly 1.3 billion tons of food is lost or is thrown away annually—the equivalent of one third or even up to one half of all food intended for human <u>consumption; therefore,</u> food waste is a major environmental, social and economic issue.",
    "option_a": "consumption, therefore,",
    "option_b": "consumption; therefore,",
    "option_c": "consumption, therefore",
    "option_d": "consumption therefore,",
    "correct_answer": "consumption; therefore,",
    "explanation_original": "'Therefore' is a conjunctive adverb used to join two independent clauses. It should be preceded by a semicolon and followed by a comma.",
    "explanation_ai_enhanced": "The sentence joins two independent clauses using the conjunctive adverb 'therefore'. The standard punctuation for this construction is a semicolon before the conjunctive adverb and a comma after it. This correctly links the cause (amount of food waste) to the effect (it being a major issue).",
    "feedback_a": "This option creates a comma splice.",
    "feedback_b": "This is the correct punctuation for connecting two independent clauses with 'therefore'.",
    "feedback_c": "This option is missing the comma after 'therefore'.",
    "feedback_d": "This option is missing both the semicolon before and the comma after 'therefore'."
  },
  {
    "question_id": "EOC-G-C4-15",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 4 - Joining & Separating Sentences - 61-73.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C4",
    "question_number": 15,
    "question_type": "multiple_choice",
    "passage_content": "In surveys, a significant majority of people usually agree that cycling is a desirable means of transit, especially in densely populated areas. Practically speaking, however, there is often a large gap between desired and actual numbers: in Germany, for example, only 20% of short-distance trips in residential environments are made by bicycle.",
    "question_stem": "Practically speaking, however, there is often a large gap between desired and actual <u>numbers: in Germany</u>, for example, only 20% of short-distance trips in residential environments are made by bicycle.",
    "option_a": "numbers in Germany",
    "option_b": "numbers: in Germany",
    "option_c": "numbers, in Germany,",
    "option_d": "numbers in Germany,",
    "correct_answer": "numbers: in Germany",
    "explanation_original": "A colon is used to introduce an explanation or an example. The second part of the sentence provides a specific example of the 'large gap' mentioned in the first part.",
    "explanation_ai_enhanced": "The first part of the sentence states there is a 'large gap between desired and actual numbers.' The second part provides a specific example of this gap. A colon is the ideal punctuation mark to introduce such an example or explanation, creating a strong, logical connection between the two clauses.",
    "feedback_a": "This option creates a run-on sentence by failing to separate the main clause from the example.",
    "feedback_b": "This is the correct answer. The colon effectively introduces the example that illustrates the 'large gap'.",
    "feedback_c": "The commas in this option incorrectly chop up the sentence and do not properly link the example to the main clause.",
    "feedback_d": "This option has an unnecessary comma after 'Germany' and fails to properly introduce the example."
  }
]
