[
  {
    "question_id": "EOC-G-C4-1",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 4 - Joining & Separating Sentences - 61-73.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C4",
    "question_number": 1,
    "question_type": "multiple_choice",
    "passage_content": null,
    "question_stem": "Lake Superior is the largest freshwater lake in the world by surface area and the third largest by <u>volume, it</u> holds around 10% of the world's fresh surface water.",
    "option_a": "volume, it",
    "option_b": "volume; it",
    "option_c": "volume: it",
    "option_d": "volume. It",
    "correct_answer": "volume; it",
    "explanation_original": "Lake Superior is the largest freshwater lake in the world by surface area and the third largest by volume; it holds around 10% of the world's fresh surface water. Also acceptable: volume. It, volume: it",
    "explanation_ai_enhanced": "The original sentence contains a comma splice, which is an error that occurs when two independent clauses are joined with only a comma. 'Lake Superior is the largest freshwater lake in the world by surface area and the third largest by volume' is an independent clause, and 'it holds around 10% of the world's fresh surface water' is another independent clause. To correct this, a stronger punctuation mark like a semicolon, a period, or a colon is needed. A semicolon is the most appropriate choice here as it correctly separates the two closely related independent clauses.",
    "feedback_a": "This option creates a comma splice by joining two independent clauses with only a comma, which is grammatically incorrect.",
    "feedback_b": "This option correctly uses a semicolon to separate two closely related independent clauses.",
    "feedback_c": "While a colon can be used to separate two independent clauses, it is typically used when the second clause explains or exemplifies the first. A semicolon or period is more appropriate here.",
    "feedback_d": "Using a period is a grammatically correct way to separate the two independent clauses, but the semicolon is also correct and offered as an option."
  },
  {
    "question_id": "EOC-G-C4-2",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 4 - Joining & Separating Sentences - 61-73.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C4",
    "question_number": 2,
    "question_type": "multiple_choice",
    "passage_content": null,
    "question_stem": "Very early printed books left spaces for commentary, miniature illustrations and illuminated <u>initials; all</u> of which would have been added later by hand.",
    "option_a": "initials; all",
    "option_b": "initials, all",
    "option_c": "initials. All",
    "option_d": "initials all",
    "correct_answer": "initials, all",
    "explanation_original": "Very early printed books left spaces for commentary, miniature illustrations and illuminated initials, all of which would have been added later by hand.",
    "explanation_ai_enhanced": "The phrase 'all of which would have been added later by hand' is a non-essential clause that provides additional information about the 'commentary, miniature illustrations and illuminated initials.' Such non-essential clauses should be set off from the main clause with a comma, not a semicolon or a period. Therefore, replacing the semicolon with a comma is the correct choice.",
    "feedback_a": "A semicolon is used to separate two independent clauses. The phrase 'all of which would have been added later by hand' is a dependent clause, so a semicolon is incorrect.",
    "feedback_b": "This option correctly uses a comma to set off the non-essential clause from the main clause.",
    "feedback_c": "A period would incorrectly break the sentence into a complete sentence and a fragment.",
    "feedback_d": "This option lacks the necessary punctuation to separate the non-essential clause from the main clause, creating a run-on sentence."
  },
  {
    "question_id": "EOC-G-C4-3",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 4 - Joining & Separating Sentences - 61-73.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C4",
    "question_number": 3,
    "question_type": "multiple_choice",
    "passage_content": null,
    "question_stem": "CRISPR tools can be programmed to target and cut virtually any DNA <u>sequence, however, they</u> have been limited by the requirement that they first recognize a short sequence surrounding the targeted section.",
    "option_a": "sequence, however, they",
    "option_b": "sequence; however, they",
    "option_c": "sequence. However, they",
    "option_d": "sequence however they",
    "correct_answer": "sequence; however, they",
    "explanation_original": "CRISPR tools can be programmed to target and cut virtually any DNA sequence; however, they have been limited by the requirement that they first recognize a short sequence surrounding the targeted section. Also acceptable: sequence. However,",
    "explanation_ai_enhanced": "The word 'however' is a conjunctive adverb that connects two independent clauses. When a conjunctive adverb is used in this way, it must be preceded by a semicolon or a period and followed by a comma. The original sentence uses a comma before 'however,' creating a comma splice. The correct punctuation is a semicolon before 'however' to properly join the two clauses.",
    "feedback_a": "This option results in a comma splice, as a comma is not strong enough to join two independent clauses with a conjunctive adverb.",
    "feedback_b": "This is the correct punctuation. A semicolon is used before the conjunctive adverb 'however' and a comma after it to connect two independent clauses.",
    "feedback_c": "Using a period is also a grammatically correct way to separate the two independent clauses, but the semicolon is the choice given to correct the original sentence's comma splice.",
    "feedback_d": "This option is a run-on sentence because it lacks the necessary punctuation around the conjunctive adverb 'however'."
  }
]
