[
  {
    "question_id": "EOC-R-C4-1",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 4 - The Bog Picture - 74-91.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C4",
    "question_number": 1,
    "question_type": "multiple_choice",
    "passage_content": "Mrs. Penniman was a tall, thin, fair, rather faded woman, with a perfectly amiable disposition, a high standard of gentility, a taste for light literature, and a certain foolish indirectness and obliquity of character. She had a passion for little secrets and mysteries—a very innocent passion, for her secrets had hitherto always been as unpractical as addled eggs. She was not absolutely veracious; but this defect was of no great consequence, for she had never had anything to conceal.",
    "question_stem": "Which choice best states the main idea of the text?",
    "option_a": "Mrs. Penniman is a puzzling and mysterious figure.",
    "option_b": "Mrs. Penniman is a passionate reader of novels.",
    "option_c": "Mrs. Penniman is frequently difficult to get along with.",
    "option_d": "Mrs. Penniman is romantic and sentimental.",
    "option_e": null,
    "correct_answer": "Mrs. Penniman is romantic and sentimental.",
    "explanation_original": "Throughout the passage, Mrs. Penniman is described as someone unserious and unconcerned with everyday matters: she has a taste for light literature and a passion for little secrets and mysteries, and is unpractical as addled eggs. These phrases convey an image of someone who is \"romantic and sentimental,\" making the answer (D). (A) and (C) are both entirely unsupported by the passage - there is nothing to suggest that Mrs. Penniman is either mysterious or difficult to get along with. (B) is incorrect because the passage states only that Mrs. Penniman has a taste (a liking) for light literature, which is much less extreme than a \"passion\".",
    "explanation_ai_enhanced": "The main idea of the text is a general characterization of Mrs. Penniman. The passage describes her with phrases like \"a taste for light literature\" and a \"passion for little secrets and mysteries,\" and calls her secrets \"unpractical.\" These qualities, combined with her \"foolish indirectness,\" point to a personality that is more concerned with romantic notions and feelings than with practical reality. Therefore, describing her as \"romantic and sentimental\" is the most accurate summary of her character as presented.\n\nWhy A is wrong: While she has a passion for mysteries, the passage calls this passion \"innocent\" and states she has nothing to conceal, suggesting she is not truly mysterious herself.\n\nWhy B is wrong: The text says she has a \"taste for light literature,\" which is a mild liking, not the strong dedication implied by being a \"passionate reader.\"\n\nWhy C is wrong: The passage explicitly states she has a \"perfectly amiable disposition,\" which directly contradicts the idea that she is difficult to get along with.",
    "feedback_a": "While she enjoys mysteries, the text suggests her passion is \"innocent\" and she isn't a mysterious figure herself.",
    "feedback_b": "This overstates the passage, which says she has a \"taste\" for light literature, not a \"passion\" for novels.",
    "feedback_c": "This is contradicted by the text, which states she has a \"perfectly amiable disposition.\"",
    "feedback_d": "Correct. This choice best summarizes her described traits, such as a \"taste for light literature\" and a \"passion for little secrets and mysteries.\""
  },
  {
    "question_id": "EOC-R-C4-2",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 4 - The Bog Picture - 74-91.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C4",
    "question_number": 2,
    "question_type": "multiple_choice",
    "passage_content": "Among the thousands of species that have made their way around the world since European exploration began in the fifteenth century, knotweed is widely regarded as one of the most intractable. Removing it completely requires extracting the land itself; if anything is left behind, the weed can return repeatedly, regenerating from minuscule fragments after as long as twenty years. One study found that knotweed could regrow from a root fragment weighing just 0.3g—about as much as a pinch of salt.",
    "question_stem": "Which choice best states the main idea of the text?",
    "option_a": "Knotweed was among the earliest plant species to be transported between continents.",
    "option_b": "Knotweed can regenerate even when the land it grows on has been removed.",
    "option_c": "Knotweed is exceptionally difficult to eradicate permanently.",
    "option_d": "In comparison to other plants, knotweed takes much longer to reach its full size.",
    "option_e": null,
    "correct_answer": "Knotweed is exceptionally difficult to eradicate permanently.",
    "explanation_original": "The main focus of the passage is on the difficulty of eradicating (getting rid of) knotweed: the first sentence states that it is intractable (immovable), and the second indicates that the only way to remove it completely is to extract the land it sits on. That corresponds directly to (C). (A) is incorrect because the passage does not state that knotweed was one of the earliest to plants to travel. (B) is directly contradicted by the passage, which states that knotweed can be removed when the land it sits on is extracted. (D) is entirely off-topic: the figure (0.3g) mentioned in the last sentence serves only to emphasize the minuscule amount of knotweed capable of regenerating a new plant.",
    "explanation_ai_enhanced": "The central point of the text is to describe how resilient and hard to remove knotweed is. The passage uses strong words like \"intractable\" (hard to control or deal with) and provides powerful examples, such as needing to remove the land itself and its ability to regenerate from \"minuscule fragments.\" These details all support the main idea that the plant is exceptionally difficult to get rid of for good.\n\nWhy A is wrong: The passage mentions its spread since the fifteenth century but never claims it was among the \"earliest\" to be transported.\n\nWhy B is wrong: This is a misreading. The passage says removing it requires \"extracting the land itself,\" implying that if the land is removed, the knotweed is gone. It doesn't say the knotweed can regenerate without land.\n\nWhy D is wrong: The text discusses regeneration from small fragments but says nothing about the speed or time it takes to reach full size compared to other plants.",
    "feedback_a": "The passage mentions when knotweed began to spread but does not compare its timeline to other species, so this is unsupported.",
    "feedback_b": "This misinterprets the text, which implies that removing the land is the way to get rid of the knotweed.",
    "feedback_c": "Correct. This statement is a strong summary of the passage's main point, which is supported by words like \"intractable\" and examples of its resilience.",
    "feedback_d": "The passage focuses on knotweed's ability to regenerate, not the time it takes to grow to full size."
  },
  {
    "question_id": "EOC-R-C4-3",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 4 - The Bog Picture - 74-91.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C4",
    "question_number": 3,
    "question_type": "multiple_choice",
    "passage_content": "Dear Friend, since you have chosen to associate\nMy humble thoughts with England's poet laureate,\nI trust that he will bear me pleasant company,\nAnd soon we shall far more than mere acquaintance be.\nSince childhood's days his name I have revered,\nAnd more and more it has become to me endeared;\nI blush not for the truth, I but confess,\nI very wealthy feel since I his \"works\" possess.",
    "question_stem": "Which choice best states the main idea of the text?",
    "option_a": "She is impressed by her friend's personal acquaintance with Tennyson.",
    "option_b": "She views Tennyson with respect and wishes to understand his work deeply.",
    "option_c": "She is embarrassed by her poor understanding of Tennyson's work.",
    "option_d": "She believes that her own poetry is equal to Tennyson's.",
    "option_e": null,
    "correct_answer": "She views Tennyson with respect and wishes to understand his work deeply.",
    "explanation_original": "The lines Since childhood's days [Tennyson's] name I have revered/And more and more it has become to me endeared, and I very wealthy feel since I his \"works\" possess indicate that Heard is extremely proud to have received Tennyson's poems and has an extremely positive attitude toward the poet. (C) is negative and can be eliminated. (A) misstates the essential situation: Heard's friend does not personally know Tennyson; as indicated in the title in the blurb before the passage, she has merely given a book of his poems as a gift. (D) is incorrect because Heard refers to her humble thoughts, indicating that she does not consider herself Tennyson's equal. Only (B) correctly characterizes Heard's attitude of \"respect\" and desire to \"understand [Tennyson's] work deeply.\"",
    "explanation_ai_enhanced": "The speaker expresses deep admiration for Tennyson, whose name she has \"revered\" since childhood. She hopes that by reading his work, they will become \"far more than mere acquaintance,\" indicating a desire for a deeper understanding. Her feeling of being \"very wealthy\" since possessing his works further emphasizes her profound respect and the value she places on his poetry. This combination of reverence and a desire for closeness supports the idea that she respects him and wants to engage deeply with his work.\n\nWhy A is wrong: The speaker's friend gave her a book of poems; there is no indication the friend has a personal acquaintance with Tennyson.\n\nWhy C is wrong: The speaker does not express embarrassment; she expresses reverence and joy (\"wealthy feel\").\n\nWhy D is wrong: This is directly contradicted when the speaker refers to her own thoughts as \"humble\" in comparison to the \"poet laureate,\" showing she does not consider herself his equal.",
    "feedback_a": "The text indicates the friend gave a book of poems, not that the friend knows Tennyson personally.",
    "feedback_b": "Correct. Her use of words like \"revered\" and her hope to become \"more than mere acquaintance\" through his work show her deep respect and desire for understanding.",
    "feedback_c": "The speaker's tone is one of admiration and joy, not embarrassment.",
    "feedback_d": "This is contradicted by the speaker's description of her own thoughts as \"humble\" next to the \"poet laureate.\""
  },
  {
    "question_id": "EOC-R-C4-4",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 4 - The Bog Picture - 74-91.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C4",
    "question_number": 4,
    "question_type": "multiple_choice",
    "passage_content": "Navajo pawn originated in the 1870s as a bartering system that was altogether different from traditional banking. Based on relationships of mutual trust, it evolved to be a fully integrated part of Navajo life. By the middle of the twentieth century, it had become a highly sophisticated and complex practice, with more than 150 active trading posts. Today it remains a pivotal aspect of Navajo society.",
    "question_stem": "Which choice best states the main idea of the text?",
    "option_a": "Pawn has played a significant role in modern Navajo culture.",
    "option_b": "During the twentieth century, pawn was gradually replaced by other banking options.",
    "option_c": "Pawn is more complex than traditional banking.",
    "option_d": "Pawn became popular in Navajo society because it was based on personal relationships.",
    "option_e": null,
    "correct_answer": "Pawn has played a significant role in modern Navajo culture.",
    "explanation_original": "The key information appears in the second sentence and last sentence, where pawn is described as a fully integrated part of Navajo life and a pivotal aspect of Navajo society. In other words, it \"plays a significant role in Navajo culture,\" making (A) correct. (B) is entirely unsupported by the passage. (C) and (D) are incorrect because the passage states only that pawn is different from traditional banking and is based on relationships of mutual trust—it cannot be inferred that pawn is \"more complex than traditional banking\" or that it \"became popular...because it was based on personal relationships.\"",
    "explanation_ai_enhanced": "The passage traces the history of Navajo pawn from its origins to the present day, consistently emphasizing its importance. Key phrases like \"fully integrated part of Navajo life\" and \"Today it remains a pivotal aspect of Navajo society\" show its continuous and significant role. The main idea is to establish the deep and lasting importance of this practice within Navajo culture.\n\nWhy B is wrong: This is directly contradicted by the last sentence, which states pawn \"remains a pivotal aspect\" today.\n\nWhy C is wrong: The text says pawn is \"different from\" and \"sophisticated,\" but it never makes a direct comparison to say it is \"more complex\" than traditional banking.\n\nWhy D is wrong: While being based on relationships is mentioned as a feature, the passage does not explicitly state this is the sole reason it became popular. It is a supporting detail, not the main idea.",
    "feedback_a": "Correct. This statement best captures the main point, which is supported by phrases like \"fully integrated\" and \"pivotal aspect.\"",
    "feedback_b": "This is contradicted by the text, which states that pawn \"remains a pivotal aspect\" in the present day.",
    "feedback_c": "The passage states pawn is \"different\" and \"sophisticated,\" but does not provide enough information to conclude it is \"more complex\" than traditional banking.",
    "feedback_d": "This is a supporting detail, but the main idea is the overall significance of the practice, not just the reason for its popularity."
  },
  {
    "question_id": "EOC-R-C4-5",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 4 - The Bog Picture - 74-91.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C4",
    "question_number": 5,
    "question_type": "multiple_choice",
    "passage_content": "Although publishers and critics classified Octavia Butler's novels as science fiction—a genre that Butler enjoyed deeply and referred to as \"potentially the freest genre in existence\"— her works attracted a diverse readership, and Butler resisted being associated exclusively with that form. Indeed, she was also the author of a number of essays, and her book Parable of the Sower was adapted into an opera by the mother-and-daughter team Bernice Johnson Reagon and Toshi Reagon. Combining African-American spirituals, soul, rock and roll, and folk music, it debuted at The Public Theater in New York City in 2015.",
    "question_stem": "Which choice best describes the overall structure of the text?",
    "option_a": "A work is presented, and its effects are considered.",
    "option_b": "An interpretation of a novel is described, and an opposing view is introduced.",
    "option_c": "Examples of an author's writing are given, and their significance is discussed.",
    "option_d": "A claim is made, and supporting examples are provided to illustrate it.",
    "option_e": null,
    "correct_answer": "A claim is made, and supporting examples are provided to illustrate it.",
    "explanation_original": "Don't get too caught up in the seeming complexity of the answer choices. In reality, the structure of the passage is fairly straightforward. The first sentence presents a claim - Octavia Butler resisted being identified exclusively with science fiction novels (i.e., that form) - and the rest of the passage serves to support it with specific examples (she also wrote essays and had one of her books turned into an opera). The only answer that corresponds to that organization is (D). The passage does not focus on one specific work or novel, eliminating (A) and (B). (C) does not fit either because the passage does not discuss the significance of either of the works mentioned.",
    "explanation_ai_enhanced": "The text is structured around a central argument followed by evidence. The first sentence makes a specific claim: that Octavia Butler \"resisted being associated exclusively with\" the science fiction genre, despite being classified as such. The rest of the passage then provides two key examples to support this claim: 1) she also wrote essays, and 2) her work was adapted into an opera, a completely different medium. This structure perfectly matches the description of making a claim and then providing examples to illustrate it.\n\nWhy A, B, and C are wrong: The passage does not focus on a single work (A). It does not present an interpretation and then an opposing view (B). It does not discuss the \"significance\" of the examples in a broader sense, but rather uses them simply as proof of the initial claim (C).",
    "feedback_a": "The text mentions more than one work and does not focus on the 'effects' of a single one.",
    "feedback_b": "The passage does not introduce an opposing view; instead, it provides evidence to support the initial claim.",
    "feedback_c": "The passage provides examples but does not analyze their 'significance' beyond using them as evidence for the initial claim.",
    "feedback_d": "Correct. The text makes the claim that Butler resisted being pigeonholed and then gives examples (essays, an opera) to support it."
  }
]
