[
  {
    "question_id": "EOC-G-C1-1",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 1 - Transitions - 13-28.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C1",
    "question_number": 1,
    "question_type": "multiple_choice",
    "passage_content": "In the past, coffees were blended to suit a homogenous popular taste. ____, many different coffee flavors are now being produced.",
    "question_stem": "Which choice completes the text with the most logical transition?",
    "option_a": "Accordingly,",
    "option_b": "Thus,",
    "option_c": "However,",
    "option_d": "Alternatively,",
    "correct_answer": "However,",
    "explanation_original": "In the past, coffees were blended to suit a homogenous popular taste. However, many different coffee flavors are now being produced.",
    "explanation_ai_enhanced": "The first sentence describes a past situation ('homogenous popular taste'). The second sentence describes the current, different situation ('many different coffee flavors'). This is a clear contrast between the past and the present, so a contradictor like 'However' is the correct transition.",
    "feedback_a": "'Accordingly' indicates a result, which is not the relationship here.",
    "feedback_b": "'Thus' indicates a result, which is incorrect.",
    "feedback_c": "This is the correct answer. 'However' correctly introduces a contrast to the previous statement.",
    "feedback_d": "'Alternatively' suggests a different option, which doesn't fit the context."
  },
  {
    "question_id": "EOC-G-C1-2",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 1 - Transitions - 13-28.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C1",
    "question_number": 2,
    "question_type": "multiple_choice",
    "passage_content": "Researchers are unable to drill into the Earth's core. ____, its chemical composition remains a mystery.",
    "question_stem": "Which choice completes the text with the most logical transition?",
    "option_a": "Indeed,",
    "option_b": "Consequently,",
    "option_c": "In contrast,",
    "option_d": "For example,",
    "correct_answer": "Consequently,",
    "explanation_original": "Researchers are unable to drill into the Earth's core. Consequently, its chemical composition remains a mystery.",
    "explanation_ai_enhanced": "The first sentence states a cause (being unable to drill into the core). The second sentence states the direct result of that cause (its composition is a mystery). A cause-and-effect transition is needed. 'Consequently' correctly indicates this relationship.",
    "feedback_a": "'Indeed' is used for emphasis, not to show a result.",
    "feedback_b": "This is the correct answer. 'Consequently' properly shows that the mystery is a result of the inability to drill.",
    "feedback_c": "'In contrast' indicates an opposing idea, but these ideas are connected by cause and effect.",
    "feedback_d": "'For example' introduces an example, which is not the case here."
  },
  {
    "question_id": "EOC-G-C1-3",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 1 - Transitions - 13-28.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C1",
    "question_number": 3,
    "question_type": "multiple_choice",
    "passage_content": "The Taj Mahal is regarded as one of the eight wonders of the world. ____, some people believe that its architectural beauty has never been surpassed.",
    "question_stem": "Which choice completes the text with the most logical transition?",
    "option_a": "Indeed,",
    "option_b": "Specifically,",
    "option_c": "To illustrate,",
    "option_d": "Still,",
    "correct_answer": "Indeed,",
    "explanation_original": "The Taj Mahal is regarded as one of the eight wonders of the world. Indeed, some people believe that its architectural beauty has never been surpassed.",
    "explanation_ai_enhanced": "The first sentence makes a strong positive statement (it's a wonder of the world). The second sentence adds a further, stronger, and related positive statement (its beauty is unsurpassed). A transition used for emphasis or continuation is needed. 'Indeed' is the best choice to emphasize the first point.",
    "feedback_a": "This is the correct answer. 'Indeed' correctly emphasizes the high regard in which the Taj Mahal is held.",
    "feedback_b": "'Specifically' would introduce a more detailed aspect, not a reinforcing statement of greatness.",
    "feedback_c": "'To illustrate' would introduce an example, but the second sentence is an emphatic statement.",
    "feedback_d": "'Still' is a contradictor, but the two sentences express similar, positive ideas."
  },
  {
    "question_id": "EOC-G-C1-4",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 1 - Transitions - 13-28.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C1",
    "question_number": 4,
    "question_type": "multiple_choice",
    "passage_content": "In order to save an endangered species, preservationists must study it in detail. ____, scientific information about some endangered animals is scarce.",
    "question_stem": "Which choice completes the text with the most logical transition?",
    "option_a": "therefore",
    "option_b": "moreover",
    "option_c": "in contrast",
    "option_d": "however",
    "correct_answer": "however",
    "explanation_original": "In order to save an endangered species, preservationists must study it in detail. However, scientific information about some endangered animals is scarce.",
    "explanation_ai_enhanced": "The first sentence states a requirement for saving a species (studying it in detail). The second sentence states a problem that makes this difficult (information is scarce). This is a clear contrast between a need and a challenging reality. A contradictor like 'however' is needed.",
    "feedback_a": "'Therefore' indicates a result, but the scarcity of information is an obstacle, not a result.",
    "feedback_b": "'Moreover' adds a similar idea, but these are opposing ideas.",
    "feedback_c": "'In contrast' could work, but 'however' is a more common and fitting choice for introducing an obstacle.",
    "feedback_d": "This is the correct answer. 'However' correctly introduces the conflicting problem."
  },
  {
    "question_id": "EOC-G-C1-5",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 1 - Transitions - 13-28.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C1",
    "question_number": 5,
    "question_type": "multiple_choice",
    "passage_content": "Pyramids are most commonly associated with ancient Egypt. ____, many people are surprised to learn that the Nubians, who lived in modern-day Sudan, constructed a far greater number of pyramids than the Egyptians did.",
    "question_stem": "Which choice completes the text with the most logical transition?",
    "option_a": "Moreover,",
    "option_b": "Consequently,",
    "option_c": "Nevertheless,",
    "option_d": "Likewise,",
    "correct_answer": "Consequently,",
    "explanation_original": "Pyramids are most commonly associated with ancient Egypt. Consequently, many people are surprised to learn that the Nubians... constructed a far greater number...",
    "explanation_ai_enhanced": "The first sentence states a common association (pyramids with Egypt). The second sentence describes a result of this common association: people's surprise upon learning a conflicting fact. 'Consequently' correctly establishes this cause-and-effect relationship between the widespread belief and the subsequent surprise.",
    "feedback_a": "'Moreover' adds a similar idea, but the second sentence describes a result of the first.",
    "feedback_b": "This is the correct answer. The surprise is a consequence of the common association.",
    "feedback_c": "'Nevertheless' introduces a contrast, but the logic is cause-and-effect.",
    "feedback_d": "'Likewise' indicates similarity, which is incorrect."
  },
  {
    "question_id": "EOC-G-C1-6",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 1 - Transitions - 13-28.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C1",
    "question_number": 6,
    "question_type": "multiple_choice",
    "passage_content": "Modern chemistry keeps insects from ravaging crops, removes stains, and saves lives. ____, constant exposure to chemicals is taking a toll on many people's health.",
    "question_stem": "Which choice completes the text with the most logical transition?",
    "option_a": "Hence,",
    "option_b": "In contrast,",
    "option_c": "Still,",
    "option_d": "Subsequently,",
    "correct_answer": "Still,",
    "explanation_original": "Modern chemistry keeps insects from ravaging crops, removes stains, and saves lives. Still, constant exposure to chemicals is taking a toll on many people's health.",
    "explanation_ai_enhanced": "The first sentence lists the positive effects of modern chemistry. The second sentence presents a negative effect. This is a clear contrast between the benefits and the drawbacks. A contradictor is needed. 'Still' (meaning 'despite this') is a fitting choice.",
    "feedback_a": "'Hence' indicates a result, but the second sentence is a contrast.",
    "feedback_b": "'In contrast' is a possible contradictor, but 'Still' or 'However' often works better to introduce a downside to something that is otherwise positive.",
    "feedback_c": "This is the correct answer. 'Still' correctly introduces the contrasting negative aspect.",
    "feedback_d": "'Subsequently' indicates a sequence of events, not a contrast."
  },
  {
    "question_id": "EOC-G-C1-7",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 1 - Transitions - 13-28.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C1",
    "question_number": 7,
    "question_type": "multiple_choice",
    "passage_content": "Music serves no obvious purpose. It has, ____, played a role in every known civilization on earth.",
    "question_stem": "Which choice completes the text with the most logical transition?",
    "option_a": "therefore,",
    "option_b": "moreover,",
    "option_c": "however,",
    "option_d": "for instance,",
    "correct_answer": "however,",
    "explanation_original": "Music serves no obvious purpose. It has, however, played a role in every known civilization on earth.",
    "explanation_ai_enhanced": "The first sentence presents an idea ('no obvious purpose'). The second sentence presents a contrasting idea (it has played a role everywhere). This contrast requires a contradictor. 'However' is the correct choice.",
    "feedback_a": "'Therefore' indicates a result, but these are contrasting ideas.",
    "feedback_b": "'Moreover' adds a similar idea, but these are contrasting ideas.",
    "feedback_c": "This is the correct answer. 'However' properly introduces the contrast between music's lack of obvious purpose and its universal presence.",
    "feedback_d": "'For instance' introduces an example, which is not the function here."
  },
  {
    "question_id": "EOC-G-C1-8",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 1 - Transitions - 13-28.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C1",
    "question_number": 8,
    "question_type": "multiple_choice",
    "passage_content": "In the Middle Ages, fairs often attracted large crowds and led to rioting. ____, authorities were reluctant to grant permission for them to be held.",
    "question_stem": "Which choice completes the text with the most logical transition?",
    "option_a": "Alternatively,",
    "option_b": "For instance,",
    "option_c": "Furthermore,",
    "option_d": "Therefore,",
    "correct_answer": "Therefore,",
    "explanation_original": "In the Middle Ages, fairs often attracted large crowds and led to rioting. Therefore, authorities were reluctant to grant permission for them to be held.",
    "explanation_ai_enhanced": "The first sentence states a cause (fairs led to rioting). The second sentence states the logical result of this problem (authorities were reluctant to allow them). A cause-and-effect transition is required. 'Therefore' correctly indicates this relationship.",
    "feedback_a": "'Alternatively' presents another option, which is not the case here.",
    "feedback_b": "'For instance' introduces an example, not a result.",
    "feedback_c": "'Furthermore' adds another similar point, but this is a result.",
    "feedback_d": "This is the correct answer. 'Therefore' correctly shows that the authorities' reluctance was a result of the rioting."
  },
  {
    "question_id": "EOC-G-C1-9",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 1 - Transitions - 13-28.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C1",
    "question_number": 9,
    "question_type": "multiple_choice",
    "passage_content": "Although the abstract painter Joan Mitchell disliked being compared to Monet, the parallels between them were undeniable. Her terrace overlooked a house that Monet occupied from 1878 to 1881, as well as a landscape that he painted. ____, some of her own late works unmistakably hark back to the paintings that Monet produced in his twilight years at Giverny.",
    "question_stem": "Which choice completes the text with the most logical transition?",
    "option_a": "Moreover,",
    "option_b": "Thus,",
    "option_c": "Meanwhile,",
    "option_d": "Nevertheless,",
    "correct_answer": "Moreover,",
    "explanation_original": "...as well as a landscape that he painted. Moreover, some of her own late works unmistakably hark back to the paintings that Monet produced...",
    "explanation_ai_enhanced": "The passage is listing parallels between Mitchell and Monet. The sentence before the blank provides one parallel (living near the same place). The sentence with the blank provides a second, additional parallel (her late works are similar to his). A continuer that adds information is needed. 'Moreover' is the best fit.",
    "feedback_a": "This is the correct answer. 'Moreover' correctly adds another piece of evidence to support the claim of 'undeniable parallels'.",
    "feedback_b": "'Thus' indicates a result, but this is an additional point, not a conclusion.",
    "feedback_c": "'Meanwhile' can indicate contrast or things happening at the same time, neither of which fits here.",
    "feedback_d": "'Nevertheless' is a contradictor, but the sentences present similar, supporting ideas."
  },
  {
    "question_id": "EOC-G-C1-10",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 1 - Transitions - 13-28.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C1",
    "question_number": 10,
    "question_type": "multiple_choice",
    "passage_content": "A recent study suggests that consuming food late in the evening has profound effects on the hunger-regulating hormones leptin and ghrelin, which influence our drive to eat. ____, researchers found that levels of the hormone leptin, which signals satiety, remained low for 24 hours for a group of subjects instructed to eat dinner late, whereas leptin levels were much higher in a group that ate dinner early.",
    "question_stem": "Which choice completes the text with the most logical transition?",
    "option_a": "Despite this,",
    "option_b": "However,",
    "option_c": "Specifically,",
    "option_d": "Therefore,",
    "correct_answer": "Specifically,",
    "explanation_original": "...profound effects on the hunger-regulating hormones leptin and ghrelin... Specifically, researchers found that levels of the hormone leptin...",
    "explanation_ai_enhanced": "The first sentence makes a general statement (late-night eating has 'profound effects' on hormones). The second sentence provides the exact details of one of those effects (how leptin levels were affected). The best transition is one that introduces a specific example or detail. 'Specifically' does this perfectly.",
    "feedback_a": "'Despite this' is a contradictor, which is incorrect.",
    "feedback_b": "'However' is a contradictor, which is incorrect.",
    "feedback_c": "This is the correct answer. 'Specifically' correctly introduces the detailed findings that support the general statement.",
    "feedback_d": "'Therefore' indicates a result, but the second sentence is an elaboration, not a conclusion."
  },
  {
    "question_id": "EOC-G-C1-11",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 1 - Transitions - 13-28.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C1",
    "question_number": 11,
    "question_type": "multiple_choice",
    "passage_content": "Rather than embrace the type of abstract work that many artists of her generation preferred, Gwendolyn Knight preferred to depict figures in a spontaneous and personal manner. ____, she painted oil portraits of friends as well as studies of dancers in motion.",
    "option_a": "Moreover,",
    "option_b": "Specifically,",
    "option_c": "Nevertheless,",
    "option_d": "Besides,",
    "correct_answer": "Specifically,",
    "explanation_original": "Gwendolyn Knight preferred to depict figures in a spontaneous and personal manner. Specifically, she painted oil portraits of friends as well as studies of dancers in motion.",
    "explanation_ai_enhanced": "The first sentence makes a general statement about Gwendolyn Knight's artistic preference ('depict figures in a spontaneous and personal manner'). The second sentence provides concrete examples of this preference ('oil portraits of friends,' 'studies of dancers'). The transition 'Specifically' is used to introduce such examples.",
    "feedback_a": "'Moreover' adds another, different idea, but the second sentence is an example of the first.",
    "feedback_b": "This is the correct answer. It correctly introduces specific examples of her work.",
    "feedback_c": "'Nevertheless' shows a contrast, which is not the case here.",
    "feedback_d": "'Besides' is similar to 'Moreover' and is not the best fit for introducing an example."
  },
  {
    "question_id": "EOC-G-C1-12",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 1 - Transitions - 13-28.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C1",
    "question_number": 12,
    "question_type": "multiple_choice",
    "passage_content": "Discarded electronic devices such as cell phones and tablets are a rapidly growing source of waste. One way to mitigate the problem, ____, could be to include components made with renewable resources.",
    "option_a": "therefore,",
    "option_b": "moreover,",
    "option_c": "nevertheless,",
    "option_d": "however,",
    "correct_answer": "however,",
    "explanation_original": "Discarded electronic devices...are a rapidly growing source of waste. One way to mitigate the problem, however, could be to include components made with renewable resources.",
    "explanation_ai_enhanced": "The first sentence presents a problem (e-waste is growing). The second sentence introduces a potential solution. Although it's a solution, the word 'however' is often used to pivot from a problem to a potential solution or a different way of looking at the issue. It signals a shift in focus from the negative to a more constructive point.",
    "feedback_a": "'Therefore' would imply the solution is a direct result of the problem, which is logical but 'however' better captures the pivot from problem to solution.",
    "feedback_b": "'Moreover' adds another point, but a solution is not just another point, it's a response.",
    "feedback_c": "'Nevertheless' implies 'despite the problem,' which is plausible but 'however' is a more neutral transition to introduce a solution.",
    "feedback_d": "This is the best answer. 'However' is often used to shift from discussing a problem to proposing a potential solution."
  },
  {
    "question_id": "EOC-G-C1-13",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 1 - Transitions - 13-28.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C1",
    "question_number": 13,
    "question_type": "multiple_choice",
    "passage_content": "While doing fieldwork on Gorgonilla Island in Colombia in 2014, Hermann Bermúdez found spherule deposits—layers of sediment filled with tiny glass beads. These beads formed when the heat and pressure from an asteroid impact melted and scattered the crust of the Earth, ejecting tiny liquid blobs into the atmosphere. ____, they fell back to earth in solid form under the influence of gravity.",
    "option_a": "Therefore,",
    "option_b": "Meanwhile,",
    "option_c": "Subsequently,",
    "option_d": "Additionally,",
    "correct_answer": "Subsequently,",
    "explanation_original": "These beads formed when...ejecting tiny liquid blobs into the atmosphere. Subsequently, they fell back to earth in solid form...",
    "explanation_ai_enhanced": "The sentences describe a sequence of events. First, an asteroid impact ejected liquid blobs into the atmosphere. The next step in the sequence is that these blobs fell back to Earth. The word 'Subsequently' means 'afterward' or 'next' and is the perfect transition to indicate a chronological sequence.",
    "feedback_a": "'Therefore' indicates a result, but this is a sequence of time.",
    "feedback_b": "'Meanwhile' means 'at the same time,' which is incorrect.",
    "feedback_c": "This is the correct answer. It correctly indicates the next event in the sequence.",
    "feedback_d": "'Additionally' adds another piece of information, but the key relationship is time-based."
  },
  {
    "question_id": "EOC-G-C1-14",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 1 - Transitions - 13-28.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C1",
    "question_number": 14,
    "question_type": "multiple_choice",
    "passage_content": "Blue whales recognize when the wind is changing their habitat and identify places where ocean currents produce large aggregations of krill. The tiny shrimp are the primary food sources for the massive animals, which can weigh 165 tons or more. ____, their ability to locate these dense concentrations of nutrients is a matter of survival.",
    "option_a": "Consequently,",
    "option_b": "For instance,",
    "option_c": "Furthermore,",
    "option_d": "Alternatively,",
    "correct_answer": "Consequently,",
    "explanation_original": "The tiny shrimp are the primary food sources for the massive animals... Consequently, their ability to locate these dense concentrations of nutrients is a matter of survival.",
    "explanation_ai_enhanced": "The text establishes that krill are the primary food source for blue whales. The logical result of this fact is that being able to find krill is essential for the whales' survival. A cause-and-effect transition is needed. 'Consequently' correctly introduces this result.",
    "feedback_a": "This is the correct answer. Finding krill is a matter of survival as a consequence of it being their primary food.",
    "feedback_b": "'For instance' introduces an example, not a result.",
    "feedback_c": "'Furthermore' adds a related point, but this is a direct result.",
    "feedback_d": "'Alternatively' introduces a different option, which is incorrect."
  },
  {
    "question_id": "EOC-G-C1-15",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 1 - Transitions - 13-28.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C1",
    "question_number": 15,
    "question_type": "multiple_choice",
    "passage_content": "In 1959, Project Mercury became the first human spaceflight program led by NASA. Aimed at putting an American into orbit before the Soviet Union could accomplish that goal, it was shut down after less than half a decade. ____, in the four years of its existence, seven astronauts were able to travel into space.",
    "option_a": "For instance,",
    "option_b": "Still,",
    "option_c": "Accordingly,",
    "option_d": "Indeed,",
    "correct_answer": "Still,",
    "explanation_original": "it was shut down after less than half a decade. Still, in the four years of its existence, seven astronauts were able to travel into space.",
    "explanation_ai_enhanced": "The first sentence presents a seemingly negative outcome (the program 'was shut down' quickly). The second sentence presents a positive achievement that happened during that short time (seven astronauts traveled to space). This is a contrast between the short duration and the significant accomplishment. 'Still' (meaning 'despite this') is the best contradictor to connect these ideas.",
    "feedback_a": "'For instance' introduces an example, which is not the relationship here.",
    "feedback_b": "This is the correct answer. 'Still' correctly introduces the positive achievement despite the program's short lifespan.",
    "feedback_c": "'Accordingly' indicates a result, which is illogical.",
    "feedback_d": "'Indeed' emphasizes a previous point, but these are contrasting points."
  },
  {
    "question_id": "EOC-G-C1-16",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 1 - Transitions - 13-28.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C1",
    "question_number": 16,
    "question_type": "multiple_choice",
    "passage_content": "Bacteria have one or many appendages known as a flagellum, which is made of thousands of identical subunits. ____ a tail that was straight or only slightly flexible would leave an organism unable to move, bacteria have evolved rotating, corkscrew-shaped propellers that push them forward. Scientists call the formation of this shape \"supercoiling,\" and now, after more than half a century, they understand how the process works.",
    "option_a": "Although",
    "option_b": "Despite",
    "option_c": "Because",
    "option_d": "Unless",
    "correct_answer": "Because",
    "explanation_original": "Because a tail that was straight or only slightly flexible would leave an organism unable to move, bacteria have evolved rotating, corkscrew-shaped propellers that push them forward.",
    "explanation_ai_enhanced": "The sentence explains the reason why bacteria evolved corkscrew-shaped propellers. The reason is that a straight tail would be ineffective. The word 'Because' is the correct subordinating conjunction to introduce a cause or reason.",
    "feedback_a": "'Although' introduces a contrast, which is incorrect.",
    "feedback_b": "'Despite' also introduces a contrast.",
    "feedback_c": "This is the correct answer. 'Because' correctly introduces the reason for the evolution of the propellers.",
    "feedback_d": "'Unless' introduces a condition, which doesn't fit the logic here."
  },
  {
    "question_id": "EOC-G-C1-17",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 1 - Transitions - 13-28.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C1",
    "question_number": 17,
    "question_type": "multiple_choice",
    "passage_content": "Although Shakespeare portrayed King Richard III as a villain, historians argue that he was in fact a far more sympathetic figure. The Tudors, on whose patronage Shakespeare was dependent, had conquered the English throne from Richard. ____, the playwright was obliged to portray the king in an unflattering light.",
    "option_a": "Hence,",
    "option_b": "Still,",
    "option_c": "In contrast,",
    "option_d": "Moreover,",
    "correct_answer": "Hence,",
    "explanation_original": "The Tudors, on whose patronage Shakespeare was dependent, had conquered the English throne from Richard. Hence, the playwright was obliged to portray the king in an unflattering light.",
    "explanation_ai_enhanced": "The text explains the cause for Shakespeare's portrayal of Richard III: he was dependent on the Tudors, who had overthrown Richard. The logical result is that Shakespeare was 'obliged to portray the king in an unflattering light'. A cause-and-effect transition is needed. 'Hence' (meaning 'for this reason' or 'therefore') correctly introduces this result.",
    "feedback_a": "This is the correct answer. 'Hence' correctly indicates a cause-and-effect relationship.",
    "feedback_b": "'Still' introduces a contrast.",
    "feedback_c": "'In contrast' introduces a contrast.",
    "feedback_d": "'Moreover' adds a similar point."
  },
  {
    "question_id": "EOC-G-C1-18",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 1 - Transitions - 13-28.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C1",
    "question_number": 18,
    "question_type": "multiple_choice",
    "passage_content": "Trade on the Silk Road was a significant factor in the development of China, India, and Europe, opening long-distance political and economic interactions. ____ silk was certainly the major trade item from China, numerous other types of goods, including textiles, cloth, and pottery, also traveled along the Silk Road.",
    "option_a": "Because",
    "option_b": "Although",
    "option_c": "Until",
    "option_d": "When",
    "correct_answer": "Although",
    "explanation_original": "Although silk was certainly the major trade item from China, numerous other types of goods... also traveled along the Silk Road.",
    "explanation_ai_enhanced": "The sentence presents a contrast. It acknowledges one fact (silk was the major item) while introducing a contrasting fact (many other goods were also traded). The subordinating conjunction 'Although' is the correct choice to introduce this kind of concession or contrast.",
    "feedback_a": "'Because' indicates a cause, which is not the relationship here.",
    "feedback_b": "This is the correct answer. 'Although' correctly sets up the contrast between silk being the main item and other items also being important.",
    "feedback_c": "'Until' indicates a time relationship.",
    "feedback_d": "'When' indicates a time relationship."
  },
  {
    "question_id": "EOC-G-C1-19",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 1 - Transitions - 13-28.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C1",
    "question_number": 19,
    "question_type": "multiple_choice",
    "passage_content": "From the moment 2001: A Space Odyssey premiered in 1968, it was clear that the film would become best known for its special effects. It featured spacecraft that flew realistically—not zooming around in a cartoonish manner, as was the case in other films of the time. ____, Kubrick imagined a fully realized vision of regular human spaceflights in Earth orbit and beyond.",
    "option_a": "Moreover,",
    "option_b": "Nevertheless,",
    "option_c": "To illustrate,",
    "option_d": "Meanwhile,",
    "correct_answer": "Moreover,",
    "explanation_original": "It featured spacecraft that flew realistically... Moreover, Kubrick imagined a fully realized vision of regular human spaceflights...",
    "explanation_ai_enhanced": "The text lists the reasons why the film's special effects were notable. The first point is the realistic flight of spacecraft. The second sentence adds another point about the director's vision for spaceflight. 'Moreover' is the correct transition to add a related, supporting point.",
    "feedback_a": "This is the correct answer. 'Moreover' correctly adds another point about the film's impressive vision.",
    "feedback_b": "'Nevertheless' introduces a contrast.",
    "feedback_c": "'To illustrate' introduces an example, but this is a separate, additional point.",
    "feedback_d": "'Meanwhile' indicates something happening at the same time, which doesn't fit the logic."
  },
  {
    "question_id": "EOC-G-C1-20",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 1 - Transitions - 13-28.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C1",
    "question_number": 20,
    "question_type": "multiple_choice",
    "passage_content": "Straw has been used as a building material for centuries, and contrary to popular belief, it is not easily destroyed. ____, it can be remarkably durable. In the nineteenth century, settlers in the Nebraska Sand Hills used straw to build houses when wood and clay were scarce; some of the structures are still standing today.",
    "option_a": "Therefore,",
    "option_b": "Even so,",
    "option_c": "However,",
    "option_d": "In fact,",
    "correct_answer": "In fact,",
    "explanation_original": "...it is not easily destroyed. In fact, it can be remarkably durable.",
    "explanation_ai_enhanced": "The first sentence makes a negative statement ('not easily destroyed'). The second sentence makes a strong positive statement that reinforces and emphasizes the first ('it can be remarkably durable'). The transition 'In fact' is used to introduce a statement that emphasizes, confirms, or adds a surprising detail to the previous one.",
    "feedback_a": "'Therefore' indicates a result.",
    "feedback_b": "'Even so' is a contradictor.",
    "feedback_c": "'However' is a contradictor.",
    "feedback_d": "This is the correct answer. 'In fact' correctly emphasizes that not only is straw not weak, it is actually strong."
  }
]
