[
  {
    "question_id": "EOC-G-C5-1",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 5 - Joining Sentences & Fragments - 74-82.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C5",
    "question_number": 1,
    "question_type": "multiple_choice",
    "passage_content": null,
    [cite_start]"question_stem": "When light travels for billions of years, it stretches out into its full <u>spectrum, as the universe expands,</u> light ranges from ultraviolet and visible into infrared radiation. [cite: 79]",
    "option_a": "spectrum, as the universe expands,",
    "option_b": "spectrum. As the universe expands,",
    "option_c": "spectrum as the universe expands,",
    "option_d": "spectrum as the universe expands",
    "correct_answer": "spectrum. As the universe expands,",
    "explanation_original": "When light travels for billions of years, it stretches out into its full spectrum. As the universe expands, light ranges from ultraviolet and visible into infrared radiation.",
    "explanation_ai_enhanced": "The original sentence attempts to join two independent clauses ('it stretches out into its full spectrum' and 'light ranges from ultraviolet...') with a comma, which is a grammatical error known as a comma splice. The correct way to fix this is to separate the two complete thoughts into two distinct sentences using a period. Option B correctly places a period after 'spectrum' and starts a new sentence with 'As the universe expands...'.",
    "feedback_a": "This option creates a comma splice by joining two complete sentences with only a comma.",
    "feedback_b": "This is the correct choice. It properly separates the two independent clauses with a period, forming two grammatically sound sentences.",
    "feedback_c": "This option creates a run-on sentence by fusing two independent clauses with no punctuation at all.",
    "feedback_d": "Similar to option C, this choice also results in a run-on sentence by failing to properly punctuate the boundary between the two independent clauses."
  },
  {
    "question_id": "EOC-G-C5-2",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 5 - Joining Sentences & Fragments - 74-82.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C5",
    "question_number": 2,
    "question_type": "multiple_choice",
    "passage_content": "The artist Lee Lozano was known for her experimental works, some of which were shocking to critics when they first appeared. [cite_start]In 1967, Lozano began her of eleven massive paintings of undulating lines made with shimmery iron-oxide paint. [cite: 80, 81] [cite_start]Each piece measured 96 by 42 inches and was created in one sitting: 2 Wave took eight hours, whereas 96 Wave took three days. [cite: 82]",
    "question_stem": "In 1967, Lozano began her <u>Wave Series, consisting</u> of eleven massive paintings of undulating lines made with shimmery iron-oxide paint.",
    "option_a": "Wave Series, consisting",
    "option_b": "Wave Series. Consisting",
    "option_c": "Wave Series; which consisted",
    "option_d": "Wave Series, it consisted",
    "correct_answer": "Wave Series, consisting",
    "explanation_original": "In 1967, Lozano began her Wave Series, consisting of eleven massive paintings of undulating lines made with shimmery iron-oxide paint.",
    "explanation_ai_enhanced": "The phrase 'consisting of eleven massive paintings...' is a participial phrase that modifies 'Wave Series'. [cite_start]A comma is the correct punctuation to set off this descriptive phrase from the main clause. [cite: 17, 18] Using other punctuation creates errors.",
    "feedback_a": "This is the correct choice. A comma correctly sets off the participial phrase that describes the 'Wave Series'.",
    "feedback_b": "Using a period after 'Series' creates a sentence fragment ('Consisting of...').",
    "feedback_c": "A semicolon is incorrect here because it must be used to separate two independent clauses, and 'which consisted...' is a dependent clause.",
    "feedback_d": "This option creates a comma splice by linking two independent clauses ('Lozano began her Wave Series' and 'it consisted...') with only a comma."
  },
  {
    "question_id": "EOC-G-C5-3",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 5 - Joining Sentences & Fragments - 74-82.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C5",
    "question_number": 3,
    "question_type": "multiple_choice",
    "passage_content": "Wrangell-St. [cite_start]Elias National Park, the largest national park in the United States, represents everything compelling about Alaska. [cite: 84] It is ____ than Belgium. It showcases towering mountains such as Mount St. Elias, which stands more 18,000 feet tall, as well as glaciers.",
    "question_stem": "It is <u>immense; larger, in fact,</u> than Belgium.",
    "option_a": "immense; larger, in fact,",
    "option_b": "immense, larger-in fact",
    "option_c": "immense-larger, in fact,",
    "option_d": "immense larger, in fact-",
    "correct_answer": "immense-larger, in fact,",
    "explanation_original": "It is immense-larger, in fact, than Belgium.",
    "explanation_ai_enhanced": "The phrase 'larger, in fact, than Belgium' serves to explain or elaborate on the word 'immense'. [cite_start]A single dash is an effective tool to set off such an explanatory phrase. [cite: 67] The parenthetical phrase 'in fact' should be enclosed in commas.",
    "feedback_a": "A semicolon's primary role is to connect two independent clauses; it is used incorrectly here to set off an explanatory phrase.",
    "feedback_b": "This option misplaces the dash, incorrectly breaking up the comparative phrase 'larger than'.",
    "feedback_c": "This is the correct choice. It correctly uses a dash to set off the explanation and commas to set off the parenthetical 'in fact'.",
    "feedback_d": "This option lacks the necessary punctuation after 'immense' and misplaces the dash at the end of the phrase."
  },
  {
    "question_id": "EOC-G-C5-4",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 5 - Joining Sentences & Fragments - 74-82.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C5",
    "question_number": 4,
    "question_type": "multiple_choice",
    [cite_start]"passage_content": "The 'molecular trees' that biologists use to map out similarities between species often contradict the classifications that group organisms by their appearance. [cite: 86] [cite_start]Researchers compared both kinds of trees and mapped them based on animals' ____ molecularly similar species were more likely to live near one another than those that looked similar. [cite: 87]",
    "question_stem": "Researchers compared both kinds of trees and mapped them based on animals' <u>locations, and found that</u> molecularly similar species were more likely to live near one another than those that looked similar.",
    "option_a": "locations, and found that",
    "option_b": "locations; finding that",
    "option_c": "locations, they found that",
    "option_d": "locations, finding that",
    "correct_answer": "locations, finding that",
    "explanation_original": "Researchers compared both kinds of trees and mapped them based on animals' locations, finding that molecularly similar species were more likely to live near one another than those that looked similar.",
    "explanation_ai_enhanced": "The phrase 'finding that...' is a participial phrase that explains the result of the action in the main clause ('Researchers compared and mapped...'). [cite_start]Using a comma before this '-ing' phrase is a standard and concise way to connect an action to its result. [cite: 17, 18]",
    "feedback_a": "The comma before 'and' is unnecessary here because the subject 'Researchers' is not repeated. It creates an awkward construction.",
    "feedback_b": "A semicolon is incorrect because the phrase following it, 'finding that...', is a dependent phrase, not an independent clause.",
    "feedback_c": "This option creates a comma splice by linking two independent clauses ('Researchers compared...' and 'they found...') with only a comma.",
    "feedback_d": "This is the correct choice. The participial phrase 'finding that...' correctly modifies the main clause and describes the research outcome."
  },
  {
    "question_id": "EOC-G-C5-5",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 5 - Joining Sentences & Fragments - 74-82.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C5",
    "question_number": 5,
    "question_type": "multiple_choice",
    [cite_start]"passage_content": "African American life during the 1920s was documented in great detail by the writers and artists of the Harlem Renaissance. [cite: 89] [cite_start]Far less is known about it during the ____ the market for their work disappeared almost overnight when the stock market crashed. [cite: 90]",
    "question_stem": "Far less is known about it during the <u>Great Depression in the 1930s,</u> the market for their work disappeared almost overnight when the stock market crashed.",
    "option_a": "Great Depression in the 1930s,",
    "option_b": "Great Depression, in the 1930s,",
    "option_c": "Great Depression: in the 1930s,",
    "option_d": "Great Depression in, the 1930s",
    "correct_answer": "Great Depression: in the 1930s,",
    "explanation_original": "Far less is known about it during the Great Depression: in the 1930s, the market for their work disappeared almost overnight when the stock market crashed.",
    "explanation_ai_enhanced": "This sentence links two independent clauses. The first is 'Far less is known about it during the Great Depression.' The second, 'in the 1930s, the market for their work disappeared...', explains the statement made in the first clause. [cite_start]A colon is correctly used to join two independent clauses when the second clause explains or elaborates on the first. [cite: 60, 61]",
    "feedback_a": "This option creates a comma splice, incorrectly joining two independent clauses with just a comma.",
    "feedback_b": "This option also results in a comma splice and adds an unnecessary comma after 'Depression'.",
    "feedback_c": "This is the correct choice. The clause before the colon is independent, and the clause after it provides a direct explanation, which is a proper use of a colon.",
    "feedback_d": "The punctuation in this choice is illogical and creates an ungrammatical sentence."
  },
  {
    "question_id": "EOC-G-C5-6",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 5 - Joining Sentences & Fragments - 74-82.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C5",
    "question_number": 6,
    "question_type": "multiple_choice",
    [cite_start]"passage_content": "The exact origins of human language remain a major question for evolutionary biologists. [cite: 92] Unique to human language ____ to flexibly recombine a limited sound set into words and sequences, generating an endless series of new sentences. [cite_start]In contrast, the production of these types of sequences in other animals appears limited, stunting their ability to create meaning. [cite: 93]",
    "question_stem": "Unique to human language <u>is: the capacity</u> to flexibly recombine a limited sound set into words and sequences, generating an endless series of new sentences.",
    "option_a": "is: the capacity",
    "option_b": "is the capacity:",
    "option_c": "is the capacity-",
    "option_d": "is the capacity",
    "correct_answer": "is the capacity",
    "explanation_original": "Unique to human language is the capacity to flexibly recombine a limited sound set into words and sequences, generating an endless series of new sentences.",
    "explanation_ai_enhanced": "This sentence uses an inverted structure where the verb 'is' comes before the subject 'the capacity'. No punctuation should be used to separate a verb from its subject, even in an inverted sentence. [cite_start]A colon or dash would be incorrect because the phrase preceding it ('Unique to human language is') is not an independent clause. [cite: 61, 68]",
    "feedback_a": "A colon is incorrect here because the words before it do not form a complete sentence.",
    "feedback_b": "This option incorrectly places a colon between the verb 'is' and its subject 'capacity'.",
    "feedback_c": "A dash is also incorrect here; it unnecessarily separates the verb from its subject.",
    "feedback_d": "This is the correct choice. No punctuation is required between the verb 'is' and its subject 'the capacity'."
  },
  {
    "question_id": "EOC-G-C5-7",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 5 - Joining Sentences & Fragments - 74-82.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C5",
    "question_number": 7,
    "question_type": "multiple_choice",
    [cite_start]"passage_content": "Most of Earth's volcanic activity is concentrated in a few highly active regions. [cite: 95] [cite_start]For example, the geologic instability known as the Pacific Ring of Fire has produced numerous ____ approximately 10,000 earthquakes annually, the ring is dotted with three-quarters of all active volcanoes on Earth. [cite: 95]",
    "question_stem": "For example, the geologic instability known as the Pacific Ring of Fire has produced numerous <u>faults, causing</u> approximately 10,000 earthquakes annually, the ring is dotted with three-quarters of all active volcanoes on Earth.",
    "option_a": "faults causing",
    "option_b": "faults, causing",
    "option_c": "faults. Causing",
    "option_d": "faults, and causes",
    "correct_answer": "faults causing",
    "explanation_original": "For example, the geologic instability known as the Pacific Ring of Fire has produced numerous faults causing approximately 10,000 earthquakes annually, the ring is dotted with three-quarters of all active volcanoes on Earth.",
    "explanation_ai_enhanced": "The question asks for the best way to connect the clauses. The phrase 'causing approximately 10,000 earthquakes annually' acts as a participial phrase modifying 'faults'. Choosing 'faults causing' correctly attaches this modifier. However, it's important to note that the resulting sentence contains a comma splice, as it connects two independent clauses ('The ... instability ... has produced ... faults' and 'the ring is dotted ...') with only a comma. Among the given choices, this is the intended answer despite the grammatical flaw.",
    "feedback_a": "This is the intended answer. It forms a participial phrase modifying 'faults' but results in a sentence containing a comma splice.",
    "feedback_b": "The comma after 'faults' is unnecessary and also results in a comma splice.",
    "feedback_c": "This option creates two sentences, but the second sentence starts with a participial phrase ('Causing...') that may be interpreted as a dangling modifier.",
    "feedback_d": "This option creates a grammatically incorrect structure and also results in a comma splice."
  },
  {
    "question_id": "EOC-G-C5-8",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 5 - Joining Sentences & Fragments - 74-82.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C5",
    "question_number": 8,
    "question_type": "multiple_choice",
    [cite_start]"passage_content": "A novel method of air conditioning-which has been adopted by some of the world's most powerful corporations, uses the simple power of ice. [cite: 96] [cite_start]The system works ____ when lower power usage means that energy is cheaper and lower temperatures require less power to freeze water. [cite: 97]",
    "question_stem": "The system works <u>by making ice at night,</u> when lower power usage means that energy is cheaper and lower temperatures require less power to freeze water.",
    "option_a": "by making ice at night,",
    "option_b": "by: making ice at night",
    "option_c": "by, making ice at night:",
    "option_d": "by-making ice at night",
    "correct_answer": "by making ice at night,",
    "explanation_original": "The system works by making ice at night, when lower power usage means that energy is cheaper and lower temperatures require less power to freeze water.",
    "explanation_ai_enhanced": "The prepositional phrase 'by making ice at night' explains how the system works. No punctuation should interrupt a preposition and its object ('making ice at night'). The comma after 'night' is correct because it separates the independent clause from the following non-essential dependent clause starting with 'when'.",
    "feedback_a": "This is the correct choice. No punctuation is needed within the prepositional phrase, and the comma correctly separates the clauses.",
    [cite_start]"feedback_b": "A colon should not be used here, as the text preceding it ('by') is not an independent clause. [cite: 61]",
    "feedback_c": "The punctuation in this option is illogical and grammatically incorrect.",
    [cite_start]"feedback_d": "A dash should not be used here, as the text preceding it ('by') is not an independent clause. [cite: 68]"
  },
  {
    "question_id": "EOC-G-C5-9",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 5 - Joining Sentences & Fragments - 74-82.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C5",
    "question_number": 9,
    "question_type": "multiple_choice",
    [cite_start]"passage_content": "Before the invention of modern refrigeration, hunger was a part of daily life at sea. [cite: 99] [cite_start]The absence of cool, dry storage spaces put normal pantry staples such as flour and dried beans at a high risk of mold. [cite: 100] [cite_start]The climate also presented preservation ____ fresh fruits and meats was next to impossible in warmer waters. [cite: 101]",
    "question_stem": "The climate also presented preservation <u>problems keeping</u> fresh fruits and meats was next to impossible in warmer waters.",
    "option_a": "problems keeping",
    "option_b": "problems keeping,",
    "option_c": "problems: keeping",
    "option_d": "problems, keeping",
    "correct_answer": "problems: keeping",
    "explanation_original": "The climate also presented preservation problems: keeping fresh fruits and meats was next to impossible in warmer waters.",
    "explanation_ai_enhanced": "A colon is used to introduce an explanation or an example for the preceding clause. Here, the clause 'keeping fresh fruits and meats was next to impossible in warmer waters' serves as a direct explanation of the 'preservation problems'. [cite_start]Since the part before the blank ('The climate also presented preservation problems') is an independent clause, a colon is the appropriate punctuation. [cite: 61]",
    "feedback_a": "This option creates a run-on sentence by fusing two independent clauses without punctuation.",
    "feedback_b": "This option creates a comma splice by incorrectly joining two independent clauses with only a comma.",
    "feedback_c": "This is the correct choice. The colon properly introduces an explanation that follows a complete sentence.",
    "feedback_d": "This option is functionally identical to option B and also creates a comma splice."
  },
  {
    "question_id": "EOC-G-C5-10",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 5 - Joining Sentences & Fragments - 74-82.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C5",
    "question_number": 10,
    "question_type": "multiple_choice",
    [cite_start]"passage_content": "Determined to create an original American architecture, Frank Lloyd Wright set the standard for what became known as the Prairie Style. [cite: 102] [cite_start]Because the homes he designed had flat roofs, no attics or basements, and long rows of windows that further emphasized the horizontal ____ reflected the long, low fields on which they sat. [cite: 103]",
    "question_stem": "Because the homes he designed had flat roofs, no attics or basements, and long rows of windows that further emphasized the horizontal <u>theme; they</u> reflected the long, low fields on which they sat.",
    "option_a": "theme; they",
    "option_b": "theme, so they",
    "option_c": "theme, they",
    "option_d": "theme they",
    "correct_answer": "theme, they",
    "explanation_original": "Because the homes he designed had flat roofs, no attics or basements, and long rows of windows that further emphasized the horizontal theme, they reflected the long, low fields on which they sat.",
    "explanation_ai_enhanced": "The sentence begins with an introductory dependent clause starting with 'Because'. [cite_start]According to grammatical rules, when a dependent clause comes before an independent clause, it must be separated by a comma. [cite: 6] Using a semicolon or an additional conjunction like 'so' is incorrect.",
    "feedback_a": "A semicolon is incorrect because it cannot be used to separate a dependent clause from an independent clause.",
    "feedback_b": "This option creates a redundancy error. [cite_start]Since the sentence already begins with the subordinating conjunction 'Because', adding the coordinating conjunction 'so' is grammatically incorrect. [cite: 28]",
    "feedback_c": "This is the correct choice. [cite_start]A comma is required after an introductory dependent clause. [cite: 6]",
    "feedback_d": "This option creates a run-on sentence by omitting the necessary comma after the introductory clause."
  },
  {
    "question_id": "EOC-G-C5-11",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 5 - Joining Sentences & Fragments - 74-82.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C5",
    "question_number": 11,
    "question_type": "multiple_choice",
    "passage_content": "The northern snakehead is aptly ____ it look as if someone-perhaps a mad scientist-had grafted a snake's head and several inches of scaly body onto a fish. [cite_start]Its fins hang unevenly from its body, as though they were tacked on as an afterthought. [cite: 105] [cite_start]Given the fish's wild appearance, it is hardly a surprise that researchers refer to it as Frankenfish. [cite: 106]",
    "question_stem": "The northern snakehead is aptly <u>named: its head tapers to a point, making</u> it look as if someone-perhaps a mad scientist-had grafted a snake's head and several inches of scaly body onto a fish.",
    "option_a": "named: its head tapers to a point, making it look as if someone-",
    "option_b": "named, its head tapers to a point, making it look as if someone-",
    "option_c": "named-its head tapers to a point, making it look as if someone,",
    "option_d": "named-its head tapers to a point, making it look as if someone-",
    "correct_answer": "named: its head tapers to a point, making it look as if someone-",
    "explanation_original": "The northern snakehead is aptly named: its head tapers to a point, making it look as if someone-perhaps a mad scientist-had grafted a snake's head and several inches of scaly body onto a fish.",
    "explanation_ai_enhanced": "The first part of the sentence, 'The northern snakehead is aptly named,' is a complete independent clause. The information that follows explains *why* the name is apt. [cite_start]A colon is the correct punctuation to introduce an explanation or elaboration that follows an independent clause. [cite: 61]",
    "feedback_a": "This is the correct choice. A colon is used appropriately to introduce the explanation that follows the independent clause.",
    "feedback_b": "This option results in a comma splice, an error created by joining two independent clauses with only a comma.",
    "feedback_c": "While a dash can sometimes be used like a colon, this option incorrectly punctuates the parenthetical phrase 'perhaps a mad scientist' with a comma instead of a second dash.",
    "feedback_d": "This option uses a dash, which is a possible alternative to a colon. However, the colon in option A is a slightly more conventional choice for introducing a direct explanation."
  },
  {
    "question_id": "EOC-G-C5-12",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 5 - Joining Sentences & Fragments - 74-82.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C5",
    "question_number": 12,
    "question_type": "multiple_choice",
    [cite_start]"passage_content": "Every spring, swarms of colorful, painted lady butterflies appear in California as they make their way from western Mexico to the Pacific Northwest. [cite: 107] Some years, there are millions of migrating ____ need access to nutrients. [cite_start]Moreover, California is home to resident painted lady populations that require food sources year-round. [cite: 109]",
    [cite_start]"question_stem": "Some years, there are millions of migrating <u>butterflies, which all of them</u> need access to nutrients. [cite: 108]",
    "option_a": "butterflies, which all of them",
    "option_b": "butterflies, all of them",
    "option_c": "butterflies, all of them",
    "option_d": "butterflies, all of which",
    "correct_answer": "butterflies, all of which",
    "explanation_original": "Some years, there are millions of migrating butterflies, all of which need access to nutrients.",
    "explanation_ai_enhanced": "This question tests the use of relative clauses to add information. The phrase 'all of which need access to nutrients' is a non-essential clause modifying 'butterflies'. [cite_start]The phrase 'all of which' is the correct construction to begin this type of clause, with 'which' properly referring to the butterflies. [cite: 24]",
    "feedback_a": "This phrasing is redundant and ungrammatical. 'Which' and 'them' are both acting as pronouns for 'butterflies'.",
    "feedback_b": "This choice creates a comma splice. 'All of them need access to nutrients' is an independent clause, and it cannot be joined to the preceding clause with only a comma.",
    "feedback_c": "This option is identical to option B and is also incorrect for the same reason.",
    "feedback_d": "This is the correct choice. It properly uses 'all of which' to introduce a non-essential clause that describes the butterflies."
  },
  {
    "question_id": "EOC-G-C5-13",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 5 - Joining Sentences & Fragments - 74-82.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C5",
    "question_number": 13,
    "question_type": "multiple_choice",
    [cite_start]"passage_content": "The relationship between humans and the natural world is central to Ada Lim贸n's ____ her collection The Hurting Kind, her narrators learn from nature how to understand and convey their feelings, reactions and memories. [cite: 111]",
    "question_stem": "The relationship between humans and the natural world is central to Ada Lim贸n's <u>poetry in</u> her collection The Hurting Kind, her narrators learn from nature how to understand and convey their feelings, reactions and memories.",
    "option_a": "poetry in",
    "option_b": "poetry, in",
    "option_c": "poetry. In",
    "option_d": "poetry in,",
    "correct_answer": "poetry. In",
    "explanation_original": "The relationship between humans and the natural world is central to Ada Lim贸n's poetry. In her collection The Hurting Kind, her narrators learn from nature how to understand and convey their feelings, reactions and memories.",
    "explanation_ai_enhanced": "The text consists of two complete, independent thoughts. The first is 'The relationship between humans and the natural world is central to Ada Lim贸n's poetry.' The second is 'In her collection The Hurting Kind, her narrators learn...'. Joining these two independent clauses with a comma or no punctuation would be incorrect. A period is required to separate them into two distinct sentences.",
    "feedback_a": "This option creates a run-on sentence by joining two independent clauses with no punctuation.",
    "feedback_b": "This option creates a comma splice by joining two independent clauses with only a comma.",
    "feedback_c": "This is the correct choice. A period correctly separates the two independent clauses into two grammatical sentences.",
    "feedback_d": "The comma placement in this option is illogical and does not form a correct sentence."
  },
  {
    "question_id": "EOC-G-C5-14",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 5 - Joining Sentences & Fragments - 74-82.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C5",
    "question_number": 14,
    "question_type": "multiple_choice",
    [cite_start]"passage_content": "The appearance of mosaic-pictures made of many small pieces-has remained unchanged for thousands of years. [cite: 112] However, the last few decades have seen the emergence of a new ____ three-dimensional stone wall murals. [cite_start]One such mural was produced by Janna Morrison in 2005. [cite: 114] [cite_start]She combined the piecework of mosaic murals with traditional soapstone slab carving. [cite: 114]",
    [cite_start]"question_stem": "However, the last few decades have seen the emergence of a new <u>style, colorful,</u> three-dimensional stone wall murals. [cite: 113]",
    "option_a": "style, colorful,",
    "option_b": "style: colorful,",
    "option_c": "style, colorful-",
    "option_d": "style; colorful",
    "correct_answer": "style: colorful,",
    "explanation_original": "However, the last few decades have seen the emergence of a new style: colorful, three-dimensional stone wall murals.",
    "explanation_ai_enhanced": "The phrase 'colorful, three-dimensional stone wall murals' functions as a definition or specification of the 'new style' that precedes it. [cite_start]A colon is the appropriate punctuation to introduce a list, definition, or explanation that follows a complete sentence. [cite: 61] The clause 'However, the last few decades have seen the emergence of a new style' is an independent clause.",
    "feedback_a": "The comma usage in this option incorrectly separates the defining phrase from the noun it describes.",
    "feedback_b": "This is the correct choice. A colon is used effectively to introduce a phrase that specifies the 'new style'.",
    "feedback_c": "The combination of a comma and a dash is an incorrect and nonstandard way to punctuate this sentence.",
    "feedback_d": "A semicolon is incorrect because it is used to connect two independent clauses, and the phrase 'colorful, three-dimensional stone wall murals' is not an independent clause."
  },
  {
    "question_id": "EOC-G-C5-15",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 5 - Joining Sentences & Fragments - 74-82.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C5",
    "question_number": 15,
    "question_type": "multiple_choice",
    [cite_start]"passage_content": "Researchers have long believed that camels originated in North America, a theory that was first proposed after a camel fossil was discovered in Canada's Yukon Territory in 1913. As paleontologists eventually discovered, these camels were much larger than their modern ____ long, massive limbs and long spines on their backs, creating an enormous hump. [cite: 115]",
    "question_stem": "As paleontologists eventually discovered, these camels were much larger than their modern <u>counterparts, they had</u> long, massive limbs and long spines on their backs, creating an enormous hump.",
    "option_a": "counterparts, they had",
    "option_b": "counterparts-they had",
    "option_c": "counterparts; having",
    "option_d": "counterparts they had",
    "correct_answer": "counterparts-they had",
    "explanation_original": "As paleontologists eventually discovered, these camels were much larger than their modern counterparts-they had long, massive limbs and long spines on their backs, creating an enormous hump.",
    "explanation_ai_enhanced": "This sentence presents two closely related independent clauses. The first is 'these camels were much larger than their modern counterparts'. The second, 'they had long, massive limbs...', explains the first. [cite_start]A dash can be used to connect two independent clauses, particularly when the second one explains or elaborates on the first. [cite: 67, 68]",
    "feedback_a": "This option creates a comma splice by incorrectly joining two independent clauses with only a comma.",
    "feedback_b": "This is the correct choice. A dash effectively connects the two independent clauses, with the second clause providing a clear explanation for the first.",
    "feedback_c": "A semicolon should be followed by an independent clause. 'Having...' is a participial phrase, not an independent clause, making this option ungrammatical.",
    "feedback_d": "This option creates a run-on sentence by fusing two independent clauses together with no punctuation."
  }
]
