[
  {
    "question_id": "EOC-M-C28-1",
    "source_file_name": "Math - Chapter 28 - Statistics II - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C28",
    "question_number": 1,
    "difficulty": "Easy",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Graphical_Analysis",
    "Sub_Classification": "Interpretation",
    "Concept_Classification": "Data_Read_Scatterplot",
    "question_type": "multiple_choice",
    "image_url": "EOC-M-C28-1_image.png",
    "option_a": "1",
    "option_b": "2",
    "option_c": "3",
    "option_d": "4",
    "option_e": null,
    "correct_answer": "2",
    "explanation_original": "There are 2 points above the line of best fit when the value along the x-axis is 19.",
    "explanation_ai_enhanced": "To solve this, first locate the age of 19 on the x-axis. Then, identify the line of best fit at that x-value. The line predicts a certain shoe size for a 19-year-old. The question asks for the number of actual data points (dots) for 19-year-olds that are vertically above this line. Looking at the vertical line for Age = 19, we can see the line of best fit passes through approximately shoe size 11. There are two data points plotted for 19-year-olds that are clearly above the line of best fit.",
    "feedback_a": "This is incorrect. There is one data point right on the line of best fit, but the question asks for points greater than the prediction.",
    "feedback_b": "This is the correct answer. At age 19 on the x-axis, there are two data points that are vertically above the line of best fit.",
    "feedback_c": "This is incorrect. There are three data points in total for age 19, but one is on the line, not above it.",
    "feedback_d": "This is incorrect. There are not four data points for age 19.",
    "passage_content": null,
    "question_stem": "The scatterplot above shows the relationship between age, in years, and shoe size for 24 males between 10 and 20 years old. The line of best fit is also shown. Based on the data, how many 19 year old males had a shoe size greater than the one predicted by the line of best fit?"
  },
  {
    "question_id": "EOC-M-C28-2",
    "source_file_name": "Math - Chapter 28 - Statistics II - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C28",
    "question_number": 2,
    "difficulty": "Easy",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Percentages",
    "Sub_Classification": "Calculations",
    "Concept_Classification": "Data_Percentages",
    "question_type": "student_produced_response",
    "image_url": null,
    "option_a": "",
    "option_b": "",
    "option_c": "",
    "option_d": "",
    "option_e": null,
    "correct_answer": "2",
    "explanation_original": "Note that the sample size of 400 is irrelevant information. To make things easier, we'll let x be a decimal for now and convert it to a percentage later, $3,300x = 66$, $x = 0.02 = 2\\%$",
    "explanation_ai_enhanced": "The problem states that the university expects 66 physics majors out of a class of 3,300 students. This expectation is based on the survey where x percent of students planned to major in physics. We need to find what percentage 66 is of 3,300. Let the percentage be $p$. The relationship is: $p \\times 3,300 = 66$. To find the percentage as a decimal, divide 66 by 3,300: $\\frac{66}{3300} = \\frac{1}{50} = 0.02$. To convert this decimal to a percentage, multiply by 100: $0.02 \\times 100 = 2$. So, the value of x is 2.",
    "feedback_a": "",
    "feedback_b": "",
    "feedback_c": "",
    "feedback_d": "",
    "passage_content": null,
    "question_stem": "In a survey of 400 seniors, x percent said that they plan on majoring in physics. One university has used this data to estimate the number of physics majors it expects for its entering class of 3,300 students. If the university expects 66 physics majors, what is the value of x ?"
  },
  {
    "question_id": "EOC-M-C28-3",
    "source_file_name": "Math - Chapter 28 - Statistics II - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C28",
    "question_number": 3,
    "difficulty": "Easy",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Graphical_Analysis",
    "Sub_Classification": "Interpretation",
    "Concept_Classification": "Data_Line_Of_Best_Fit",
    "question_type": "multiple_choice",
    "image_url": "EOC-M-C28-3_image.png",
    "option_a": "40",
    "option_b": "50",
    "option_c": "55",
    "option_d": "60",
    "option_e": null,
    "correct_answer": "55",
    "explanation_original": "The line of best fit gives a y-value of 55 when the x-value is 75.",
    "explanation_ai_enhanced": "The line of best fit is used to make predictions. To find the predicted value for 75 traffic lights, we must locate 75 on the x-axis (Number of traffic lights) and find the corresponding y-value (Average weekly number of traffic light violations) on the line of best fit. Find 75 on the x-axis, move vertically up to the line of best fit, and then move horizontally to the left to read the value on the y-axis. The point on the line of best fit corresponding to an x-value of 75 aligns with a y-value of approximately 55.",
    "feedback_a": "This is incorrect. 40 on the y-axis corresponds to an x-value of about 50 on the line of best fit.",
    "feedback_b": "This is incorrect. 50 on the y-axis corresponds to an x-value of about 62 on the line of best fit.",
    "feedback_c": "This is the correct answer. Following the grid lines from 75 on the x-axis up to the line of best fit and then across to the y-axis leads directly to the 55 mark.",
    "feedback_d": "This is incorrect. 60 on the y-axis corresponds to an x-value of about 85 on the line of best fit.",
    "passage_content": null,
    "question_stem": "The scatterplot above shows the number of traffic lights in 15 towns and the average weekly number of traffic light violations that occur in each town. The line of best fit is also shown. Based on the line of best fit, which of the following is the predicted average weekly number of traffic light violations in a town with 75 traffic lights?"
  },
  {
    "question_id": "EOC-M-C28-4",
    "source_file_name": "Math - Chapter 28 - Statistics II - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C28",
    "question_number": 4,
    "difficulty": "Medium",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Statistics",
    "Sub_Classification": "Study_Methods",
    "Concept_Classification": "Data_Evaluate_Study_Conclusion",
    "question_type": "multiple_choice",
    "image_url": null,
    "option_a": "Selecting a random sample of 600 students from the university",
    "option_b": "Selecting a random sample of 300 students from the university's freshman class",
    "option_c": "Selecting a random sample of 600 students from the university's freshman class",
    "option_d": "Selecting a random sample of 600 students from one of the university's freshman dining halls",
    "option_e": null,
    "correct_answer": "Selecting a random sample of 600 students from the university's freshman class",
    "explanation_original": "First, the survey should be conducted with students from the university's freshman class since that's the intended target. Secondly, the larger the sample, the more valid the results.",
    "explanation_ai_enhanced": "For a survey to have valid results, the sample must be representative of the population of interest. The population of interest is the 'freshman class.' Therefore, we must sample from the freshman class. Options A is incorrect because it samples from the entire university, not just freshmen. Option D is incorrect because sampling from one dining hall might introduce bias (e.g., that dining hall might have specific food options that attract certain students). Between B and C, both sample correctly from the freshman class. However, a larger random sample size generally leads to a more reliable and valid result (a smaller margin of error). Therefore, a sample of 600 is better than a sample of 300.",
    "feedback_a": "This is incorrect. The sample is not drawn from the specific population of interest, which is the freshman class.",
    "feedback_b": "This is a good sample, but it is smaller than the sample in option C. A larger sample size generally yields more valid results.",
    "feedback_c": "This is the correct answer. It selects from the correct population (the freshman class) and has the largest sample size, which is most likely to produce valid results.",
    "feedback_d": "This is incorrect. Sampling from only one dining hall could introduce bias and not be representative of the entire freshman class.",
    "passage_content": null,
    "question_stem": "A university wants to determine the dietary preferences of the students in its freshman class. Which of the following survey methods is most likely to provide the most valid results?"
  },
  {
    "question_id": "EOC-M-C28-5",
    "source_file_name": "Math - Chapter 28 - Statistics II - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C28",
    "question_number": 5,
    "difficulty": "Medium",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Rates_Ratios_Proportions",
    "Sub_Classification": "Calculations",
    "Concept_Classification": "Data_Rates_Ratios_Proportions",
    "question_type": "multiple_choice",
    "image_url": null,
    "option_a": "60,000",
    "option_b": "130,000",
    "option_c": "220,000",
    "option_d": "280,000",
    "option_e": null,
    "correct_answer": "60,000",
    "explanation_original": "Using proportions, Candidate A is expected to receive $\\frac{110}{250} \\times 500,000 = 220,000$ votes. Candidate B is expected to receive $\\frac{140}{250} \\times 500,000 = 280,000$ votes. So Candidate B is expected to receive $280,000 - 220,000 = 60,000$ more votes.",
    "explanation_ai_enhanced": "We can use the proportions from the sample to predict the outcome for the entire voting population. First, find the proportion of the sample that supported each candidate. Candidate A: $\\frac{110}{250}$. Candidate B: $\\frac{140}{250}$. Now, apply these proportions to the total expected voters (500,000). Expected votes for A: $\\frac{110}{250} \\times 500,000 = 110 \\times 2,000 = 220,000$. Expected votes for B: $\\frac{140}{250} \\times 500,000 = 140 \\times 2,000 = 280,000$. The question asks how many more votes B will receive than A: $280,000 - 220,000 = 60,000$.",
    "feedback_a": "This is the correct answer, representing the difference between the projected votes for Candidate B ($280,000$) and Candidate A ($220,000$).",
    "feedback_b": "This is incorrect. This value does not correspond to the difference in projected votes based on the sample proportions.",
    "feedback_c": "This is incorrect. This is the projected number of votes for Candidate A, not the difference between the candidates.",
    "feedback_d": "This is incorrect. This is the projected number of votes for Candidate B, not the difference between the candidates.",
    "passage_content": null,
    "question_stem": "Two candidates are running for governor of a state. A recent poll reports that out of a random sample of 250 voters, 110 support Candidate A and 140 support Candidate B. An estimated 500,000 state residents are expected to vote on election day. According to the poll, Candidate B is expected to receive how many more votes than Candidate A?"
  },
  {
    "question_id": "EOC-M-C28-6",
    "source_file_name": "Math - Chapter 28 - Statistics II - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C28",
    "question_number": 6,
    "difficulty": "Easy",
    "domain": "Algebra",
    "Primary_Classification": "Linear_Equations",
    "Sub_Classification": "Solving_And_Interpreting",
    "Concept_Classification": "Algebra_Interpret_Y_Intercept_Context",
    "question_type": "multiple_choice",
    "image_url": "EOC-M-C28-6_image.png",
    "option_a": "The predicted average shopping time, in minutes, of customers at a store offering no discount",
    "option_b": "The predicted average shopping time, in minutes, of customers at a store offering a 50% discount",
    "option_c": "The predicted increase in the average shopping time, in minutes, for each one percent increase in the store discount",
    "option_d": "The predicted average number of customers at a store offering no discount",
    "option_e": null,
    "correct_answer": "The predicted average shopping time, in minutes, of customers at a store offering no discount",
    "explanation_original": "The y-intercept is the value of y when the value of x is 0. In this case, it's the average shopping time when the store discount is 0% (no discount).",
    "explanation_ai_enhanced": "The y-intercept of a line of best fit represents the predicted value of the y-variable when the x-variable is equal to 0. In this context, the y-variable is 'Average shopping time (minutes)' and the x-variable is 'Store Discount (%)'. Therefore, the y-intercept is the predicted average shopping time in minutes when the store discount is 0%.",
    "feedback_a": "This is the correct answer. It correctly identifies the y-intercept as the value of the y-variable (average shopping time) when the x-variable (store discount) is zero.",
    "feedback_b": "This is incorrect. This would be the predicted y-value when x is 50, not the y-intercept.",
    "feedback_c": "This is incorrect. This describes the slope of the line, not the y-intercept. The slope represents the change in y for a one-unit change in x.",
    "feedback_d": "This is incorrect. The y-variable is shopping time, not the number of customers.",
    "passage_content": null,
    "question_stem": "Shopping time refers to the time a customer spends in one store. The scatterplot above shows the average shopping time, in minutes, of customers at 26 different stores offering various discounts. The line of best fit is also shown. Which of the following is the best interpretation of the meaning of the y-intercept of the line of best fit?"
  },
  {
    "question_id": "EOC-M-C28-7",
    "source_file_name": "Math - Chapter 28 - Statistics II - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C28",
    "question_number": 7,
    "difficulty": "Medium",
    "domain": "Algebra",
    "Primary_Classification": "Linear_Equations",
    "Sub_Classification": "Solving_And_Interpreting",
    "Concept_Classification": "Algebra_Interpret_Slope_Context",
    "question_type": "multiple_choice",
    "image_url": "EOC-M-C28-7_image.png",
    "option_a": "The expected increase in revenue for every one dollar increase in advertising expenses",
    "option_b": "The expected increase in revenue for every one thousand dollar increase in advertising expenses",
    "option_c": "The expected increase in advertising expenses for every one thousand dollar increase in revenue",
    "option_d": "The expected revenue of a company that has no advertising expenses",
    "option_e": null,
    "correct_answer": "The expected increase in revenue for every one dollar increase in advertising expenses",
    "explanation_original": "The slope is rise over run. Because the line of best fit has a positive slope, it's the increase in revenue for every dollar increase in advertising expenses. Note that because both revenue and advertising expenses are expressed in thousands of dollars in the graph, they cancel out and have no effect on the interpretation of the slope. That's why the answer isn't (B).",
    "explanation_ai_enhanced": "The slope of a line of best fit represents the predicted change in the y-variable for each one-unit increase in the x-variable. Here, y is 'Revenue (in thousands of dollars)' and x is 'Advertising Expenses (in thousands of dollars)'. A positive slope means an increase. So the slope is the expected increase in Revenue for a one-unit increase in Advertising Expenses. Since both axes are in 'thousands of dollars', a one-unit increase in x (e.g., from 10 to 11) represents a $1,000 increase in ad spend, and the corresponding change in y is also in thousands. The ratio (slope) simplifies to the increase in revenue dollars for every one dollar increase in ad dollars.",
    "feedback_a": "This is the correct answer. The slope represents the change in y per unit change in x. Since the units (thousands of dollars) on both axes are the same, they cancel out, giving the direct relationship between revenue dollars and ad dollars.",
    "feedback_b": "This is incorrect because the units on the axes are both 'thousands of dollars'. A one-unit change on the x-axis already represents a one-thousand-dollar increase.",
    "feedback_c": "This is incorrect. This reverses the relationship, describing the change in x for a change in y (run/rise).",
    "feedback_d": "This is incorrect. This describes the y-intercept, which is the predicted revenue when advertising expenses are zero.",
    "passage_content": null,
    "question_stem": "The scatterplot above shows the relationship between revenue and advertising expenses for 16 companies. The line of best fit is also shown. Which of the following is the best interpretation of the meaning of the slope of the line of best fit?"
  },
  {
    "question_id": "EOC-M-C28-8",
    "source_file_name": "Math - Chapter 28 - Statistics II - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C28",
    "question_number": 8,
    "difficulty": "Easy",
    "domain": "Algebra",
    "Primary_Classification": "Linear_Equations",
    "Sub_Classification": "Solving_And_Interpreting",
    "Concept_Classification": "Algebra_Interpret_Slope_Context",
    "question_type": "multiple_choice",
    "image_url": "EOC-M-C28-8_image.png",
    "option_a": "The expected decrease in box office sales per minute increase in movie length",
    "option_b": "The expected increase in box office sales per minute increase in movie length",
    "option_c": "The expected decrease in box office sales per 10-minute increase in movie length",
    "option_d": "The expected increase in box office sales per 10-minute increase in movie length",
    "option_e": null,
    "correct_answer": "The expected increase in box office sales per minute increase in movie length",
    "explanation_original": "The slope is rise over run. Because the line of best fit has a positive slope, it's the increase in box office sales per minute increase in movie length.",
    "explanation_ai_enhanced": "The slope represents the change in the y-variable for a one-unit increase in the x-variable. Here, y is 'Box Office Sales (in millions of dollars)' and x is 'Movie Length (minutes)'. The line of best fit has a positive slope (it goes up from left to right), which indicates an increase. Therefore, the slope is the expected increase in box office sales for every one-minute increase in movie length.",
    "feedback_a": "This is incorrect. The slope is positive, indicating an expected increase, not a decrease.",
    "feedback_b": "This is the correct answer. It correctly identifies the relationship as an increase (positive slope) in the y-variable (box office sales) per one-unit increase in the x-variable (movie length).",
    "feedback_c": "This is incorrect. The slope is positive, indicating an increase, and it's measured per single minute, not per 10 minutes.",
    "feedback_d": "This is incorrect. While the relationship is an increase, the slope is defined as the change per single unit (one minute), not a 10-unit change.",
    "passage_content": null,
    "question_stem": "The scatterplot above plots the lengths of 15 movies against their box office sales. The line of best fit is also shown. Which of the following is the best interpretation of the meaning of the slope of the line of best fit?"
  },
  {
    "question_id": "EOC-M-C28-9",
    "source_file_name": "Math - Chapter 28 - Statistics II - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C28",
    "question_number": 9,
    "difficulty": "Medium",
    "domain": "Algebra",
    "Primary_Classification": "Linear_Equations",
    "Sub_Classification": "Solving_And_Interpreting",
    "Concept_Classification": "Algebra_Interpret_Y_Intercept_Context",
    "question_type": "multiple_choice",
    "image_url": "EOC-M-C28-9_image.png",
    "option_a": "The expected decrease in the number of mistakes made per dollar increase in the cash prize",
    "option_b": "The expected increase in the number of mistakes made per dollar increase in the cash prize",
    "option_c": "The expected dollar amount of the cash prize required for a person to complete the task with 0 mistakes",
    "option_d": "The expected number of mistakes a person makes in completing the task when no cash prize is offered",
    "option_e": null,
    "correct_answer": "The expected number of mistakes a person makes in completing the task when no cash prize is offered",
    "explanation_original": "The y-intercept is the value of y when the value of x is 0. In this case, it's the expected number of mistakes made when the cash prize is 0 dollars (no cash prize).",
    "explanation_ai_enhanced": "The y-intercept of a line of best fit is the predicted value of the y-variable when the x-variable is 0. In this graph, the y-variable is the 'Number of mistakes made' and the x-variable is the 'Prize (in dollars)'. Therefore, the y-intercept represents the expected number of mistakes made when the prize is 0 dollars, meaning no cash prize is offered.",
    "feedback_a": "This describes the slope of the line, as it's a rate of change (mistakes per dollar).",
    "feedback_b": "This also describes the slope of the line.",
    "feedback_c": "This is incorrect. This would be the x-intercept, the value of x when y is 0.",
    "feedback_d": "This is the correct answer. It correctly defines the y-intercept as the value of y (number of mistakes) when x (prize amount) is zero.",
    "passage_content": null,
    "question_stem": "In a psychological study, researchers asked participants to each complete a difficult task for a cash prize, the amount of which varied from participant to participant. The results of the study, as well as the line of best fit, are shown in the scatterplot above. Which of the following is the best interpretation of the meaning of the y-intercept of the line of best fit?"
  },
  {
    "question_id": "EOC-M-C28-10",
    "source_file_name": "Math - Chapter 28 - Statistics II - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C28",
    "question_number": 10,
    "difficulty": "Medium",
    "domain": "Algebra",
    "Primary_Classification": "Linear_Equations",
    "Sub_Classification": "Solving_And_Interpreting",
    "Concept_Classification": "Algebra_Interpret_Slope_Context",
    "question_type": "multiple_choice",
    "image_url": "EOC-M-C28-10_image.png",
    "option_a": "5",
    "option_b": "8",
    "option_c": "20",
    "option_d": "40",
    "option_e": null,
    "correct_answer": "8",
    "explanation_original": "This question is asking for the slope of the line of best fit. At 20 grams of fat, there are 340 calories. At 25 grams of fat, there are 380 calories. Calculating the slope from two points, $\\frac{(380-340)}{(25-20)} = \\frac{40}{5} = 8$.",
    "explanation_ai_enhanced": "The question asks for the 'expected increase in the number of calories for each additional gram of fat', which is the definition of the slope of the line of best fit. We can calculate the slope by picking two points on the line. Let's pick the points corresponding to $x=20$ and $x=25$. At $x=20$ grams, the line passes through $y=340$ calories. At $x=25$ grams, the line passes through $y=380$ calories. The slope is the change in y divided by the change in x: $Slope = \\frac{\\text{change in calories}}{\\text{change in fat}} = \\frac{380 - 340}{25 - 20} = \\frac{40}{5} = 8$. So, the expected increase is 8 calories per gram of fat.",
    "feedback_a": "This value is the change in fat grams used in the slope calculation, not the slope itself.",
    "feedback_b": "This is the correct answer. The slope of the line of best fit, calculated from points (20, 340) and (25, 380) on the line, is 8.",
    "feedback_c": "This is incorrect. This might be the x-value of one of the points, not the slope.",
    "feedback_d": "This is the change in calories used in the slope calculation, not the slope itself (which is the rate).",
    "passage_content": null,
    "question_stem": "The scatterplot above shows the fat content and calorie counts of 8 different cups of ice cream. Based on the line of best fit to the data shown, what is the expected increase in the number of calories for each additional gram of fat in a cup of ice cream?"
  },
  {
    "question_id": "EOC-M-C28-11",
    "source_file_name": "Math - Chapter 28 - Statistics II - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C28",
    "question_number": 11,
    "difficulty": "Medium",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Rates_Ratios_Proportions",
    "Sub_Classification": "Calculations",
    "Concept_Classification": "Data_Rates_Ratios_Proportions",
    "question_type": "multiple_choice",
    "image_url": "EOC-M-C28-11_image.png",
    "option_a": "479",
    "option_b": "585",
    "option_c": "1063",
    "option_d": "1099",
    "option_e": null,
    "correct_answer": "585",
    "explanation_original": "Apply what you learn from the sample to the larger population. From the sample size, $\\frac{\\text{Car Speeding Violations}}{\\text{Total Violations}} = \\frac{83}{284}$. Now we can apply this same proportion to the state total of 2,000: $\\frac{83}{284} \\times 2,000 \\approx 585$.",
    "explanation_ai_enhanced": "First, we need to find the proportion of total violations that were speeding violations committed by cars, based on the sample data in the table. From the table, there were 83 speeding violations by cars, and the total number of all violations was 284. The proportion is $\\frac{83}{284}$. To estimate the number for 2,000 total violations, we multiply the total by this proportion: $2,000 \\times \\frac{83}{284} \\approx 2,000 \\times 0.2922 \\approx 584.5$. The closest answer is 585.",
    "feedback_a": "This may result from using an incorrect proportion, perhaps only car violations in the denominator.",
    "feedback_b": "This is the correct answer. The proportion of car speeding violations in the sample is $\\frac{83}{284}$. Applying this to the state total gives $2,000 \\times \\frac{83}{284} \\approx 585$.",
    "feedback_c": "This is incorrect. This might result from using the total number of speeding violations (151) instead of just car speeding violations.",
    "feedback_d": "This is incorrect. This likely comes from a miscalculation of the proportion.",
    "passage_content": null,
    "question_stem": "A record of driving violations by type and vehicle is shown below. If the data is used to estimate driving violation information about 2,000 total violations in a certain state, which of the following is the best estimate of the number of speeding violations committed by cars in the state?"
  },
  {
    "question_id": "EOC-M-C28-12",
    "source_file_name": "Math - Chapter 28 - Statistics II - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C28",
    "question_number": 12,
    "difficulty": "Hard",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Graphical_Analysis",
    "Sub_Classification": "Interpretation",
    "Concept_Classification": "Data_Line_Of_Best_Fit",
    "question_type": "multiple_choice",
    "image_url": "EOC-M-C28-12_image.png",
    "option_a": "200",
    "option_b": "350",
    "option_c": "400",
    "option_d": "450",
    "option_e": null,
    "correct_answer": "350",
    "explanation_original": "The oat field whose yield is best predicted by the line of best fit is represented by the point closest to the line. That point has an x-value of 350, which is the amount of nitrogen applied to that field.",
    "explanation_ai_enhanced": "The question asks to identify the data point for which the line of best fit makes the best prediction. In a scatterplot, the best-predicted point is the actual data point that lies closest to the line of best fit. By visually inspecting the graph, we can see that the data point at an x-value of 350 is almost exactly on the line of best fit. All other points are a noticeable distance away from the line. Therefore, the amount of nitrogen applied for this field is 350 pounds per acre.",
    "feedback_a": "This data point is significantly below the line of best fit, so its yield is not well-predicted by the line.",
    "feedback_b": "This is the correct answer. The data point at x=350 is the closest to the line of best fit, meaning its yield is the best predicted among all points.",
    "feedback_c": "This data point is above the line of best fit.",
    "feedback_d": "This data point is also above the line of best fit.",
    "passage_content": null,
    "question_stem": "The scatterplot above shows the amount of nitrogen fertilizer applied to 8 oat fields and their yields. The line of best fit is also shown. Which of the following is closest to the amount of nitrogen applied, in pounds per acre, to the oat field whose yield is best predicted by the line of best fit?"
  },
  {
    "question_id": "EOC-M-C28-13",
    "source_file_name": "Math - Chapter 28 - Statistics II - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C28",
    "question_number": 13,
    "difficulty": "Hard",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Graphical_Analysis",
    "Sub_Classification": "Interpretation",
    "Concept_Classification": "Data_Read_Scatterplot",
    "question_type": "multiple_choice",
    "image_url": "EOC-M-C28-13_image.png",
    "option_a": "200",
    "option_b": "240",
    "option_c": "320",
    "option_d": "560",
    "option_e": null,
    "correct_answer": "560",
    "explanation_original": "The point farthest from the line of best fit is at an x-value of 7. The total number of seats at the food court represented by this point is $7 \\times 80 = 560$.",
    "explanation_ai_enhanced": "First, we need to identify the data point that is vertically farthest from the line of best fit. Visually scanning the graph, the point located at x=7 (Number of restaurants) is significantly higher than all other points relative to the line. For this data point at x=7, the y-value is 80 (Average number of seats per restaurant). The question asks for the *total* number of seats in that food court. To find this, we multiply the number of restaurants by the average number of seats per restaurant: Total Seats = $7 \\text{ restaurants} \\times 80 \\text{ seats/restaurant} = 560$ seats.",
    "feedback_a": "This is incorrect. This might be the result of misidentifying the farthest point or a calculation error.",
    "feedback_b": "This value corresponds to the point at x=4 (4 restaurants * 60 seats/restaurant = 240), which is not the farthest from the line.",
    "feedback_c": "This value corresponds to the point at x=8 (8 restaurants * 40 seats/restaurant = 320), which is closer to the line than the point at x=7.",
    "feedback_d": "This is the correct answer. The point farthest from the line is at (7, 80). The total number of seats is the number of restaurants multiplied by the average seats, which is $7 \\times 80 = 560$.",
    "passage_content": null,
    "question_stem": "The scatterplot above shows the distribution of seats for the restaurants in 7 different mall food courts. The line of best fit is also shown. According to the data, what is the total number of seats at the food court represented by the data point that is farthest from the line of best fit?"
  },
  {
    "question_id": "EOC-M-C28-14",
    "source_file_name": "Math - Chapter 28 - Statistics II - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C28",
    "question_number": 14,
    "difficulty": "Medium",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Statistics",
    "Sub_Classification": "Study_Methods",
    "Concept_Classification": "Data_Evaluate_Study_Conclusion",
    "question_type": "multiple_choice",
    "image_url": null,
    "option_a": "Females are assigned to the new vaccine.",
    "option_b": "Those who have more than one allergy are assigned to the new vaccine.",
    "option_c": "The patients divide themselves evenly into two groups. A coin is tossed to decide which group receives the new vaccine.",
    "option_d": "Each patient is assigned a random number. Those with an even number are assigned to the new vaccine.",
    "option_e": null,
    "correct_answer": "Each patient is assigned a random number. Those with an even number are assigned to the new vaccine.",
    "explanation_original": "To draw a reliable conclusion about the effectiveness of the new vaccine, the patients must be randomly assigned to their treatment. Only answer (D) leads to random assignment. Note that answer (C) does not because the patients are allowed to group themselves as they desire. For example, three friends might want to remain in the same group, leading to assignment that is not random.",
    "explanation_ai_enhanced": "A reliable experiment requires random assignment to treatment groups to eliminate bias. Let's analyze the options. A) and B) are not random; they assign treatment based on specific characteristics (gender, number of allergies), which would create biased groups. C) is not truly random because it allows patients to form their own groups, which could introduce bias (e.g., friends with similar health habits grouping together). D) describes a method of true random assignment. Each patient has an equal chance of being assigned to either group based on a random number, which is a sound method for creating comparable treatment groups and leading to a reliable conclusion.",
    "feedback_a": "This is not random assignment and would introduce gender bias.",
    "feedback_b": "This is not random assignment and would introduce bias based on the severity of allergies.",
    "feedback_c": "This method is flawed because it allows self-selection into groups, which is not random.",
    "feedback_d": "This is the correct answer. Assigning treatment based on a random number is a valid method of random assignment, which is crucial for a reliable experiment.",
    "passage_content": null,
    "question_stem": "Researchers must conduct an experiment to see whether a new vaccine is effective in relieving certain allergies. They have selected a random sample of 100 allergy patients. Some of the patients are assigned to the new vaccine while the rest are assigned to the traditional treatment. Which of the following methods of assigning each patient's treatment is most likely to lead to a reliable conclusion about the effectiveness of the new vaccine?"
  },
  {
    "question_id": "EOC-M-C28-15",
    "source_file_name": "Math - Chapter 28 - Statistics II - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C28",
    "question_number": 15,
    "difficulty": "Hard",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Statistics",
    "Sub_Classification": "Interpretation",
    "Concept_Classification": "Data_Evaluate_Study_Conclusion",
    "question_type": "multiple_choice",
    "image_url": null,
    "option_a": "Most of the basketballs produced in Week 1 had an air pressure under 8.2 psi, whereas most of the basketballs produced in Week 2 had an air pressure under 7.7 psi.",
    "option_b": "The mean air pressure of all the basketballs produced in Week 1 was 0.5 psi more than the mean air pressure of all the basketballs produced in Week 2.",
    "option_c": "The number of basketballs in the Week 1 sample was more than the number of basketballs in the Week 2 sample.",
    "option_d": "It is very likely that the mean air pressure of all the basketballs produced in Week 1 was less than the mean air pressure of all the basketballs produced in Week 2.",
    "option_e": null,
    "correct_answer": "The number of basketballs in the Week 1 sample was more than the number of basketballs in the Week 2 sample.",
    "explanation_original": "Answer (C) is correct because the greater the sample size, the lower the margin of error. The sample from Week 1 had a lower margin of error than the sample from Week 2.",
    "explanation_ai_enhanced": "Margin of error is inversely related to the square root of the sample size. A smaller margin of error implies a larger sample size, assuming other factors are constant. In Week 1, the margin of error was 0.1 psi. In Week 2, the margin of error was 0.3 psi. Since the margin of error in Week 1 is smaller than in Week 2, it is reasonable to conclude that the sample size in Week 1 was larger than the sample size in Week 2. Options A and B make definitive statements about the population which cannot be made from sample data. Option D contradicts the sample means.",
    "feedback_a": "This is incorrect. The mean is the average; it doesn't mean most of the basketballs were under that value.",
    "feedback_b": "This is incorrect. The sample means are 0.5 psi apart, but we cannot be certain the true population means are exactly 0.5 psi apart. That is what the margin of error accounts for.",
    "feedback_c": "This is the correct answer. A smaller margin of error (Week 1) suggests a larger sample size compared to the sample with a larger margin of error (Week 2).",
    "feedback_d": "This is incorrect. The sample mean for Week 1 (8.2 psi) is greater than for Week 2 (7.7 psi), suggesting the opposite is more likely.",
    "passage_content": null,
    "question_stem": "A basketball manufacturer selects a random sample of its basketballs each week to ensure a consistent air pressure within them is maintained. In Week 1, the sample had a mean air pressure of 8.2 psi (pounds per square inch) and a margin of error of 0.1 psi. In Week 2, the sample had a mean air pressure of 7.7 psi and a margin of error of 0.3 psi. Based on these results, which of the following is a reasonable conclusion?"
  },
  {
    "question_id": "EOC-M-C28-16",
    "source_file_name": "Math - Chapter 28 - Statistics II - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C28",
    "question_number": 16,
    "difficulty": "Medium",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Statistics",
    "Sub_Classification": "Study_Methods",
    "Concept_Classification": "Data_Evaluate_Study_Conclusion",
    "question_type": "multiple_choice",
    "image_url": null,
    "option_a": "Residents of the same city",
    "option_b": "Customers of a certain restaurant",
    "option_c": "Viewers of the same television show",
    "option_d": "Students who are following the same daily diet plan",
    "option_e": null,
    "correct_answer": "Students who are following the same daily diet plan",
    "explanation_original": "The lower the standard deviation (variability), the lower the margin of error. Selecting students who are following the same daily diet plan will likely lead to the lowest standard deviation because they are likely to be eating the same number of servings of vegetables. The other answer choices would result in much more variability.",
    "explanation_ai_enhanced": "The margin of error in a survey is affected by the sample size and the variability (standard deviation) of the population being sampled. To get the smallest margin of error, we want the group with the lowest variability. A group of students following the same daily diet plan is the most homogeneous group among the choices. Their eating habits, specifically vegetable consumption, are likely to be very similar, resulting in a low standard deviation. The other groups are much more diverse and would have higher variability in their vegetable consumption.",
    "feedback_a": "This group is very diverse and would have high variability in diet.",
    "feedback_b": "This group is also very diverse.",
    "feedback_c": "This group is large and diverse, leading to high variability.",
    "feedback_d": "This is the correct answer. This group is the most homogeneous, meaning it will have the lowest variability (standard deviation) in vegetable consumption, which in turn leads to the smallest margin of error for a given sample size.",
    "passage_content": null,
    "question_stem": "A student is assigned to conduct a survey to determine the mean number of servings of vegetables eaten by a certain group of people each day. The student has not yet decided which group of people will be the focus of this survey. Selecting a random sample from which of the following groups would most likely give the smallest margin of error?"
  },
  {
    "question_id": "EOC-M-C28-17",
    "source_file_name": "Math - Chapter 28 - Statistics II - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C28",
    "question_number": 17,
    "difficulty": "Hard",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Statistics",
    "Sub_Classification": "Interpretation",
    "Concept_Classification": "Data_Evaluate_Study_Conclusion",
    "question_type": "multiple_choice",
    "image_url": null,
    "option_a": "95% of all blue-spotted salamanders have a tail that is between 5 and 6 inches in length.",
    "option_b": "95% of all salamanders have a tail that is between 5 and 6 inches in length.",
    "option_c": "The true average length of the tails of all blue-spotted salamanders is likely between 5 and 6 inches.",
    "option_d": "The true average length of the tails of all salamanders is likely between 5 and 6 inches.",
    "option_e": null,
    "correct_answer": "The true average length of the tails of all blue-spotted salamanders is likely between 5 and 6 inches.",
    "explanation_original": "Answer (C) best expresses the meaning of a confidence interval, which applies only to the statistical mean and does not say anything about blue-spotted salamanders themselves. Answer (D) is wrong because the study involved only blue-spotted salamanders, not all salamanders.",
    "explanation_ai_enhanced": "A confidence interval provides an estimated range of values which is likely to contain the true population parameter, in this case, the true population mean. It does not give a range for individual data points. The 95% confidence interval of 5 to 6 inches means we are 95% confident that the *true average tail length* of the entire population of blue-spotted salamanders falls between 5 and 6 inches. It applies specifically to the population from which the sample was drawn (blue-spotted salamanders).",
    "feedback_a": "This is a common misinterpretation. The interval is for the population mean, not for a percentage of individuals.",
    "feedback_b": "This is incorrect for two reasons: it refers to individuals, not the mean, and it incorrectly generalizes from 'blue-spotted salamanders' to 'all salamanders'.",
    "feedback_c": "This is the correct answer. It correctly states that the interval is an estimate for the true population average and correctly identifies the population as 'all blue-spotted salamanders'.",
    "feedback_d": "This is incorrect. The sample was of blue-spotted salamanders, so the conclusion can only be applied to that specific population, not all salamanders.",
    "passage_content": null,
    "question_stem": "The length of a blue-spotted salamander's tail can be used to estimate its age. A biologist selects 80 blue-spotted salamanders at random and finds that the average length of their tails has a 95% confidence interval of 5 to 6 inches. Which of the following conclusions is the most appropriate based on the confidence interval?"
  },
  {
    "question_id": "EOC-M-C28-18",
    "source_file_name": "Math - Chapter 28 - Statistics II - Q&A.pdf",
    "subject": "Math",
    "quiz_name": "EOC-M-C28",
    "question_number": 18,
    "difficulty": "Medium",
    "domain": "Problem-Solving & Data Analysis",
    "Primary_Classification": "Statistics",
    "Sub_Classification": "Interpretation",
    "Concept_Classification": "Data_Evaluate_Study_Conclusion",
    "question_type": "multiple_choice",
    "image_url": null,
    "option_a": "In U.S. cities, there is a positive association between the price of food and population density.",
    "option_b": "In U.S. cities, there is a negative association between the price of food and population density.",
    "option_c": "In U.S. cities, a decrease in the price of food is caused by an increase in the population density.",
    "option_d": "In U.S. cities, an increase in the population density is caused by a decrease in the price of food.",
    "option_e": null,
    "correct_answer": "In U.S. cities, there is a negative association between the price of food and population density.",
    "explanation_original": "The most that we can conclude is that there is a negative association between the price of food and the population density in U.S. cities (as one goes up, the other goes down). We CANNOT conclude that there is a cause and effect relationship between the two. We can't say that one causes the other.",
    "explanation_ai_enhanced": "The research found that the price of food is lower in places with a high population density. This describes an inverse relationship: as one variable (population density) goes up, the other variable (price of food) goes down. This is called a negative association. Importantly, this is an observational study, not a controlled experiment, so we can only conclude there is an association (correlation), not that one variable causes the other.",
    "feedback_a": "This is incorrect. A positive association would mean that as population density increases, the price of food also increases. The findings show the opposite.",
    "feedback_b": "This is the correct answer. The findings describe a relationship where one variable increases as the other decreases, which is a negative association.",
    "feedback_c": "This is an incorrect conclusion. The research shows an association, but it does not prove causation. We cannot say for sure that the population density change *causes* the price change.",
    "feedback_d": "This is an incorrect conclusion. The research shows correlation, not causation.",
    "passage_content": null,
    "question_stem": "An economist conducted research to determine whether there is a relationship between the price of food and population density. He collected data from a random sample of 100 U.S. cities and found significant evidence that the price of food is lower in places with a high population density. Which of the following conclusions is best supported by these results?"
  }
]
