[
  {
    "question_id": "EOC-R-C10-1",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 10 - Paired Passages - 160-175.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C10",
    "question_number": 1,
    "question_type": "multiple_choice",
    "passage_content": "Text 1\nBy investigating interactions between tree species, scientists have found that trees leverage similarities and differences in their microbial \"makeup\" to recognize other trees of their own species, and that they preferentially share nutrients with them through their mycorrhizal network—the systems of roots and fungi that connect them. For example, Douglas Fir trees growing in the same plot have been shown to share more carbon among them than with trees of other species.\n\nText 2\nThe notion that trees send out resources to strengthen a community composed of members of their species is unlikely because groups that cooperate would need to win out over groups made up of competing individuals. According to plant ecologist Kathryn Flinn, while trees can sometimes facilitate each other's growth, a forest does not function like a single organism: it includes a vast array of species with a constantly shifting variety of interactions, both cooperative and competitive.",
    "question_stem": "Based on the texts, what would Kathryn Flinn (Text 2) most likely say about the \"Douglas Fir trees\" in Text 1?",
    "option_a": "Their mycorrhizal network is not fully understood.",
    "option_b": "They function as if they were a single organism.",
    "option_c": "They are also likely to compete among themselves for some resources.",
    "option_d": "The amount of carbon they share will vary according to environmental conditions.",
    "correct_answer": "They are also likely to compete among themselves for some resources.",
    "explanation_original": "What does Text 1 say about Douglas Fir trees? When they grow in the same plot, they share more carbon among them than with trees of other species. Next, what is Kathryn Flinn's position (Text 2)? She asserts that while trees can sometimes help facilitate each other's growth, relationships among organisms in forest are constantly shifting and include both cooperation and competition. Logically, how would Flinn respond to the observation that Douglas firs seem to \"prefer\" sharing carbon with members of their own species? Given her perspective that species both cooperate and compete, she would probably respond to an example of cooperation by suggesting that the Douglas firs also compete at times. And that is exactly what (C) says.",
    "explanation_ai_enhanced": "Text 1 provides an example of cooperation among Douglas Fir trees (sharing nutrients). Kathryn Flinn's argument in Text 2 is that a forest is not purely cooperative but involves a mix of 'both cooperative and competitive' interactions. Therefore, when presented with the cooperative example from Text 1, Flinn would likely introduce the other side of her argument, pointing out that the same trees probably also engage in competition.",
    "feedback_a": "Flinn's argument is about the nature of interactions (cooperative vs. competitive), not the level of scientific understanding of the network.",
    "feedback_b": "This directly contradicts Flinn's statement that a forest 'does not function like a single organism.'",
    "feedback_c": "This is the correct answer. It aligns perfectly with Flinn's core argument that forest interactions are both cooperative and competitive.",
    "feedback_d": "While this might be true, it is not the central point of Flinn's argument as presented in Text 2."
  },
  {
    "question_id": "EOC-R-C10-2",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 10 - Paired Passages - 160-175.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C10",
    "question_number": 2,
    "question_type": "multiple_choice",
    "passage_content": "Text 1\nIn recent years, there has been an explosion of scientific research revealing precisely how positive feelings are beneficial. We know that they motivate people to pursue important goals and overcome obstacles, offer protective benefits against the effects of stress, improve our social connectedness, and even ward off illness. The science of happiness has spawned a small industry of motivational speakers and research enterprises. Clearly, happiness is popular.\n\nText 2\nHappiness, it turns out, has a cost when experienced too intensely. For instance, we often are told that happiness can open up our minds to foster more creative thinking and help us tackle problems or puzzles. This is the case when we experience moderate levels of happiness. But according to Mark Alan Davis's 2008 analysis of the relationship between mood and creativity, when people experience intense and perhaps overwhelming amounts of happiness, they no longer experience the same creativity boost.",
    "question_stem": "Based on the texts, what would Mark Alan Davis (Text 2) most likely respond to what \"we know\" in Text 1?",
    "option_a": "By emphasizing the connection between creativity and negative emotions",
    "option_b": "By acknowledging the benefits of positivity in moderation but cautioning against it in excess",
    "option_c": "By questioning the motives of the participants in the happiness industry",
    "option_d": "By challenging the connection between positive feelings and personal fulfillment",
    "correct_answer": "By acknowledging the benefits of positivity in moderation but cautioning against it in excess",
    "explanation_original": "What does Text 1 state that \"we know\"? ...that positive feelings are associated with a host of happy outcomes... Next, what position does Mark Alan Davis (Text 2) hold? That when people experience intense and perhaps overwhelming amounts of happiness, they no longer experience the same creativity boost. In other words, too much positivity is not a good thing. Logically, how would Davis respond to the example from Text 1? Presumably by reiterating his position that while moderate amounts of happiness are helpful, too much of it is not, i.e., 'by acknowledging [its] benefits but cautioning against it in excess.' (B) is thus correct.",
    "explanation_ai_enhanced": "Text 1 presents a universally positive view of happiness. Mark Alan Davis's research, described in Text 2, does not completely refute this but adds a critical qualification: the benefits of happiness apply at 'moderate levels,' but 'intense' happiness can be detrimental to creativity. Therefore, his response would be to agree with the benefits of happiness up to a point but warn against excessive amounts.",
    "feedback_a": "Davis's research as presented is about the limits of positive emotion, not the benefits of negative emotion.",
    "feedback_b": "This is the correct answer. It accurately reflects the nuance of Davis's position, which is about moderation versus excess.",
    "feedback_c": "The text discusses Davis's research on creativity, not his views on the 'happiness industry.'",
    "feedback_d": "Davis's research challenges the benefits of happiness on creativity when experienced in excess, not the broader connection to personal fulfillment."
  },
  {
    "question_id": "EOC-R-C10-3",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 10 - Paired Passages - 160-175.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C10",
    "question_number": 3,
    "question_type": "multiple_choice",
    "passage_content": "Text 1\nUntil recently, the concrete psychological effects of fiction on individuals and society were largely a matter of speculation. However, research in psychology is beginning to provide answers about how fiction can expand our moral imaginations. For example, a series of studies conducted by Keith Oatley, Maja Djikic, and Raymond Mar found that fiction measurably improves people's ability to guess others' mental states by looking at only their eyes. They interpreted this finding as evidence for the idea that fiction allows people to connect with something larger than themselves.\n\nText 2\nAn empirical approach to the question of whether fiction improves empathy was taken by David Kidd and Emanuele Castano, who conducted five experiments in which participants read fictional excerpts and then responded to images of facial expressions. The results showed that the participants had improved their theory of mind (ToM), or their ability to infer the thoughts and emotions of others. As Kidd points out, however, highly developed ToM does not always translate into more ethical behavior: the ability to manipulate someone, for instance, also requires a heightened understanding of other people's emotions.",
    "question_stem": "Based on the texts, how would Kidd and Castano (Text 2) most likely respond to Oatley, Djikic, and Mar in Text 1?",
    "option_a": "By acknowledging the importance of connecting with others",
    "option_b": "By conceding that fiction can allow people to transcend their everyday lives",
    "option_c": "By pointing out that empathy can have negative as well as positive effects",
    "option_d": "By emphasizing that individuals with high ToM may sometimes prefer non-fiction",
    "correct_answer": "By pointing out that empathy can have negative as well as positive effects",
    "explanation_original": "What is the position of Oatley, Djikic, and Mar in Text 1? Fiction improves people's ability to guess others' mental states and improves their ability to empathize. What is the position of Kidd and Castano in Text 2? They agree that fiction improves people's understanding of others' mindsets but point out that these skills can be used in negative ways. Logically, how would Kidd and Castano respond to the position in Text 1? That position only emphasizes the positive aspect reading fiction, so they would presumably point out the negative one. And that is what (C) says.",
    "explanation_ai_enhanced": "Both research groups agree on the basic finding: reading fiction improves theory of mind (ToM), or empathy. However, the researchers in Text 1 interpret this as a purely positive outcome ('connect with something larger than themselves'). Kidd and Castano in Text 2 add a crucial caveat: a highly developed ToM can also be used for negative purposes, like manipulation. Therefore, their response would be to qualify the positive view of Text 1 by pointing out the potential negative applications of empathy.",
    "feedback_a": "This is too general; their specific point is about the dual nature of empathy gained from fiction.",
    "feedback_b": "This phrasing is from Text 1's conclusion, which Text 2 does not directly address.",
    "feedback_c": "This is the correct answer. It captures the main point of contrast, where Text 2 introduces the potential negative side of the skills discussed in Text 1.",
    "feedback_d": "This is off-topic; neither text discusses a preference for non-fiction."
  },
  {
    "question_id": "EOC-R-C10-4",
    "source_file_name": "Erica - Digital SAT - Reading - Chapter 10 - Paired Passages - 160-175.pdf",
    "subject": "Reading",
    "quiz_name": "EOC-R-C10",
    "question_number": 4,
    "question_type": "multiple_choice",
    "passage_content": "Text 1\nOn May 21, 2019, midsize black holes were detected for the first time when the U.S.-based Laser Interferometer Gravitational-Wave Observatory (LIGO) and its European counterpart Virgo captured a tremor from a pair of black holes merging deep in space. Priyamvada Natarajan, an astrophysicist who has long worked on black-hole growth models, believes that black holes this size are born in nuclear star clusters, dense collections of stars found near galactic centers. These holes sweep through the cluster, adding gas and dust, until they settle at a single location and cease to expand.\n\nText 2\nImre Bartos and other researchers working on \"hierarchical merger\" models, in which black holes grow by eating one another, focus on one major data point in the LIGO/Virgo findings. The angular momentum, or \"spin,\" of a black hole ranges from 0 to 1. When two black holes of similar size combine, the resulting black hole usually has a spin of around 0.7. Significantly, the two black holes involved in the merger recorded by LIGO and Virgo had 0.69 and 0.73 respectively, suggesting that they both might have formed in previous mergers.",
    "question_stem": "Based on the texts, what would Imre Bartos (Text 2) most likely say about Priyamvada Natarajan's belief in Text 1?",
    "option_a": "It underestimates midsize black holes' spin.",
    "option_b": "It misstates the time when the merger occurred.",
    "option_c": "It relies too heavily on data from LIGO/VIGO.",
    "option_d": "It overlooks the significance of a crucial statistic.",
    "correct_answer": "It overlooks the significance of a crucial statistic.",
    "explanation_original": "What is Priyamvada Natarajan's belief in Text 1? That black holes this size... come from nuclear star clusters and sweep through them gathering gas and dust. What is Imre Bartos's position (Text 2)? Black holes grow by eating one another, a view that is based on an analysis of black holes' spin- a specific statistic that falls within a narrow range. Logically, how would Bartos respond to Natarajan? Because it is not mentioned that Natarajan takes \"spin\" into account, Bartos would presumably focus on the absence of that figure, i.e., \"a crucial statistic.\" That makes (D) correct.",
    "explanation_ai_enhanced": "The two texts propose different models for how midsize black holes form. Natarajan's model in Text 1 involves gathering gas and dust. Bartos's model in Text 2 involves mergers, and he uses the black holes' 'spin' as key evidence. Since Natarajan's model does not mention or account for the specific spin values that Bartos considers highly significant, Bartos would likely argue that her belief overlooks this 'crucial statistic.'",
    "feedback_a": "Natarajan's model doesn't estimate spin at all, so it can't underestimate it.",
    "feedback_b": "Both texts refer to the same event, so there is no disagreement on the time.",
    "feedback_c": "Bartos himself relies heavily on the LIGO/Virgo data, so he would not criticize Natarajan for this.",
    "feedback_d": "This is the correct answer. Bartos's entire argument hinges on the 'spin' statistic, which is absent from Natarajan's model."
  }
]
