[
  {
    "question_id": "EOC-G-C12-1",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 12 - Parallel Structure - 171-179.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C12",
    "question_number": 1,
    "question_type": "multiple_choice",
    "question_stem": "In the insect world, spiders are fearsome animals—the tiny equivalent of wolves, lions or sharks. Spiders use a wide range of strategies to capture ____ in order to avoid detection.",
    "option_a": "prey; including trapping it in webs; with sticky bolas they lasso it, and mimicking other insects",
    "option_b": "prey, including trapping it in webs, lassoing it with sticky bolas; and they mimic other insects",
    "option_c": "prey, including trapping it in webs, lassoing it with sticky bolas, and mimicking other insects",
    "option_d": "prey, including trapping it in sticky webs; to lasso it with sticky bolas, and mimicking other insects",
    "correct_answer": "prey, including trapping it in webs, lassoing it with sticky bolas, and mimicking other insects",
    "explanation_original": "Spiders use a wide range of strategies to capture prey, including trapping it in webs, lassoing it with sticky bolas, and mimicking other insects in order to avoid detection.",
    "explanation_ai_enhanced": "This question tests parallel structure in a list. The list describes three strategies spiders use. The first two items are gerund phrases ('trapping it...' and 'lassoing it...'). For the structure to be parallel, the third item must also be a gerund phrase ('mimicking other insects'). Option C correctly uses this parallel '-ing' structure for all three items.",
    "feedback_a": "This option uses an inconsistent grammatical structure ('with sticky bolas they lasso it') and mixes semicolons and commas improperly.",
    "feedback_b": "This option breaks the parallel structure by switching to an independent clause ('they mimic other insects') at the end.",
    "feedback_c": "This is the correct answer. It maintains a parallel structure with three '-ing' phrases.",
    "feedback_d": "This option breaks the parallelism by using an infinitive ('to lasso')."
  },
  {
    "question_id": "EOC-G-C12-2",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 12 - Parallel Structure - 171-179.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C12",
    "question_number": 2,
    "question_type": "multiple_choice",
    "question_stem": "Scientists have long been uncertain whether dogs can read human emotions, but evidence is growing that canines can accurately \"read\" what people feel. In fact, a recent study found that dogs are able to distinguish between expressions that indicate happiness and ____.",
    "option_a": "those that indicate fear or anger.",
    "option_b": "those in which fear or anger are indicated.",
    "option_c": "fear in anger are indicated in others.",
    "option_d": "indicating fear and anger are others.",
    "correct_answer": "those that indicate fear or anger.",
    "explanation_original": "...dogs are able to distinguish between expressions that indicate happiness and those that indicate fear or anger.",
    "explanation_ai_enhanced": "This question requires parallel structure in a comparison. The sentence structure is 'distinguish between [A] and [B]'. Item [A] is 'expressions that indicate happiness.' The most parallel structure for item [B] is 'those that indicate fear or anger,' where 'those' is a pronoun that stands for 'expressions.'",
    "feedback_a": "This is the correct answer. It maintains a parallel structure with the preceding phrase 'expressions that indicate...'.",
    "feedback_b": "This phrasing is grammatically correct but less parallel and more wordy than option A.",
    "feedback_c": "This option is ungrammatical.",
    "feedback_d": "This option is ungrammatical."
  },
  {
    "question_id": "EOC-G-C12-3",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 12 - Parallel Structure - 171-179.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C12",
    "question_number": 3,
    "question_type": "multiple_choice",
    "question_stem": "Without structural engineers, everything could twist and shake apart. Their know-how is vital to mastering green construction's novel materials and innovative practices, whether used to harness the force of the wind or ____.",
    "option_a": "capture the power that the waves have.",
    "option_b": "capturing the power of the waves.",
    "option_c": "have captured the power of the waves.",
    "option_d": "capture the power of the waves.",
    "correct_answer": "capture the power of the waves.",
    "explanation_original": "...whether used to harness the force of the wind or capture the power of the waves.",
    "explanation_ai_enhanced": "This question tests parallel structure with two items joined by 'or'. The first item is a verb phrase in its base form: 'harness the force of the wind'. For the structure to be parallel, the second item must also be a verb phrase in its base form: 'capture the power of the waves'. The repetition of 'to' is optional.",
    "feedback_a": "While grammatically correct, this option is less concise and parallel than option D.",
    "feedback_b": "This uses a gerund ('capturing'), which is not parallel with the base verb 'harness'.",
    "feedback_c": "This uses the present perfect tense, which is not parallel with the base verb 'harness'.",
    "feedback_d": "This is the correct answer. The base verb 'capture' is parallel with the base verb 'harness'."
  },
  {
    "question_id": "EOC-G-C12-4",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 12 - Parallel Structure - 171-179.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C12",
    "question_number": 4,
    "question_type": "multiple_choice",
    "question_stem": "Haiku poems, which contain just 17 syllables, can describe any person or object, but they are seldom complicated or difficult to understand. Each Haiku must contain a kigo, a season word that indicates what time of the year the Haiku is set. For example, blossoms would indicate ____.",
    "option_a": "spring; snow would give the idea of winter and summertime would be suggested by fireflies.",
    "option_b": "spring; snow would give the idea of winter; and fireflies would suggest summertime.",
    "option_c": "spring snow would give the idea of winter; and fireflies suggest summertime.",
    "option_d": "spring; the idea of winter would be given by snow; and fireflies would suggest summer.",
    "correct_answer": "spring; snow would give the idea of winter; and fireflies would suggest summertime.",
    "explanation_original": "For example, blossoms would indicate spring; snow would give the idea of winter; and fireflies would suggest summertime.",
    "explanation_ai_enhanced": "This question tests parallel structure across three clauses in a list. The first and third clauses use an active voice structure: '[noun] would [verb] [noun]' (blossoms would indicate spring; fireflies would suggest summertime). The most parallel option for the middle clause is 'snow would give the idea of winter.' Option B maintains this active structure across all three parts and uses semicolons correctly to separate the longer clauses.",
    "feedback_a": "This option breaks the parallel structure by using the passive voice ('summertime would be suggested by fireflies').",
    "feedback_b": "This is the correct answer. It maintains parallel active-voice construction for all three items in the list.",
    "feedback_c": "This option is missing a semicolon after 'spring' and incorrectly uses the present tense 'suggest'.",
    "feedback_d": "This option breaks the parallel structure by using the passive voice ('the idea of winter would be given by snow')."
  },
  {
    "question_id": "EOC-G-C12-5",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 12 - Parallel Structure - 171-179.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C12",
    "question_number": 5,
    "question_type": "multiple_choice",
    "question_stem": "For centuries, there have been reports of strange bright lights in the sky just before, during, or after an earthquake. Over the years, descriptions have varied widely: the lights have been described as flaring white streaks, floating orbs, and ____. Sometimes the lights appeared for just a few seconds, but other times they hovered in the sky for minutes or even hours at a time.",
    "option_a": "flames that flicker.",
    "option_b": "flames that are flickering.",
    "option_c": "flames to flicker.",
    "option_d": "flickering flames.",
    "correct_answer": "flickering flames.",
    "explanation_original": "...the lights have been described as flaring white streaks, floating orbs, and flickering flames.",
    "explanation_ai_enhanced": "This question tests parallel structure in a list of three noun phrases. The first two items follow a '[participle adjective] [noun]' pattern: 'flaring white streaks' and 'floating orbs'. To maintain parallelism, the third item should follow the same pattern. 'Flickering flames' fits this structure perfectly.",
    "feedback_a": "This option uses a relative clause, which is not parallel with the adjectival phrases in the list.",
    "feedback_b": "This also uses a relative clause and breaks the parallel structure.",
    "feedback_c": "This uses an infinitive phrase, which is not parallel.",
    "feedback_d": "This is the correct answer. The phrase 'flickering flames' follows the '[adjective] [noun]' pattern of the other items in the list."
  },
  {
    "question_id": "EOC-G-C12-6",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 12 - Parallel Structure - 171-179.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C12",
    "question_number": 6,
    "question_type": "multiple_choice",
    "question_stem": "Although rap music originated in the United States, it has international influences. The kora, the balafon, and the ngoni are ____ that rappers have incorporated into their music.",
    "option_a": "a West African instrument",
    "option_b": "a West African instrument,",
    "option_c": "West African instruments",
    "option_d": "West African instruments,",
    "correct_answer": "West African instruments",
    "explanation_original": "The kora, the balafon, and the ngoni are West African instruments that rappers have incorporated into their music.",
    "explanation_ai_enhanced": "The subject of the sentence is 'The kora, the balafon, and the ngoni,' which is a list of three items, making it plural. The predicate nominative that renames the subject must also be plural. 'West African instruments' is the correct plural form.",
    "feedback_a": "This is singular, but the subject is plural.",
    "feedback_b": "This is singular and has an unnecessary comma.",
    "feedback_c": "This is the correct answer. The plural 'instruments' agrees with the plural subject.",
    "feedback_d": "This option has an unnecessary comma."
  },
  {
    "question_id": "EOC-G-C12-7",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 12 - Parallel Structure - 171-179.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C12",
    "question_number": 7,
    "question_type": "multiple_choice",
    "question_stem": "Most jurors are not compensated at rates sufficient to replace lost wages. As a result, many citizens called for jury duty seek to avoid selection by demonstrating that ____ have urgent commitments or would experience financial hardship.",
    "option_a": "he or she",
    "option_b": "they",
    "option_c": "one",
    "option_d": "you",
    "correct_answer": "they",
    "explanation_original": "...many citizens called for jury duty seek to avoid selection by demonstrating that they have urgent commitments or would experience financial hardship.",
    "explanation_ai_enhanced": "This question tests pronoun agreement. The pronoun in the blank must refer to its antecedent, 'many citizens.' Since 'citizens' is a plural noun, the plural pronoun 'they' is required.",
    "feedback_a": "This is a singular pronoun, but the antecedent 'citizens' is plural.",
    "feedback_b": "This is the correct answer. The plural pronoun 'they' agrees with the plural antecedent 'many citizens'.",
    "feedback_c": "This is a singular pronoun.",
    "feedback_d": "This pronoun is not appropriate for the formal tone and third-person perspective of the sentence."
  },
  {
    "question_id": "EOC-G-C12-8",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 12 - Parallel Structure - 171-179.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C12",
    "question_number": 8,
    "question_type": "multiple_choice",
    "question_stem": "Many major historical inventions occurred simultaneously in multiple places. Writing, in contrast, had only a few independent origins, and the alphabet ____ only once in history.",
    "option_a": "has arisen",
    "option_b": "had arisen",
    "option_c": "arises",
    "option_d": "arose",
    "correct_answer": "arose",
    "explanation_original": "Writing, in contrast, had only a few independent origins, and the alphabet arose only once in history.",
    "explanation_ai_enhanced": "This question tests verb tense and parallelism. The first clause uses the simple past tense ('had'). The action in the second clause ('the alphabet arose') also occurred at a specific, completed time in the past. To maintain tense consistency, the simple past tense 'arose' is the correct choice.",
    "feedback_a": "This is the present perfect tense, used for actions continuing to the present.",
    "feedback_b": "This is the past perfect tense, used for an action that occurred before another past action.",
    "feedback_c": "This is the present tense, but the event is historical.",
    "feedback_d": "This is the correct answer. The simple past tense 'arose' is consistent with the past-tense context of the sentence."
  },
  {
    "question_id": "EOC-G-C12-9",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 12 - Parallel Structure - 171-179.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C12",
    "question_number": 9,
    "question_type": "multiple_choice",
    "question_stem": "Retrieval practice is an approach to studying that involves recalling previously learned information. The method, which can take forms including flash cards, practice tests and open-ended writing prompts, ____ learners recognize what they do and don't know.",
    "option_a": "helps",
    "option_b": "help",
    "option_c": "have helped",
    "option_d": "are helping",
    "correct_answer": "helps",
    "explanation_original": "The method... helps learners recognize what they do and don't know.",
    "explanation_ai_enhanced": "This question tests subject-verb agreement. The subject of the verb is 'The method,' which is singular. The non-essential clause between the commas describes the method but does not change the subject's number. A singular subject requires a singular verb, which is 'helps'.",
    "feedback_a": "This is the correct answer. The singular verb 'helps' agrees with the singular subject 'method'.",
    "feedback_b": "This is a plural verb.",
    "feedback_c": "This is a plural verb.",
    "feedback_d": "This is a plural verb."
  },
  {
    "question_id": "EOC-G-C12-10",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 12 - Parallel Structure - 171-179.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C12",
    "question_number": 10,
    "question_type": "multiple_choice",
    "question_stem": "Although Moby Dick has long been considered a classic work of literature, it was published to middling reviews in 1851. Its author, Herman Melville, worked as a customs inspector for most of his ____.",
    "option_a": "life; suffered from nervous exhaustion; and only modest literary success was achieved.",
    "option_b": "life; suffered from nervous exhaustion, and achieving only modest literary success.",
    "option_c": "life; suffered from nervous exhaustion; and achieved only modest literary success.",
    "option_d": "life; suffered from nervous exhaustion; and only modest literary success had been achieved.",
    "correct_answer": "life; suffered from nervous exhaustion; and achieved only modest literary success.",
    "explanation_original": "Its author, Herman Melville, worked as a customs inspector for most of his life; suffered from nervous exhaustion; and achieved only modest literary success.",
    "explanation_ai_enhanced": "This sentence contains a list of three things Herman Melville did: 'worked...', 'suffered...', and 'achieved...'. To maintain parallel structure, all three verbs in the list must be in the same form. 'Worked' and 'suffered' are in the simple past tense. Therefore, the third verb must also be in the simple past tense, 'achieved'.",
    "feedback_a": "This option breaks the parallel structure by using the passive voice ('was achieved').",
    "feedback_b": "This option breaks the parallel structure by using a gerund ('achieving').",
    "feedback_c": "This is the correct answer. It uses the simple past tense verb 'achieved', which is parallel with 'worked' and 'suffered'.",
    "feedback_d": "This option breaks the parallel structure by using the passive voice ('had been achieved')."
  },
  {
    "question_id": "EOC-G-C12-11",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 12 - Parallel Structure - 171-179.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C12",
    "question_number": 11,
    "question_type": "multiple_choice",
    "question_stem": "After a disaster like a forest fire or a volcanic eruption, the first plants to come back are the fastest colonizers particularly ferns. Unlike other types of flora, ferns sprout from minuscule spores ____.",
    "option_a": "blown long distances by the wind smaller than a grain of pollen.",
    "option_b": "that by the wind are blown long distances smaller than a grain of pollen.",
    "option_c": "smaller than a grain of pollen, which by the wind is blown long distances.",
    "option_d": "that are smaller than a grain of pollen and blown long distances by the wind.",
    "correct_answer": "that are smaller than a grain of pollen and blown long distances by the wind.",
    "explanation_original": "Unlike other types of flora, ferns sprout from minuscule spores that are smaller than a grain of pollen and blown long distances by the wind.",
    "explanation_ai_enhanced": "This question tests modification and parallel structure. The blank must describe the 'minuscule spores.' The descriptions 'smaller than a grain of pollen' and 'blown long distances by the wind' should both clearly and logically modify 'spores'. Option D uses a parallel structure ('are smaller... and blown...') that correctly modifies 'spores'.",
    "feedback_a": "This phrasing is awkward and unclear.",
    "feedback_b": "The word order in this option is awkward and unidiomatic.",
    "feedback_c": "This option incorrectly suggests that the 'grain of pollen' is blown long distances, not the spores.",
    "feedback_d": "This is the correct answer. It uses a clear and parallel structure to describe the spores."
  },
  {
    "question_id": "EOC-G-C12-12",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 12 - Parallel Structure - 171-179.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C12",
    "question_number": 12,
    "question_type": "multiple_choice",
    "question_stem": "The illegal clearing of Mexican forests once caused the Monarch butterfly to come close to losing its habitat. In recent years, however, ____.",
    "option_a": "this has declined.",
    "option_b": "that has declined.",
    "option_c": "these have declined.",
    "option_d": "this threat has declined.",
    "correct_answer": "this threat has declined.",
    "explanation_original": "In recent years, however, this threat has declined.",
    "explanation_ai_enhanced": "This question tests pronoun clarity. Using the pronoun 'this' by itself is ambiguous. What has declined? The clearing? The habitat loss? Option D clarifies the ambiguous pronoun by explicitly stating 'this threat,' making the sentence clear and precise.",
    "feedback_a": "The pronoun 'this' is ambiguous; it's unclear what it refers to.",
    "feedback_b": "The pronoun 'that' is also ambiguous.",
    "feedback_c": "The pronoun 'these' is plural and does not have a clear antecedent.",
    "feedback_d": "This is the correct answer. It replaces the vague pronoun with the specific noun 'this threat' for clarity."
  },
  {
    "question_id": "EOC-G-C12-13",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 12 - Parallel Structure - 171-179.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C12",
    "question_number": 13,
    "question_type": "multiple_choice",
    "question_stem": "Throughout the Edo period (1603-1867), the Samurai were the highest-ranking group in Japan. After the Meiji Restoration of 1868, however, the Japanese imperial family reassumed rule. The samurai caste faded away, with many of its members becoming ____.",
    "option_a": "a scholar or a bureaucrat",
    "option_b": "a scholar or bureaucrats",
    "option_c": "scholars or a bureaucrat",
    "option_d": "scholars or bureaucrats",
    "correct_answer": "scholars or bureaucrats",
    "explanation_original": "The samurai caste faded away, with many of its members becoming scholars or bureaucrats.",
    "explanation_ai_enhanced": "This question tests parallel structure with number agreement. The subject is 'many of its members,' which is plural. Therefore, the nouns that describe what they became should also be plural. 'Scholars' and 'bureaucrats' are both plural, maintaining parallel structure.",
    "feedback_a": "Both nouns are singular, which disagrees with the plural subject 'many... members'.",
    "feedback_b": "This option incorrectly mixes a singular noun ('scholar') with a plural noun ('bureaucrats').",
    "feedback_c": "This option incorrectly mixes a plural noun ('scholars') with a singular noun ('bureaucrat').",
    "feedback_d": "This is the correct answer. Both 'scholars' and 'bureaucrats' are plural, matching the subject and maintaining parallelism."
  },
  {
    "question_id": "EOC-G-C12-14",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 12 - Parallel Structure - 171-179.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C12",
    "question_number": 14,
    "question_type": "multiple_choice",
    "question_stem": "The presence of brief, high-frequency electrical events generated in the hippocampus ____ believed to indicate major events in the brain's so-called episodic memory. This type of memory involves important episodes or pieces of information, such as childhood birthday parties or old telephone numbers.",
    "option_a": "is",
    "option_b": "are",
    "option_c": "have been",
    "option_d": "were",
    "correct_answer": "is",
    "explanation_original": "The presence of brief, high-frequency electrical events generated in the hippocampus is believed to indicate major events...",
    "explanation_ai_enhanced": "This question tests subject-verb agreement. The subject of the sentence is the singular noun 'presence'. The prepositional phrases that follow ('of brief, high-frequency electrical events' and 'generated in the hippocampus') do not change the number of the subject. A singular subject requires a singular verb, such as 'is'.",
    "feedback_a": "This is the correct answer. The singular verb 'is' agrees with the singular subject 'presence'.",
    "feedback_b": "This is a plural verb.",
    "feedback_c": "This is a plural verb ('have').",
    "feedback_d": "This is a plural verb."
  },
  {
    "question_id": "EOC-G-C12-15",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 12 - Parallel Structure - 171-179.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C12",
    "question_number": 15,
    "question_type": "multiple_choice",
    "question_stem": "Bacteria push themselves forward by coiling long, threadlike appendages into corkscrew shapes that act as makeshift propellers. Because the \"propellers\" are made of a single protein, the process by which bacteria move has traditionally baffled scientists. Using cryo-electron microscopy, however, ____ the strange structure of these propellers at the level of individual atoms.",
    "option_a": "it was revealed by researchers what no traditional light microscope could see:",
    "option_b": "researchers revealed what no traditional light microscope could see:",
    "option_c": "the revelation of researchers that no traditional light microscope could see:",
    "option_d": "what no traditional light microscope could see was revealed by researchers",
    "correct_answer": "researchers revealed what no traditional light microscope could see:",
    "explanation_original": "Using cryo-electron microscopy, however, researchers revealed what no traditional light microscope could see: the strange structure of these propellers at the level of individual atoms.",
    "explanation_ai_enhanced": "This question tests for dangling modifiers. The introductory phrase 'Using cryo-electron microscopy' describes an action performed by someone. The subject of the main clause must be the one who performed that action. 'Researchers' are the ones using the microscopy. Option B correctly places 'researchers' as the subject immediately after the comma.",
    "feedback_a": "This option creates a dangling modifier; 'it' was not using the microscopy.",
    "feedback_b": "This is the correct answer. The subject 'researchers' correctly follows the introductory phrase that describes their action.",
    "feedback_c": "This option creates a sentence fragment.",
    "feedback_d": "This option creates a dangling modifier; 'what no traditional light microscope could see' was not using the microscopy."
  },
  {
    "question_id": "EOC-G-C12-16",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 12 - Parallel Structure - 171-179.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C12",
    "question_number": 16,
    "question_type": "multiple_choice",
    "question_stem": "By the beginning of the fifteenth century, Venice ____ strivers from across the Mediterranean basin. There, they ran the guard fleets that kept the city-state's adversaries in check.",
    "option_a": "has drawn",
    "option_b": "had drawn",
    "option_c": "draws",
    "option_d": "drawing",
    "correct_answer": "had drawn",
    "explanation_original": "By the beginning of the fifteenth century, Venice had drawn strivers from across the Mediterranean basin.",
    "explanation_ai_enhanced": "This question tests verb tense. The phrase 'By the beginning of the fifteenth century' indicates a point in the past. The action of drawing strivers happened *before* this specific point in time. When describing a past action that occurred before another past time or event, the past perfect tense ('had' + past participle) is used. Therefore, 'had drawn' is correct.",
    "feedback_a": "This is the present perfect tense, used for actions continuing to the present.",
    "feedback_b": "This is the correct answer. The past perfect 'had drawn' correctly describes an action completed before a specific time in the past.",
    "feedback_c": "This is the present tense.",
    "feedback_d": "This is a participle, not a main verb, and creates a sentence fragment."
  },
  {
    "question_id": "EOC-G-C12-17",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 12 - Parallel Structure - 171-179.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C12",
    "question_number": 17,
    "question_type": "multiple_choice",
    "question_stem": "In 1963, Lina Wertmüller directed her first film, The Basilisks. Although it received mixed reviews, it featured a distinctive combination of ethnographic satire and impressionistic drama that ____ Wertmüller's future works.",
    "option_a": "characterize",
    "option_b": "will characterize",
    "option_c": "would characterize",
    "option_d": "are characteristic of",
    "correct_answer": "would characterize",
    "explanation_original": "...it featured a distinctive combination...that would characterize Wertmüller's future works.",
    "explanation_ai_enhanced": "This sentence is set in the past (referring to a 1963 film). It describes something that, from that past perspective, was going to happen in the future ('future works'). To describe a future event from a past point of view, the conditional 'would' is used. 'Will' is used to describe a future event from the present perspective.",
    "feedback_a": "This is a plural, present tense verb.",
    "feedback_b": "'Will characterize' describes a future event from the present, but the sentence's main context is in the past.",
    "feedback_c": "This is the correct answer. 'Would characterize' correctly describes a future action from a past perspective.",
    "feedback_d": "This phrasing is awkward and not the best fit for the sentence."
  },
  {
    "question_id": "EOC-G-C12-18",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 12 - Parallel Structure - 171-179.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C12",
    "question_number": 18,
    "question_type": "multiple_choice",
    "question_stem": "Norman Rockwell's intricately conceived narrative paintings were widely reproduced in popular magazines. Across the United States, a vast audience of readers recognized themselves in the ____.",
    "option_a": "images stories.",
    "option_b": "image's stories.",
    "option_c": "images story's.",
    "option_d": "images' stories.",
    "correct_answer": "images' stories.",
    "explanation_original": "...a vast audience of readers recognized themselves in the images' stories.",
    "explanation_ai_enhanced": "This question tests apostrophes for possession. The sentence refers to the stories belonging to multiple 'images'. To make a plural noun that already ends in 's' possessive, an apostrophe is added after the 's'. Therefore, 'images'' is the correct form.",
    "feedback_a": "This option lacks the necessary possessive apostrophe.",
    "feedback_b": "This option incorrectly uses the singular possessive 'image's'.",
    "feedback_c": "This option incorrectly makes 'story's' possessive instead of 'images'.",
    "feedback_d": "This is the correct answer. It correctly uses the plural possessive form 'images''."
  },
  {
    "question_id": "EOC-G-C12-19",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 12 - Parallel Structure - 171-179.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C12",
    "question_number": 19,
    "question_type": "multiple_choice",
    "question_stem": "For all his fame and celebration, William Shakespeare remains a mysterious figure. Scholars are often forced to turn to speculation when discussing his activities because so few reliable sources about his personal life ____.",
    "option_a": "exists.",
    "option_b": "exist.",
    "option_c": "has existed.",
    "option_d": "is in existence.",
    "correct_answer": "exist.",
    "explanation_original": "...because so few reliable sources about his personal life exist.",
    "explanation_ai_enhanced": "This question tests subject-verb agreement. The subject of the verb is 'so few reliable sources,' which is a plural noun phrase. A plural subject requires a plural verb. 'Exist' is the correct plural, present-tense verb to state this general fact.",
    "feedback_a": "This is a singular verb, but the subject 'sources' is plural.",
    "feedback_b": "This is the correct answer. The plural verb 'exist' agrees with the plural subject 'sources'.",
    "feedback_c": "This is a singular verb ('has').",
    "feedback_d": "This is a singular verb ('is')."
  },
  {
    "question_id": "EOC-G-C12-20",
    "source_file_name": "Erica - Digital SAT - Grammar - Chapter 12 - Parallel Structure - 171-179.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C12",
    "question_number": 20,
    "question_type": "multiple_choice",
    "question_stem": "Since ancient times, the fresco has served as an important method of mural making. Consisting of watercolor applied to freshy laid plaster, ____. When the plaster sets, the painting becomes an integral part of the wall.",
    "option_a": "water is used by frescoes as a vehicle for allowing them to merge with the plaster.",
    "option_b": "water and pigment merge with the plaster to create frescoes.",
    "option_c": "frescoes use water as a vehicle that allows pigment to merge with the plaster.",
    "option_d": "pigment merges with the plaster using water as a vehicle for frescoes.",
    "correct_answer": "frescoes use water as a vehicle that allows pigment to merge with the plaster.",
    "explanation_original": "Consisting of watercolor applied to freshly laid plaster, frescoes use water as a vehicle that allows pigment to merge with the plaster.",
    "explanation_ai_enhanced": "This question tests for dangling modifiers. The introductory phrase 'Consisting of watercolor applied to freshly laid plaster' describes what a fresco is made of. Therefore, the subject of the main clause must be 'frescoes'. Only option C correctly places 'frescoes' as the subject immediately after the introductory phrase.",
    "feedback_a": "This option creates a dangling modifier; 'water' is not what consists of watercolor.",
    "feedback_b": "This option also creates a dangling modifier.",
    "feedback_c": "This is the correct answer. The subject 'frescoes' correctly follows the phrase that describes them.",
    "feedback_d": "This option creates a dangling modifier; 'pigment' is not what consists of watercolor."
  }
]
