[
  {
    "question_id": "EOC-G-C3-1",
    "source_file_name": "Erica - Grammar - Chapter 3 - Sentences & Fragments.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C3",
    "question_number": 1,
    "question_type": "multiple_choice",
    "option_a": "NO CHANGE",
    "option_b": "have been intrigued",
    "option_c": "being intrigued",
    "option_d": "were intrigued",
    "option_e": null,
    "correct_answer": "have been intrigued",
    "explanation_original": null,
    "explanation_ai_enhanced": "This option provides the correct main verb \"have been intrigued.\" The present perfect tense (\"have been\") is appropriate because the action started in the past (\"Since 2009\") and continues to the present. This change creates a complete, grammatically correct sentence.\n\nWhy A is wrong: The original phrase \"having been intrigued\" is a participial phrase, not a main verb. Without a main verb, the sentence is a fragment.\n\nWhy C is wrong: \"being intrigued\" is also a participial phrase. Using it would still result in a sentence fragment.\n\nWhy D is wrong: While \"were intrigued\" creates a complete sentence, the simple past tense does not fit the context provided by \"Since 2009.\" This phrase requires the present perfect tense to indicate an ongoing state that began in the past.",
    "feedback_a": "The original phrase \"having been intrigued\" is a participial phrase, not a main verb. Without a main verb, the sentence is a fragment.",
    "feedback_b": "This option provides the correct main verb \"have been intrigued.\" The present perfect tense (\"have been\") is appropriate because the action started in the past (\"Since 2009\") and continues to the present. This change creates a complete, grammatically correct sentence.",
    "feedback_c": "\"being intrigued\" is also a participial phrase. Using it would still result in a sentence fragment.",
    "feedback_d": "While \"were intrigued\" creates a complete sentence, the simple past tense does not fit the context provided by \"Since 2009.\" This phrase requires the present perfect tense to indicate an ongoing state that began in the past.",
    "passage_content": null,
    "question_stem": "Since 2009, physicists <u>having been intrigued</u> by possible evidence of dark matter in the center of the Milky Way galaxy."
  },
  {
    "question_id": "EOC-G-C3-2",
    "source_file_name": "Erica - Grammar - Chapter 3 - Sentences & Fragments.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C3",
    "question_number": 2,
    "question_type": "multiple_choice",
    "option_a": "NO CHANGE",
    "option_b": "is influenced by genes, the rest depends",
    "option_c": "being influenced by genes, with the rest depending",
    "option_d": "is influenced by genes; the rest depending",
    "option_e": null,
    "correct_answer": "NO CHANGE",
    "explanation_original": null,
    "explanation_ai_enhanced": "The original sentence is grammatically correct. It contains a main clause (\"Only around 25 percent... is influenced by genes\") followed by an absolute phrase (\"with the rest depending...\") that correctly modifies the main clause. This is a concise and proper construction.\n\nWhy B is wrong: This option creates a comma splice. Both \"Only around 25 percent... is influenced by genes\" and \"the rest depends...\" are independent clauses, and they cannot be joined by only a comma.\n\nWhy C is wrong: Replacing \"is influenced\" with the participle \"being influenced\" removes the main verb from the sentence, turning the entire sentence into a fragment.\n\nWhy D is wrong: A semicolon is used to connect two independent clauses. The phrase \"the rest depending...\" is not an independent clause, so using a semicolon here is incorrect.",
    "feedback_a": "The original sentence is grammatically correct. It contains a main clause (\"Only around 25 percent... is influenced by genes\") followed by an absolute phrase (\"with the rest depending...\") that correctly modifies the main clause. This is a concise and proper construction.",
    "feedback_b": "This option creates a comma splice. Both \"Only around 25 percent... is influenced by genes\" and \"the rest depends...\" are independent clauses, and they cannot be joined by only a comma.",
    "feedback_c": "Replacing \"is influenced\" with the participle \"being influenced\" removes the main verb from the sentence, turning the entire sentence into a fragment.",
    "feedback_d": "A semicolon is used to connect two independent clauses. The phrase \"the rest depending...\" is not an independent clause, so using a semicolon here is incorrect.",
    "passage_content": null,
    "question_stem": "Only around 25 percent of the variation in the human life span <u>is influenced by genes, with the rest depending</u> on other factors, including accidents, injuries, and exposure to substances that accelerate aging."
  },
  {
    "question_id": "EOC-G-C3-3",
    "source_file_name": "Erica - Grammar - Chapter 3 - Sentences & Fragments.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C3",
    "question_number": 3,
    "question_type": "multiple_choice",
    "option_a": "NO CHANGE",
    "option_b": "peregrine falcons drop",
    "option_c": "but peregrine falcons drop",
    "option_d": "peregrine falcons, they drop",
    "option_e": null,
    "correct_answer": "peregrine falcons drop",
    "explanation_original": null,
    "explanation_ai_enhanced": "This option correctly connects the introductory dependent clause (\"When they catch sight of their prey\") to the main clause (\"peregrine falcons drop...\"). Removing the unnecessary coordinating conjunction \"and\" fixes the grammatical error.\n\nWhy A is wrong: The conjunction \"and\" is not needed here. It incorrectly attempts to link the dependent clause to the main clause as if they were two equal, independent parts.\n\nWhy C is wrong: The conjunction \"but\" indicates a contrast, which is not logical in this context. The action of diving is a direct result of seeing prey, not a contrast to it.\n\nWhy D is wrong: This option introduces a redundant subject. \"Peregrine falcons\" is the subject, so adding the pronoun \"they\" immediately after it is unnecessary and grammatically incorrect.",
    "feedback_a": "The conjunction \"and\" is not needed here. It incorrectly attempts to link the dependent clause to the main clause as if they were two equal, independent parts.",
    "feedback_b": "This option correctly connects the introductory dependent clause (\"When they catch sight of their prey\") to the main clause (\"peregrine falcons drop...\"). Removing the unnecessary coordinating conjunction \"and\" fixes the grammatical error.",
    "feedback_c": "The conjunction \"but\" indicates a contrast, which is not logical in this context. The action of diving is a direct result of seeing prey, not a contrast to it.",
    "feedback_d": "This option introduces a redundant subject. \"Peregrine falcons\" is the subject, so adding the pronoun \"they\" immediately after it is unnecessary and grammatically incorrect.",
    "passage_content": null,
    "question_stem": "When they catch sight of their prey, <u>and peregrine falcons drop</u> into a steep, swift dive at more than 200 miles an hour."
  },
  {
    "question_id": "EOC-G-C3-4",
    "source_file_name": "Erica - Grammar - Chapter 3 - Sentences & Fragments.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C3",
    "question_number": 4,
    "question_type": "multiple_choice",
    "option_a": "NO CHANGE",
    "option_b": "uses computers",
    "option_c": "to use computers",
    "option_d": "by using computers",
    "option_e": null,
    "correct_answer": "uses computers",
    "explanation_original": null,
    "explanation_ai_enhanced": "This option provides the correct verb \"uses\" for the subject \"the theoretical branch.\" This creates a complete, parallel independent clause (\"the theoretical branch uses computers...\"), correctly joined to the first clause by \"whereas.\"\n\nWhy A is wrong: \"using computers\" is a participial phrase, not a main verb. This makes the second half of the sentence a fragment. The structure requires a main verb to parallel \"relies.\"\n\nWhy C is wrong: \"to use computers\" is an infinitive phrase. It cannot function as the main verb of the clause, resulting in a sentence fragment.\n\nWhy D is wrong: \"by using computers\" is a prepositional phrase. It also fails to provide the necessary main verb, leaving the clause as a fragment.",
    "feedback_a": "\"using computers\" is a participial phrase, not a main verb. This makes the second half of the sentence a fragment. The structure requires a main verb to parallel \"relies.\"",
    "feedback_b": "This option provides the correct verb \"uses\" for the subject \"the theoretical branch.\" This creates a complete, parallel independent clause (\"the theoretical branch uses computers...\"), correctly joined to the first clause by \"whereas.\"",
    "feedback_c": "\"to use computers\" is an infinitive phrase. It cannot function as the main verb of the clause, resulting in a sentence fragment.",
    "feedback_d": "\"by using computers\" is a prepositional phrase. It also fails to provide the necessary main verb, leaving the clause as a fragment.",
    "passage_content": null,
    "question_stem": "The observational branch of astronomy relies on the collection of data from celestial bodies, whereas the theoretical branch <u>using computers</u> to analyze their movements."
  },
  {
    "question_id": "EOC-G-C3-5",
    "source_file_name": "Erica - Grammar - Chapter 3 - Sentences & Fragments.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C3",
    "question_number": 5,
    "question_type": "multiple_choice",
    "option_a": "NO CHANGE",
    "option_b": "gather for the FIRST Robotics Competition, an experience that can change their lives.",
    "option_c": "an experience that can change lives, participate in the event.",
    "option_d": "who gather for the FIRST Robotics Competition, which is an experience that can change lives.",
    "option_e": null,
    "correct_answer": "gather for the FIRST Robotics Competition, an experience that can change their lives.",
    "explanation_original": null,
    "explanation_ai_enhanced": "The original sentence is a fragment because \"students\" is modified by a clause (\"who gather...\") but never gets a main verb. This option corrects the error by making \"gather\" the main verb for the subject \"students\" and properly setting off the appositive phrase (\"an experience...\") with a comma.\n\nWhy A is wrong: The original is a fragment. \"Students\" is the subject, but there is no verb that \"students\" perform. The verb \"gather\" is inside a subordinate clause.\n\nWhy C is wrong: This option places the verb \"participate\" after the appositive phrase, creating an awkward and illogical sentence structure.\n\nWhy D is wrong: This option compounds the fragment error by adding another subordinate clause (\"which is...\") without ever providing a main verb for the subject \"students.\"",
    "feedback_a": "The original is a fragment. \"Students\" is the subject, but there is no verb that \"students\" perform. The verb \"gather\" is inside a subordinate clause.",
    "feedback_b": "The original sentence is a fragment because \"students\" is modified by a clause (\"who gather...\") but never gets a main verb. This option corrects the error by making \"gather\" the main verb for the subject \"students\" and properly setting off the appositive phrase (\"an experience...\") with a comma.",
    "feedback_c": "This option places the verb \"participate\" after the appositive phrase, creating an awkward and illogical sentence structure.",
    "feedback_d": "This option compounds the fragment error by adding another subordinate clause (\"which is...\") without ever providing a main verb for the subject \"students.\"",
    "passage_content": null,
    "question_stem": "Each spring, students who gather from around the world for the FIRST Robotics Competition, <u>an experience that can change lives</u>."
  },
  {
    "question_id": "EOC-G-C3-6",
    "source_file_name": "Erica - Grammar - Chapter 3 - Sentences & Fragments.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C3",
    "question_number": 6,
    "question_type": "multiple_choice",
    "option_a": "NO CHANGE",
    "option_b": "having been deemed ineffective.",
    "option_c": "have been deemed ineffective.",
    "option_d": "which have been deemed ineffective.",
    "option_e": null,
    "correct_answer": "have been deemed ineffective.",
    "explanation_original": null,
    "explanation_ai_enhanced": "Removing the unnecessary conjunction \"and\" allows the verb phrase \"have been deemed\" to correctly link to the subject \"Many forms of meditation.\" The phrase between the commas is a non-essential appositive describing meditation.\n\nWhy A is wrong: The conjunction \"and\" incorrectly suggests it's joining two independent clauses, but what comes before it is just a subject (\"Many forms of meditation\") with a modifying phrase. This creates a fragment.\n\nWhy B is wrong: \"having been deemed\" is a participial phrase, not a main verb. This choice would still result in a sentence fragment.\n\nWhy D is wrong: Adding \"which\" turns the end of the sentence into a dependent clause. The sentence would then have a subject but no main verb, making it a fragment.",
    "feedback_a": "The conjunction \"and\" incorrectly suggests it's joining two independent clauses, but what comes before it is just a subject (\"Many forms of meditation\") with a modifying phrase. This creates a fragment.",
    "feedback_b": "\"having been deemed\" is a participial phrase, not a main verb. This choice would still result in a sentence fragment.",
    "feedback_c": "Removing the unnecessary conjunction \"and\" allows the verb phrase \"have been deemed\" to correctly link to the subject \"Many forms of meditation.\" The phrase between the commas is a non-essential appositive describing meditation.",
    "feedback_d": "Adding \"which\" turns the end of the sentence into a dependent clause. The sentence would then have a subject but no main verb, making it a fragment.",
    "passage_content": null,
    "question_stem": "Many forms of meditation, a practice that has been examined by researchers over the last several decades, <u>and have been deemed ineffective</u>."
  },
  {
    "question_id": "EOC-G-C3-7",
    "source_file_name": "Erica - Grammar - Chapter 3 - Sentences & Fragments.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C3",
    "question_number": 7,
    "question_type": "multiple_choice",
    "option_a": "NO CHANGE",
    "option_b": "the average person in the United States consumes",
    "option_c": "and the average person in the United States consuming",
    "option_d": "the average person in the United States having consumed",
    "option_e": null,
    "correct_answer": "NO CHANGE",
    "explanation_original": null,
    "explanation_ai_enhanced": "The original sentence is grammatically correct. It contains a main clause (\"They enjoy national popularity\") followed by an absolute phrase (\"with the average person...consuming...\") that correctly modifies the main clause by adding more information.\n\nWhy B is wrong: This option creates a comma splice. \"They enjoy national popularity\" and \"the average person...consumes\" are both independent clauses joined only by a comma.\n\nWhy C is wrong: The conjunction \"and\" cannot be followed by a participial phrase (\"consuming\") in this way. It creates an ungrammatical and non-parallel structure.\n\nWhy D is wrong: This option creates an awkward participial phrase (\"having consumed\") that doesn't fit the continuous nature implied by \"each year.\" The original \"consuming\" is more appropriate.",
    "feedback_a": "The original sentence is grammatically correct. It contains a main clause (\"They enjoy national popularity\") followed by an absolute phrase (\"with the average person...consuming...\") that correctly modifies the main clause by adding more information.",
    "feedback_b": "This option creates a comma splice. \"They enjoy national popularity\" and \"the average person...consumes\" are both independent clauses joined only by a comma.",
    "feedback_c": "The conjunction \"and\" cannot be followed by a participial phrase (\"consuming\") in this way. It creates an ungrammatical and non-parallel structure.",
    "feedback_d": "This option creates an awkward participial phrase (\"having consumed\") that doesn't fit the continuous nature implied by \"each year.\" The original \"consuming\" is more appropriate.",
    "passage_content": null,
    "question_stem": "They enjoy national popularity, <u>with the average person in the United States consuming</u> over 25 pounds of them each year."
  },
  {
    "question_id": "EOC-G-C3-8",
    "source_file_name": "Erica - Grammar - Chapter 3 - Sentences & Fragments.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C3",
    "question_number": 8,
    "question_type": "multiple_choice",
    "option_a": "NO CHANGE",
    "option_b": "suggest that water has been present on Earth since the planet was formed, some scientists remain skeptical.",
    "option_c": "suggesting that water has been present on Earth since the planet was formed.",
    "option_d": "suggest that water has been present on Earth since the planet was formed;",
    "option_e": null,
    "correct_answer": "suggest that water has been present on Earth since the planet was formed, some scientists remain skeptical.",
    "explanation_original": null,
    "explanation_ai_enhanced": "The word \"Although\" is a subordinating conjunction, which introduces a dependent clause. A dependent clause cannot stand alone as a sentence. This option adds an independent clause (\"some scientists remain skeptical\") to complete the thought, creating a grammatically correct sentence.\n\nWhy A is wrong: The original sentence is a fragment because it is a dependent clause without an independent clause to complete its meaning.\n\nWhy C is wrong: Changing \"suggest\" to \"suggesting\" turns the verb into a participle, which does not solve the fragment issue. The sentence still lacks a main clause.\n\nWhy D is wrong: Ending with a semicolon is incorrect. A semicolon must be followed by an independent clause, not nothing. This still leaves a fragment.",
    "feedback_a": "The original sentence is a fragment because it is a dependent clause without an independent clause to complete its meaning.",
    "feedback_b": "The word \"Although\" is a subordinating conjunction, which introduces a dependent clause. A dependent clause cannot stand alone as a sentence. This option adds an independent clause (\"some scientists remain skeptical\") to complete the thought, creating a grammatically correct sentence.",
    "feedback_c": "Changing \"suggest\" to \"suggesting\" turns the verb into a participle, which does not solve the fragment issue. The sentence still lacks a main clause.",
    "feedback_d": "Ending with a semicolon is incorrect. A semicolon must be followed by an independent clause, not nothing. This still leaves a fragment.",
    "passage_content": null,
    "question_stem": "Although findings from one recent study about meteorites <u>suggest that water has been present on Earth since the planet was formed</u>."
  },
  {
    "question_id": "EOC-G-C3-9",
    "source_file_name": "Erica - Grammar - Chapter 3 - Sentences & Fragments.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C3",
    "question_number": 9,
    "question_type": "multiple_choice",
    "option_a": "NO CHANGE",
    "option_b": "memoirs follow",
    "option_c": "memoirs following",
    "option_d": "and memoirs follow",
    "option_e": null,
    "correct_answer": "memoirs follow",
    "explanation_original": null,
    "explanation_ai_enhanced": "The introductory phrase \"Usually structured differently from autobiographies\" is a participial phrase that modifies the subject, \"memoirs.\" It should be followed directly by that subject. Removing the unnecessary conjunction \"but\" corrects the sentence.\n\nWhy A is wrong: The conjunction \"but\" is not needed to connect the introductory phrase to the main clause and makes the sentence ungrammatical.\n\nWhy C is wrong: \"following\" is a participle, not a main verb. This choice turns the entire sentence into a large fragment.\n\nWhy D is wrong: Like \"but,\" the conjunction \"and\" is unnecessary and incorrectly placed after an introductory modifying phrase.",
    "feedback_a": "The conjunction \"but\" is not needed to connect the introductory phrase to the main clause and makes the sentence ungrammatical.",
    "feedback_b": "The introductory phrase \"Usually structured differently from autobiographies\" is a participial phrase that modifies the subject, \"memoirs.\" It should be followed directly by that subject. Removing the unnecessary conjunction \"but\" corrects the sentence.",
    "feedback_c": "\"following\" is a participle, not a main verb. This choice turns the entire sentence into a large fragment.",
    "feedback_d": "Like \"but,\" the conjunction \"and\" is unnecessary and incorrectly placed after an introductory modifying phrase.",
    "passage_content": null,
    "question_stem": "Usually structured differently from autobiographies, <u>but memoirs follow</u> the development of an author's personality rather than the Grammar of his or her works."
  },
  {
    "question_id": "EOC-G-C3-10",
    "source_file_name": "Erica - Grammar - Chapter 3 - Sentences & Fragments.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C3",
    "question_number": 10,
    "question_type": "multiple_choice",
    "option_a": "NO CHANGE",
    "option_b": "which is home to 9.5 million people and it is",
    "option_c": "is home to 9.5 million people and is",
    "option_d": "being home to 9.5 million people and is",
    "option_e": null,
    "correct_answer": "is home to 9.5 million people and is",
    "explanation_original": null,
    "explanation_ai_enhanced": "Removing the relative pronoun \"which\" allows \"is home\" to function as the main verb for the subject \"Chicago's metropolitan area.\" This creates a complete and direct sentence.\n\nWhy A is wrong: The use of \"which\" turns the rest of the sentence into a dependent clause. Since there is no main clause for it to modify, the sentence is a fragment.\n\nWhy B is wrong: This option still includes the fragment-creating \"which\" and adds a redundant pronoun \"it,\" making the structure even more flawed.\n\nWhy D is wrong: \"Being\" is a participle, not a main verb. Using it would fail to correct the fragment and would instead create a different kind of fragment.",
    "feedback_a": "The use of \"which\" turns the rest of the sentence into a dependent clause. Since there is no main clause for it to modify, the sentence is a fragment.",
    "feedback_b": "This option still includes the fragment-creating \"which\" and adds a redundant pronoun \"it,\" making the structure even more flawed.",
    "feedback_c": "Removing the relative pronoun \"which\" allows \"is home\" to function as the main verb for the subject \"Chicago's metropolitan area.\" This creates a complete and direct sentence.",
    "feedback_d": "\"Being\" is a participle, not a main verb. Using it would fail to correct the fragment and would instead create a different kind of fragment.",
    "passage_content": null,
    "question_stem": "Chicago's metropolitan area, sometimes called Chicagoland, <u>which is home to 9.5 million people and is</u> the third largest in the United States."
  },
  {
    "question_id": "EOC-G-C3-11",
    "source_file_name": "Erica - Grammar - Chapter 3 - Sentences & Fragments.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C3",
    "question_number": 11,
    "question_type": "multiple_choice",
    "option_a": "NO CHANGE",
    "option_b": "she released her first gospel-influenced album later that year.",
    "option_c": "and releasing her first gospel-influenced album later that year.",
    "option_d": "which she released her first gospel-influenced album later that year.",
    "option_e": null,
    "correct_answer": "NO CHANGE",
    "explanation_original": null,
    "explanation_ai_enhanced": "The sentence is grammatically correct as is. The main clause is \"She began adding elements...\" and the participial phrase \"releasing her first...\" correctly modifies the subject \"She,\" describing a subsequent action.\n\nWhy B is wrong: This creates a comma splice. \"She began adding...\" and \"she released...\" are two independent clauses that cannot be joined by only a comma.\n\nWhy C is wrong: Adding the conjunction \"and\" before the participle \"releasing\" creates an ungrammatical, non-parallel structure.\n\nWhy D is wrong: The use of \"which\" is incorrect here. \"Which\" typically refers to the noun immediately preceding it (in this case, \"year\"), which is illogical. The resulting clause is also awkwardly constructed.",
    "feedback_a": "The sentence is grammatically correct as is. The main clause is \"She began adding elements...\" and the participial phrase \"releasing her first...\" correctly modifies the subject \"She,\" describing a subsequent action.",
    "feedback_b": "This creates a comma splice. \"She began adding...\" and \"she released...\" are two independent clauses that cannot be joined by only a comma.",
    "feedback_c": "Adding the conjunction \"and\" before the participle \"releasing\" creates an ungrammatical, non-parallel structure.",
    "feedback_d": "The use of \"which\" is incorrect here. \"Which\" typically refers to the noun immediately preceding it (in this case, \"year\"), which is illogical. The resulting clause is also awkwardly constructed.",
    "passage_content": null,
    "question_stem": "She began adding elements of gospel music into her songs in early 1961, <u>releasing her first gospel-influenced album later that year</u>."
  },
  {
    "question_id": "EOC-G-C3-12",
    "source_file_name": "Erica - Grammar - Chapter 3 - Sentences & Fragments.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C3",
    "question_number": 12,
    "question_type": "multiple_choice",
    "option_a": "NO CHANGE",
    "option_b": "it emerges from what people learn and how they live.",
    "option_c": "and emerging from what people learn and how they live.",
    "option_d": "emerging from what people learn and also how they live.",
    "option_e": null,
    "correct_answer": "NO CHANGE",
    "explanation_original": null,
    "explanation_ai_enhanced": "This sentence is correct. The main clause is \"the process of Grammar fiction is largely unconscious.\" The participial phrase \"emerging from...\" correctly modifies \"process,\" explaining its origin.\n\nWhy B is wrong: This choice creates a comma splice by joining two independent clauses (\"the process...is unconscious\" and \"it emerges from...\") with only a comma.\n\nWhy C is wrong: While not a comma splice, adding \"and\" makes the structure slightly awkward. It attempts to make \"unconscious\" and \"emerging\" parallel adjectives, which isn't the intended meaning. The original participial phrase is clearer and more effective.\n\nWhy D is wrong: Adding \"also\" is redundant and unnecessary. The word \"and\" already implies addition, making \"also\" superfluous and slightly weakening the style.",
    "feedback_a": "This sentence is correct. The main clause is \"the process of Grammar fiction is largely unconscious.\" The participial phrase \"emerging from...\" correctly modifies \"process,\" explaining its origin.",
    "feedback_b": "This choice creates a comma splice by joining two independent clauses (\"the process...is unconscious\" and \"it emerges from...\") with only a comma.",
    "feedback_c": "While not a comma splice, adding \"and\" makes the structure slightly awkward. It attempts to make \"unconscious\" and \"emerging\" parallel adjectives, which isn't the intended meaning. The original participial phrase is clearer and more effective.",
    "feedback_d": "Adding \"also\" is redundant and unnecessary. The word \"and\" already implies addition, making \"also\" superfluous and slightly weakening the style.",
    "passage_content": null,
    "question_stem": "According to author Nadine Gordimer, the process of Grammar fiction is largely unconscious, <u>emerging from what people learn and how they live</u>."
  },
  {
    "question_id": "EOC-G-C3-13",
    "source_file_name": "Erica - Grammar - Chapter 3 - Sentences & Fragments.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C3",
    "question_number": 13,
    "question_type": "multiple_choice",
    "option_a": "NO CHANGE",
    "option_b": "to be a major highway for transportation, migration, and trade",
    "option_c": "were a major highway for transportation, migration, and trade",
    "option_d": "as a major highway for transportation, migration, and trade",
    "option_e": null,
    "correct_answer": "were a major highway for transportation, migration, and trade",
    "explanation_original": null,
    "explanation_ai_enhanced": "This option provides the main verb \"were\" for the subject \"the Great Lakes.\" This completes the main clause and creates a grammatically correct sentence.\n\nWhy A is wrong: The word \"being\" is a present participle and cannot function as the main verb of a sentence on its own. This makes the original sentence a fragment.\n\nWhy B is wrong: \"to be\" is an infinitive. It cannot serve as the main verb, so this option would also result in a fragment.\n\nWhy D is wrong: \"as a major highway\" is a prepositional phrase. This option removes the verb entirely, ensuring the sentence remains a fragment.",
    "feedback_a": "The word \"being\" is a present participle and cannot function as the main verb of a sentence on its own. This makes the original sentence a fragment.",
    "feedback_b": "\"to be\" is an infinitive. It cannot serve as the main verb, so this option would also result in a fragment.",
    "feedback_c": "This option provides the main verb \"were\" for the subject \"the Great Lakes.\" This completes the main clause and creates a grammatically correct sentence.",
    "feedback_d": "\"as a major highway\" is a prepositional phrase. This option removes the verb entirely, ensuring the sentence remains a fragment.",
    "passage_content": null,
    "question_stem": "In the nineteenth century, the Great Lakes <u>being a major highway for transportation, migration, and trade</u>, as well as home to a large number of aquatic species."
  },
  {
    "question_id": "EOC-G-C3-14",
    "source_file_name": "Erica - Grammar - Chapter 3 - Sentences & Fragments.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C3",
    "question_number": 14,
    "question_type": "multiple_choice",
    "option_a": "NO CHANGE",
    "option_b": "century—being a beachcomber",
    "option_c": "century, was a beachcomber",
    "option_d": "century—a beachcomber",
    "option_e": null,
    "correct_answer": "NO CHANGE",
    "explanation_original": null,
    "explanation_ai_enhanced": "The original sentence is grammatically correct. The subject (\"Amelia Griffiths\") and verb (\"was\") are correctly placed. The phrase set off by em dashes is a non-essential appositive that properly modifies the subject.\n\nWhy B is wrong: Replacing the main verb \"was\" with the participle \"being\" removes the main verb from the sentence, turning it into a fragment.\n\nWhy C is wrong: While commas can also set off non-essential elements, the standard convention is to be consistent. Since the phrase begins with an em dash (—), it should also end with one. Mixing punctuation this way is considered poor style.\n\nWhy D is wrong: This choice removes the main verb \"was\" entirely, leaving the subject \"Amelia Griffiths\" without a predicate and turning the sentence into a fragment.",
    "feedback_a": "The original sentence is grammatically correct. The subject (\"Amelia Griffiths\") and verb (\"was\") are correctly placed. The phrase set off by em dashes is a non-essential appositive that properly modifies the subject.",
    "feedback_b": "Replacing the main verb \"was\" with the participle \"being\" removes the main verb from the sentence, turning it into a fragment.",
    "feedback_c": "While commas can also set off non-essential elements, the standard convention is to be consistent. Since the phrase begins with an em dash (—), it should also end with one. Mixing punctuation this way is considered poor style.",
    "feedback_d": "This choice removes the main verb \"was\" entirely, leaving the subject \"Amelia Griffiths\" without a predicate and turning the sentence into a fragment.",
    "passage_content": null,
    "question_stem": "Amelia Griffiths—one of the most prominent amateur scientists of the early nineteenth <u>century—was a beachcomber</u> who compiled many important collections of algae specimens."
  },
  {
    "question_id": "EOC-G-C3-15",
    "source_file_name": "Erica - Grammar - Chapter 3 - Sentences & Fragments.pdf",
    "subject": "Grammar",
    "quiz_name": "EOC-G-C3",
    "question_number": 15,
    "question_type": "multiple_choice",
    "option_a": "NO CHANGE",
    "option_b": "Most of them have now been replaced",
    "option_c": "Having been mostly replaced",
    "option_d": "The replacement of them has now been done",
    "option_e": null,
    "correct_answer": "Most of them have now been replaced",
    "explanation_original": null,
    "explanation_ai_enhanced": "The pronoun \"which\" makes the original a dependent clause, and thus a fragment. By replacing \"which\" with the pronoun \"them,\" the clause becomes an independent, standalone sentence with a clear subject (\"Most of them\") and verb (\"have now been replaced\").\n\nWhy A is wrong: The use of \"which\" signifies that this is a relative clause that should be modifying a noun in a preceding main clause. Standing alone, it's a fragment.\n\nWhy C is wrong: \"Having been\" is a participial phrase. This option lacks a subject and a main verb, creating a different type of fragment.\n\nWhy D is wrong: This option is passive, wordy, and awkward (\"The replacement...has now been done\"). Option B is direct, concise, and grammatically correct.",
    "feedback_a": "The use of \"which\" signifies that this is a relative clause that should be modifying a noun in a preceding main clause. Standing alone, it's a fragment.",
    "feedback_b": "The pronoun \"which\" makes the original a dependent clause, and thus a fragment. By replacing \"which\" with the pronoun \"them,\" the clause becomes an independent, standalone sentence with a clear subject (\"Most of them\") and verb (\"have now been replaced\").",
    "feedback_c": "\"Having been\" is a participial phrase. This option lacks a subject and a main verb, creating a different type of fragment.",
    "feedback_d": "This option is passive, wordy, and awkward (\"The replacement...has now been done\"). Option B is direct, concise, and grammatically correct.",
    "passage_content": null,
    "question_stem": "<u>Most of which have now been replaced</u> by more modern forms of transportation, including cars, subways, and trams."
  }
]
